{
    "notice-1": [
        "NOTICE OF PUBLIC SALE OF PERSONAL PROPERTY Pursuant to the California Self-Service Storage Facility Act, (B & P Code 21700 et. Seq.) and the judgement entered on January 16, 2024 in the action entitled \"Rhoads Property Holdings, LLC, dba CSI Mini Storage vs. Sara M. Hauge\", et al, Case No. 22CV021257 (Copy Attached), the undersigned will sell at Public Auction on Thursday, February 15, 2024 at 1:00 pm the personal property stored by Sara M. Hauge in Storage Unit Numbers: 104, 51A, 63B and 69F, which are located at: Rhoads Property Holdings, LLC, dba CSI Mini Storage 51 W. Hornet Ave., Alameda, CA. 94501 Ph: (510) 748-1851 The auction will be conducted by Nor Cal Storage, Auctions, Inc. Bond No. 7900468597 Ph. (916) 604-9695 ATS# 6804679 Jan. 25, Feb. 1, 2024"
    ],
    "notice-2": [
        "Notice of Public Onsite Auction NOTICE IS HEREBY GIVEN that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to sections 21700 - 21716 of the CA Business and Professions Code, CA Commercial Code Section 2328, Section 1812.600 - 1812.609 and Section 1988 of CA Civil Code, 353 of the Penal Code. The undersigned will sell at public sale by competitive bidding on Tuesday the 20th day of February, 2024 at 10:30 A.M., on storagetreasures.com: household goods, tools, electronics, and personal effects, have been stored and which are located at Trojan Storage of Salinas, 110 Kern Street, Salinas, California 93905, County of Monterey, the following: Customer Name, Unit #: Rosalia Castro Garcia, 22; Elba Xitalic Michel Gomez, 46; Danuelle Mcdonald, 97; Chantel Le Treece Chambers, 102; Gema Ramirez, 121; Angelena Broussard-Barnes, 227; Louis Perez, 230; Dominga Pichardo, 302. Purchases must be paid for at the time of purchase in cash only. All purchased items sold as is, where is and must be removed at the time of sale. Sale subject to cancellation in the event of settlement between owner and obligated party. Andasol Management, Inc. Bond #: 791831C (888) 264-5438 CN103417 02-20-2024 Jan 31, Feb 9, 2024"
    ],
    "notice-3": [
        "Public Online Sale Redtop Storage 1322 Nord Ave., Chico, CA 95926. Notice is hereby given that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to Sections 21700-21716 of the Business & Professions Code, Section 2328 of the UCC, Section 535 of the Penal Code and provisions of the Civil Code. The undersigned will sell by online auction at: www.storagetreasures.com, beginning 10:00 am, February 5th, 2024 and ending 10:00 am, February 8th, 2024. The premises where said property is stored are located at Redtop Storage 1322 Nord Ave, Chico, (CA) county of (Butte), State of California, for the following parties: Stacie Peters - misc goods Stacie Peters - misc goods Jackie Murray - misc goods All purchased items must be paid for in CASH within 48 hours of the close of auction, all items are sold as is, where is, and must be removed within 48 hours after close of online auction. A $100 refundable deposit is required for each unit. Sale is subject to cancellation in the event of settlement between owner and obligated party. Agent reserves the right to halt sale of any unit. Redtop Storage (530) 892-9153 Storage Treasures California Bond #63747122 Published 01/25, 02/01/2024"
    ],
    "notice-4": [],
    "notice-5": [
        "Notice of lien sale: Saturday 02/09/2024 at 1:00pm at Bidwell Self Storage, 65 Heritage Lane, Chico, 530.893.2109. Pursuant to California Business Code 21700, in lieu of rents due, the following units contain clothes, furniture, boxes, household goods, etc. The unit numbers and names are: 009CC, 5x6, Angelina Ledesma, clothes, boxes and household items 028CC, 10x12, John Silveira, clothes, boxes and household items 117CC, 5x5, Connor Rierra, clothes, boxes and household items 244SS, 10x12, John Silveira, clothes, boxes and household items 257SS, 5x7, Bradley Webber, clothes, boxes and household items 270SS, 5x5, Travis Nelson, clothes, boxes and household items 278SS, 6x10, Henry Harmon, clothes, and boxes 279SS, 6x12, Michelle Stanton, clothes, boxes and household items 468AC, 5x5, Christopher Williams, clothes and boxes 475CC, 10x12, Gianni Bruzon, clothes, boxes and household items Published 01/25, 02/01/2024"
    ],
    "notice-6": [],
    "notice-7": [],
    "notice-8": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTIONNotice is hereby given that personal property in the following units will be sold at public auction, on the 14th day of February, 2024 at or after 8:30am pursuant to the California Self-Storage Facility Act. The sale will be conducted at: U-Haul Moving & Storage of Inglewood, 964 S. La Brea Ave. Inglewood California 90301. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following persons:Christian Frazier0904Triva Carter2340Tenay Travis1342Eugena Cooley2095Brandi Ridgle1007Long Beach Press-TelegramPublished: 1/31, 2/7/24"
    ],
    "notice-9": [
        "Notice of Public AUCTION as defined by the California Self Storage Facilities Act, Business and Professions Code sections 21700 - 21716. Located at: Interstate Storage Richmond, 720 National Court Richmond, CA 94804. Date of sale: the undersigned will sell at public auction on Thursday, February 15th, 2024, at 2:00PM, personal and/or business property including but not limited to furniture, sporting equipment, clothing, tools and other household/business items. Property being sold: Derek L. Williams Bags, Toolbox, Briefcase, Microwave, Speakers, Vacuum, Clothing, Shoes, Monitor, Printer, Fishing Pole, File Cabinet, Scooter, Small Compressor Cart. Auction conducted by: Nor Cal Storage Auctions Inc; Phone: (916) 604-9695; CA Bond #7900390179 Terms: CASH ONLY. Interstate Storage reserves the right to refuse any bid or cancel auction. WCT 6806388 Feb. 1, 8, 2024"
    ],
    "notice-10": [
        "NOTICE OF LIEN SALE Notice is hereby given, StorQuest Self Storage 11998 Arrow Route, Rancho Cucamonga, CA 91739, Ph: 9099801303, Email: cucamonga02@storquest.com will sell at public sale by competitive bidding the personal property of :Yuhua Li, Karen KimbellHanson, Leah Corona, Charles Strohm, Joe E Verdugo, Tishira Thomas. Property to be sold: Misc. household goods, furniture, tools, clothes, boxes, & personal contents. Auctioneer Company: www.storagetreasures.com. The Sale will conclude at 11:00 AM On February 15, 2024. Goods must be paid in CASH and removed at the time of sale. Sale is subject to cancellation in the event of the settlement between owner and obligated party. Inland Valley Daily Bulletin SB Published: 1/31, 2/7/24"
    ],
    "notice-11": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTION Notice is hereby given that personal property in the following units will be sold at Public Auction on the 14th of February, 2024 at or after 8:30am Pursuant to the California SelfStorage Facility Act. The sale will be conducted at: UHaul Moving & Storage of Baldwin Hills, 5051 Obama Blvd. Los Angeles, California 90016. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following person Dimitry Ivanov 2554 Shanemah Williams 2153 Jeremiah Mandley 2663 Wilbur Bruce 2047 Juana Piritaramos 1249 Kenneth Howard 2608 Michael Black 2395 Quiana Brown 2538 Curtis Johnson 1341 Lev Smagin 2149 Ernesto Hernandez 2702 Michael Koontz 1214 Michelle Anglade 2487 Quiana Brown 2534 Dara Krausankas 2114 Anthony Gillett 2122 Joy Austin 2421 Rakeya Reynolds 2818 Joanna Gardner 2630 Long Beach PressTelegram Published: 1/31, 2/7/24"
    ],
    "notice-12": [
        "Notice of Public Sale Notice is hereby given that SPS Palm Desert at 39505 Berkey Dr. Palm Desert CA, 92211 sell the contents of the storage units listed below at a public auction to satisfy a lien placed on the contents (pursuant to Division 8 Chapter 10 Sec 2170021716 of the California Codes). The sale will take place at the website www.StorageTreasures.com on February 14th at 12:00PM The sale will be conducted under the direction of Christopher Rosa (Bond3112562) and www.StorageTreasures.com on behalf of the facility's management. Units will be available for viewing prior to the sale on www.StorageTreasures.com. Contents will be sold for cash only to the highest bidder. A 1015% buyer's premium will be charged and possibly a cleaning deposit per unit. All sales are final. Seller reserves the right to withdraw the property at any time before the sale or to refuse any bids. The property to be sold is described as general household items unless otherwise noted. Name: Elizabeth Hayden Nydia Gonzalez Cassandra A Milanovich Karmell Hatch RAECHELE L DORAN Ezra Wells Sandra Douglas Mahmoud Dahab Elly Smith Purchased goods are sold as is and must be removed within 48 hours from time and date of purchase. Payment is to be with cash only and made at the time of purchase. This sale is subject to cancellation without notice in the event of settlement between owner and obligated party. SPS Palm Desert at 39505 Berkey Dr. Palm Desert CA, 92211, (760)3451250"
    ],
    "notice-13": [
        "NOTICE OF LIEN SALE StorQuest Rancho Cucamonga/Hampshire Notice is hereby given, StorQuest Self Storage 9419 Hampshire Street, Rancho Cucamonga, CA 91730 will sell at public sale by competitive bidding the personal property of Amy Joanne Cabral, Edward Kline, Mecca Marie Kemp Beard, Jalil Marquis Edwards, Ernie Anthony Tobar, Phillip Phelps. Property to be sold: Misc. household goods, furniture, tools, clothes, boxes, & personal contents. Auctioneer Company: www.storagetreasures.com The Sale will conclude at 3 PM on February 15th, 2024. Goods must be paid in CASH and removed at time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. Inland Valley Daily Bulletin SB Published: 1/31, 2/7/24"
    ],
    "notice-14": [
        "Pursuant to Ca. Self Storage Facility Act ( BP code 21770 Et. Sec ) Mt. View Self Storage will sell the contents of the following units F13-14of Sierra Robinson ,E19 of Melissa Jaurequi,E 19 of John Larson The auction will be held on Bid 13 February 12 2024 Mt View Self storage 6101 Truck Village Dr. Mt Shasta Ca. Ph. 530-926-2701"
    ],
    "notice-15": [
        "NOTICE OF LIEN SALE Notice is hereby given, StorQuest Self Storage- 11998 Arrow Route, Rancho Cucamonga, CA 91739, Ph: 909-980-1303, Email: cucamonga02@storquest.com will sell at public sale by competitive bidding the personal property of :Yuhua Li, Karen Kimbell-Hanson, Leah Corona, Charles Strohm, Joe E Verdugo, Tishira Thomas. Property to be sold: Misc. household goods, furniture, tools, clothes, boxes, & personal contents. Auctioneer Company: www.storagetreasures.com. The Sale will conclude at 11:00 AM On February 15, 2024. Goods must be paid in CASH and removed at the time of sale. Sale is subject to cancellation in the event of the settlement between owner and obligated party."
    ],
    "notice-16": [
        "NOTICE OF PUBLIC LIEN SALE Pursuant to California Self Service Storage Facility Act (B&P Code 21700 ET seq.) the undersigned, AA U-Stor-M Pomona, will sell by competitive bidding in an online auction at www.storagetreasures.com the personal property of Katherine Ramirez, Lem Darden, Marlene Elias, Richard Lane, Samantha Bradley, Barbara Joubert, Michelle Houghton, Sam Abdalla, and Magdalena Sanchez to be sold: boxes, bin, misc items. Sale will end at 10:00am January 31, 2024. Goods must be paid in cash and removed at completion of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. AA U-Stor-M 333 N Hershey St Pomona, CA 91767 (909)865-8787"
    ],
    "notice-17": [],
    "notice-18": [
        "NOTICE OF LIEN SALE Notice is hereby given pursuant to California Business and Professional Codes #21700-21716, Section 2328 of the UCC of the Penal Code, Section 535 the undersigned, Storquest Self Storage of Stockton, will sell at public sale by competitive bidding the personal property of: Name:Dominic Vallejo, Priscilla Guerrero, Bert Geer, Analilia Carrillo Property to be sold: Household goods,Furniture, Boxes, Trunks, Suitcases, Toys, Sporting Goods, Tools. February 15, 2024. Goods must be paid in CASH at the site and remove at the completion of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. StorQuest Acampo, 19666 CA-99, Acampo, CA 95220, 209-270-6479 Publication Dates L00000000"
    ],
    "notice-19": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTION Notice is hereby given that personal property in the following units will be sold at Public Auction, on the 14th day of February, 2024 at or 8:30 a.m. pursuant to the California SelfStorage Facility Act. The sale will be conducted at: UHaul Moving &Storage Of South Central 11020 S. Vermont Ave. Los Angeles, California 90044. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following persons Glenda Fieldsbrewer 06365 Florine Morgan 130 Rickey Alford 1108 Derick Stevenson 222 Kyser Hall 240 Derrick Criswell 104 John Atkins 127 Carolyn Holman 105 La Shell JohnsonLupoe 244 Albert Peterson 085 Victor Yoakum 168 Jasmine Carter 1091 Long Beach PressTelegram Published: 1/31, 2/7/24"
    ],
    "notice-20": [],
    "notice-21": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTION Notice is hereby given that personal property in the following units will be sold at Public Auction, on the 15th day of February, 2024 at or 8:30 a.m. pursuant to the California SelfStorage Facility Act. The sale will be conducted at: UHaul Moving & Storage of Central Alameda 890 E 59th St Los Angeles, California 90001. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following persons: Elizabeth Fennel AB5218B Katerin Lopez AA2647D Trenses Love AA2666N Myresha Barber AA1634D Logan Mueller AA3328A Danielle Scott AA3467P Michelle Walker AA4373H James Scott AA8927C Elizabeth Fennel AB3904D Kaylah Baker AA3074A Elizabeth Fennel AB7101B Astin Miles AA8477H Melanie Young AA3753F Elizabeth Fennel AB3476C William Pitts AA2031A Long Beach PressTelegram Published: 1/31, 2/7/24"
    ],
    "notice-22": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTION Notice is hereby given that personal property in the following units will be sold at Public Auction, on the 14th day of February, 2024 at or after 8:30 a.m., Pursuant to the California SelfStorage Facility Act. The sale will be conducted at: UHaul Moving & Storage Of Lynwood, 11716 Long Beach Blvd. Lynwood, California 90262. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following persons Destiny Hammonds 0324 Shonyae King 0605 Trinidad Carranza 994 Sierra Baek 0240 Efrain Cuadraz 0157 Denetra Marshall 0009 Rebecca Ayala 0316 Stefanie Jackson 1566 Monesha Lowe 1539 Joshua Keys 0003 Amanda De La Cruz 1519 Long Beach PressTelegram Published: 1/31, 2/7/24"
    ],
    "notice-23": [
        "Notice of Public SaleNotice is hereby given that Security Public Storage – City of Industry will sell the contents of the storage units listed below at a public auction to satisfy a lien placed on the contents (pursuant to Division 8 Chapter 10 Sec 21700-21716 of the California Codes). The sale will take place at the website www.StorageTreasures.com on 02/14/2024 at 12:00 PM . The sale will be conducted under the direction of Christopher Rosa (Bond-3112562) and www.StorageTreasures.com on behalf of the facility’s management. Units will be available for viewing prior to the sale on www.StorageTreasures.com. Contents will be sold for cash only to the highest bidder. A 10-15% buyer’s premium will be charged and possibly a cleaning deposit per unit. All sales are final. Seller reserves the right to withdraw the property at any time before the sale or to refuse any bids. The property to be sold is described as “general household items” unless otherwise noted.Javier ZamoraRamses ChavezJose PadillaEsmaralda Y Fuentes-PerezAlphonso Louis DuranPurchased goods are sold as is and must be removed within 48 hours from time and date of purchase. Payment is to be with cash only and made at the time of purchase. This sale is subject to cancellation without notice in the event of settlement between owner and obligated party.Security Public Storage – City of Industry15870 Amar Rd. City of Industry, CA 91744(626) 968-3519Publication date: 01/31/2024San Gabriel Valley TribunePublished: 1/31/24"
    ],
    "notice-24": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTIONNotice is hereby given that personal property in the following units will be sold at Public Auction, on the 14th day of February, 2024 at or after 8:30 a.m., Pursuant to the California Self-Storage Facility Act. The sale will be conducted at: U-Haul Moving & Storage Of Lynwood, 11716 Long Beach Blvd. Lynwood, California 90262. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following personsDestiny Hammonds0324Shonyae King0605Trinidad Carranza994Sierra Baek0240Efrain Cuadraz0157Denetra Marshall0009Rebecca Ayala0316Stefanie Jackson1566Monesha Lowe1539Joshua Keys0003Amanda De La Cruz1519Long Beach Press-TelegramPublished: 1/31, 2/7/24"
    ],
    "notice-25": [
        "Notice is hereby given pursuant to Sections 21700 Through 21716 of the Business & Professions Code, State of California, the undersigned will sell at public sale by competitive bidding on www.storagetreasures.com closing on February 9, 2024 at 10:59 AM, at Crown Storage – 5637 Airport Rd, Redding Ca 96002 County of Shasta, State of California. The following are: Bruce Long (2 units), Mirsad Durakovic All purchased items sold as is, where is and must be removed Within 72 hours. Sale subject to cancellation in the event of settlement between owner and obligated party. California Bond #63747122 01/31/2024 # 9790510"
    ],
    "notice-26": [],
    "notice-27": [
        "Notice of Public AUCTION as defined by the California Self Storage Facilities Act, Business and Professions Code sections 21700 - 21716. Located at: Interstate Storage Livermore, 1800 Sutter St, Livermore, CA 94551. Date of sale: the undersigned will sell at public auction on Thursday, February 15th, 2024, at 10:30 AM, personal and/or business property including but not limited to furniture, sporting equipment, clothing, tools and other household/bus-iness items. Property being sold: Eric Allen Nelson 1 Air Compressor, 1 Shelf, 1 Suitcase, 1 Headboard, 1 Recliner chair, 1 set of chairs, 1 table frame,. Jaime Garcia Zaragoza Clothing, Mattress, 1 Bag, Vase Geroge Pitarra 1 Arm Chair, 1 DVD, Miscellaneous Chairs, 60 + Boxes, 5 + Bags, Step Ladder, Brief case, Lamp, Picture Frame, Large Wooden Armoire Anthony Lee Kerr End Table, Collectibles, DVD, Storage Cabinets, 20 + Boxes, 10 + Bags, Hauling Straps Auction conducted by: Nor Cal Storage Auctions Inc; Phone: (916) 604-9695; CA Bond #7900390179 Terms: CASH ONLY. Interstate Storage reserves the right to refuse any bid or cancel auction. PT/VT 6806758; Feb. 1, 8, 2024"
    ],
    "notice-28": [
        "Notice of Public Sale Notice is hereby given that Security Public Storage City of Industry will sell the contents of the storage units listed below at a public auction to satisfy a lien placed on the contents (pursuant to Division 8 Chapter 10 Sec 2170021716 of the California Codes). The sale will take place at the website www.StorageTreasures.com on 02/14/2024 at 12:00 PM . The sale will be conducted under the direction of Christopher Rosa (Bond3112562) and www.StorageTreasures.com on behalf of the facility's management. Units will be available for viewing prior to the sale on www.StorageTreasures.com. Contents will be sold for cash only to the highest bidder. A 1015% buyer's premium will be charged and possibly a cleaning deposit per unit. All sales are final. Seller reserves the right to withdraw the property at any time before the sale or to refuse any bids. The property to be sold is described as general household items unless otherwise noted. Javier Zamora Ramses Chavez Jose Padilla Esmaralda Y FuentesPerez Alphonso Louis Duran Purchased goods are sold as is and must be removed within 48 hours from time and date of purchase. Payment is to be with cash only and made at the time of purchase. This sale is subject to cancellation without notice in the event of settlement between owner and obligated party. Security Public Storage City of Industry 15870 Amar Rd. City of Industry, CA 91744 (626) 9683519 Publication date: 01/31/2024 San Gabriel Valley Tribune Published: 1/31/24"
    ],
    "notice-29": [
        "LEGAL NOTICE FICTITIOUS BUSINESS NAME STATEMENT File No. 2024000030 The following person(s) is (are) doing business as: South Main Mini Storage 530-527-7890 12149 Highway 99W Red Bluff CA 96080 Ferguson & Brewer Investment Company 7052 Skyway, PO Box 69 Paradise CA 95967 The registrant commenced to transact business under the fictitious business name or names listed above on 7-22 This business is conducted by: a corporation S/By: Peter Leonard, President This statement was filed with the County Clerk of Tehama County on 1/22/2024 JENNIFER A. VISE Tehama County Clerk & Recorder Publish: 2-1,8,15,22/2024"
    ],
    "notice-30": [
        "Storage Lien Sale There will be a lien sale at Peabody Self Storage, 201 Peabody Road, Vacaville, CA 95687 On: Monday, February 12, 2024, at 10:30am. This enforcement is authorized by Division 8, commencing without warranty or guarantee for Cash only. Purchased items must be removed from property immediately following the sale. C317 Robert Matthews - (4) Commercial washers and dryers, Soap vending machine, (4) crates of washing machine parts, (4) boxes of misc. items, pallet jack, (2) ladders. D405 Robert Matthews (1) Utility dolly, (7) sets of commercial washers and dryers, soap vending machine, metal laundry cart. Bond # 0342850"
    ],
    "notice-31": [
        "NOTICE OF PUBLIC LIEN SALE Pursuant to California Self Service Storage Facility Act (B&P Code 21700 ET seq.) the undersigned, AA UStorM Pomona, will sell by competitive bidding in an online auction at www.storagetreasures.com the personal property of Katherine Ramirez, Lem Darden, Marlene Elias, Richard Lane, Samantha Bradley, Barbara Joubert ,Michelle Houghton, Sam Abdalla, and Magdalena Sanchez to be sold: boxes, bin, misc items. Sale will end at 10:00am January 31, 2024. Goods must be paid in cash and removed at completion of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. AA UStorM 333 N Hershey St Pomona, CA 91767 (909)8658787 Inland Valley Daily Bulletin Published: 1/31/24"
    ],
    "notice-32": [],
    "notice-33": [],
    "notice-34": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTION Notice is hereby given that personal property in the following units will be sold at public auction, on the 14th day of February, 2024 at or after 8:30am pursuant to the California SelfStorage Facility Act. The sale will be conducted at: UHaul Moving & Storage of Inglewood, 964 S. La Brea Ave. Inglewood California 90301. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following persons: Christian Frazier 0904 Triva Carter 2340 Tenay Travis 1342 Eugena Cooley 2095 Brandi Ridgle 1007 Long Beach PressTelegram Published: 1/31, 2/7/24"
    ],
    "notice-35": [],
    "notice-36": [
        "LEGAL NOTICE OF LIEN SALE NOTICE IS HEREBY GIVEN to Susan & Geremy Stever by Fort Bragg Mini Storage that household and misc. items placed in storage unit #K-12 under that name, will be sold at a public auction at 1260 N. Main St., Fort Bragg, CA 95437 on Fedruary 9, 2024 at 10:00 a.m. Bidders may contact Fort Bragg Mini Storage at 707-964-6321 1/25,2/1/24"
    ],
    "notice-37": [],
    "notice-38": [
        "Public Notice of Sale of Abandoned Property Notice is hereby given that the undersigned will sell at public auction, pursuant section 1968 and or 21700 of the civil and business and professional codes of the State of California, the following properties to wit, identified by tenant name and storage unit. Dolores Dresser Unit # 0101 Personal Household Goods Dolores Dresser Unit # 0123 Personal Household Goods Shantina Boeskool Unit # 0238 Personal Household Goods Dolores Dresser Unit # 0314 Personal Household Goods Create Center Unit # 0337 Personal Household Goods Dolores Dresser Unit # 0614 Personal Household Goods Alexis Jobe Unit # 01242 Personal Household Goods The sale will be by competitive sealed bids on the 12th of February 2024 @ 9 a.m. Auction will be held online at StorageTreasures.com 760-674-9922. The landlord reserves the right to bid at the sale. All goods are sold “as is” and must be removed at the time of purchase. This is a cash only sale. The sale is subject to prior settlement between landlord and tenant. A refundable cleaning deposit in the amount of one hundred ($100.00) dollars is required by all winning bidders. The deposit is returned after all goods are removed and the unit is left clean. Landlord reserves the right to reject all bids. Ceasar & Michelle Rodarte Managers Stor-n-Lock Published: 1/31, 2/7/2024"
    ],
    "notice-39": [],
    "notice-40": [
        "Notice of Self Storage Sale Please take notice Prime Storage - Palm Desert located at 75050 Merle Dr., Palm Desert CA 92211 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/21/2024 at 12:00PM. Shirley Tschoop; Bernice Ramirez; Debra Mumm; Daniel Bell (2 units). This sale may be withdrawn at any time without notice. Certain terms and conditions apply. 1/31/2024"
    ],
    "notice-41": [
        "NOTICE OF LIEN SALEStorQuest – Rancho Cucamonga/HampshireNotice is hereby given, StorQuest Self Storage – 9419 Hampshire Street, Rancho Cucamonga, CA 91730 will sell at public sale by competitive bidding the personal property of Amy Joanne Cabral, Edward Kline, Mecca Marie Kemp Beard, Jalil Marquis Edwards, Ernie Anthony Tobar, Phillip Phelps. Property to be sold: Misc. household goods, furniture, tools, clothes, boxes, & personal contents. Auctioneer Company: www.storagetreasures.com . The Sale will conclude at 3 PM on February 15th, 2024. Goods must be paid in CASH and removed at time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party."
    ],
    "notice-42": [
        "NOTICE OF PUBLIC SALE OF LIENED PROPERTY Notice is hereby given that a Lien Sale will be held at Mini U Storage, 1177 Camelback Street, Newport Beach, CA 92660, on 2/15/2024 at 10:30am to satisfy the lien on the property stored at the address above in the units listed. Tenants notated the inventories listed at the time of rental. Landlord makes no representation or warranty that the units contain said inventories. Englebert Vis, B2588, Misc Household Jessica Belair, A1105, Misc Household Brooke Radcliffe, B2709, Misc Household, Personal Effects Jeffery Pollock, B2551, Misc Household, Personal Effects All units must be paid for at the time of sale. Cash only will be accepted. No one under the age of 18 is allowed to attend the sale. Each person attending must sign in and agree to follow all Rules and Regulations of the sale. The landlord reserves the right to bid at the sale. All purchased goods are sold \"as is\" and must be removed within 48 hours following the sale. Shelving is property of landlord; do not remove unless authorized. Buyers must provide a current, original or a photocopy of their original resale permit at time of sale in lieu of sales tax. This sale is subject to cancellation in the event of settlement between landlord and obligated party. The Orange County Register Published: 1/24, 1/31/24"
    ],
    "notice-43": [
        "Notice of Self Storage Sale Please take notice Prime Storage - Perris located at 3010 N Perris Blvd., Perris, CA 92571 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/21/2024 at 12:00PM. Oscar Rios; Daniel Lopez; Andrew Rodriguez; Daniel Alatorre; Heather Grana; Hector Alonso Perez Luna; Melvin Moon; Juliann Campos/Active Movers; Steven E Aldrich; Kristi Ann Bales; Gilbert Calderon; Latee Burleson; David Michael Hernandez; Julio C Chiquini; Cristobal Isiordia; Tonia Mendez; Shree Johnson; Kathleen R Easley; Laszlo Gach; Esperanza Jacobo. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-44": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTIONNotice is hereby given that personal property in the following units will be sold at Public Auction on the 14th of February, 2024 at or after 8:30am Pursuant to the California Self-Storage Facility Act. The sale will be conducted at: U-Haul Moving & Storage of Baldwin Hills, 5051 Obama Blvd. Los Angeles, California 90016. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following personDimitry Ivanov2554Shanemah Williams2153Jeremiah Mandley2663Wilbur Bruce2047Juana Piritaramos1249Kenneth Howard2608Michael Black2395Quiana Brown2538Curtis Johnson1341Lev Smagin2149Ernesto Hernandez2702Michael Koontz1214Michelle Anglade2487Quiana Brown2534Dara Krausankas2114Anthony Gillett2122Joy Austin2421Rakeya Reynolds2818Joanna Gardner2630Long Beach Press-TelegramPublished: 1/31, 2/7/24"
    ],
    "notice-45": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTIONNotice is hereby given that personal property in the following units will be sold at Public Auction, on the 14th day of February, 2024 at or 8:30 a.m. pursuant to the California Self-Storage Facility Act. The sale will be conducted at: U-Haul Moving &Storage Of South Central 11020 S. Vermont Ave. Los Angeles, California 90044. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following personsGlenda Fieldsbrewer063-65Florine Morgan130Rickey Alford1108Derick Stevenson222Kyser Hall240Derrick Criswell104John Atkins127Carolyn Holman105La Shell Johnson-Lupoe244Albert Peterson085Victor Yoakum168Jasmine Carter1091Long Beach Press-TelegramPublished: 1/31, 2/7/24"
    ],
    "notice-46": [],
    "notice-47": [],
    "notice-48": [],
    "notice-49": [
        "PUBLIC SALENotice is hereby given that the following accounts are in default of their rental agreement at the Woodlake mini storage located at 1314 W. Bravo Woodlake, CA 93286.Ivette Esparza Unit # B-6 & 1-11Diana Moran Unit # D-20Janai Graham Unit # H-23Yvette Onitveroz Unit # J-32Teresa Olea Unit # M-12Chris Quintana Unit # M-13If payment is not made in full by 02/21/2024 your property consisting of miscellaneous items will be sold.Sun-Gaz 1/31, 2/07/24138-06"
    ],
    "notice-50": [],
    "notice-51": [],
    "notice-52": [
        "NOTICE OF LIEN SALENotice is hereby given pursuant to California Business and Professional Codes #21700-21716, Section 2328 of the UCC of the Penal Code, Section 535 the undersigned, StorQuest Self Storage, 1800 Dockery Ave., Selma, CA 93662. will sell at public sale by competitive bidding the personal property of Andrew Miles Edward Sandoval, Jose Manuel Trejo, Jonathan Arevalo, Mark Markarian, Reynaldo Anthony Sanchez JR, Nick Gonzalez, Angelica Helena Saarela, Cherokee Bethel, Jennifer Anderson, Elizabeth Gonzalez, Chris Sotelo, Victor Hernandez, Aaron Jacob Burrola,consisting of but not limited to household goods, furniture, appliances, clothing, tools, boxes & unknown contents. Auctioneer Companywww.storagetreasures.com. The Sale will end at 10:00 AM on February 15, 2024,. Goods must be paid in CASH at site and removed at completion of sale. Sale is subject to cancellation in the eventof settlement between the owner and obligated party.01/31/2024, 02/07/2024"
    ],
    "notice-53": [
        "NOTICE OF PUBLIC LIEN SALEPursuant to the California Self-Storage Facility Act, (B&P Code 21700et. Seq.) the undersigned will sell at public auction, on FEBRUARY 6, 2024 personal property located at:A-American Self Storage AT 3:00 PM 448 E. Paradise Ave. Visalia, CA 93277 by storagetreasures.com.STORED BY THE FOLLOWING PERSONS:Sara BenitesKarie LucasIsaiah LeyvaAlexandera HughesAida EspendolaVanessa TorresDolly PadillaRobert HensonMarcello GarciaMaria AragonLuis CerevantezRudy AcostaRacheal TorresMichelle HovsepianClaudia HernandezJuan DuarteBrenda JamesALL sales are subject to prior cancellation. Terms, rules and regulations available at sale. By A-American Storage Management Co, INC. (310) 914-4022Sun-Gaz 1/31/24120-05"
    ],
    "notice-54": [
        "NOTICE OF LIEN SALE EXTRA SELF STORAGE LIVE OAK will sell the contents of the following units to satisfy the lien: Name: Devin Aebersold Name: Sarah Dutra Name: Karl Wondra TO THE HIGHEST BIDDER ON: February 6, 2024 ENDING AT 3 PM SALE TO BE HELD ONLINE AT: www.StorageTreasures.com Purchases must be paid at the time with Cash only. Sale subject to cancellation. Company reserves the right to refuse any online bids. January 31, 2024 Ad #00297006"
    ],
    "notice-55": [
        "Public Notice: This is to notify the following persons that his/her personal household and/or miscellaneous goods will be sold at public auction or private sale. Stor It Self Storage & Business Center at 2491 Alluvial Ave, Clovis, CA 93611. The sale will take place online at www.storagetreasures.com; bidding will end February 14, 2024 at 5pm. B2040 Joseph Jurkiewicz; furniture, boxes, suitcases. A1605 Victor Munoz; drums. B2005 Alicia Stoecker; mattress, furniture, boxes, computer. D6262 Cheryl Chambers; boxes, shelves. D6002 Allegra Ramos; Boxes, equipment casing. B2006 Thomas Schoettler; Bags, clothing, lawn equipment. 01/31/2024, 02/07/2024"
    ],
    "notice-56": [],
    "notice-57": [
        "NOTICE OF SALE OF ABANDONED PROPERTYNotice Is Hereby Given That Pursuant To Sections 21700-21716 Of The Business And Professions Code, Section 2328 Of The UCC, Section 535 Of The Penal Code And Provisions Of The Civil Code, Frontage Self Storage, 528 Division St. , Nipomo, CA, 93444 Will Sell By Competitive Bidding The Following Units. Auction to Be Conducted through Online Auction Services of WWW.LOCKERFOX.COM, with bids opening on or after Thursday February 01, 2024 at 12:00 pm and closing on or after Thursday February 08, 2024 at 12:00 pmThe Personal Goods Stored Therein by the Following May Include, but are not limited to: MISC. HOUSEHOLD GOODS, PERSONAL ITEMS, FURNITURE, CLOTHING AND/OR BUSINESS ITEMS/FIXTURES.Purchases Must Be Made with DEBIT or CREDIT CARD, CERTIFIED CHECK or MONEY ORDER ONLY and Paid at the time of Sale. All Goods are Sold as is and must be Removed within 72 Hours of the time of Purchase. Frontage Self Storage , Reserves the Right to Retract Bids. Sale is Subject to Adjournment. Sale is subject to cancellation in the event of settlement bid at: www.lockerfox.com.Amanda SmithPub dates: Jan 24, 31, 2024Legal 296889"
    ],
    "notice-58": [
        "NOTICE OF LIEN SALE StorQuest - Santa Maria / Betteravia Notice is hereby given, StorQuest Self Storage - 1400 W. Betteravia Road, Santa Maria, CA 93455, will sell at public sale by competitive bidding the personal property of: Timothy Basset and Rosales Auto Inc.. Property to be sold: Furniture, Appliances, Totes, Boxes, Personal Items, Electronics, Auto Parts, Kitchen Items. Auctioneer company: www.storagetreasures.com. The Sale will conclude at 4:00 PM on 02/08/24. Goods must be paid for in CASH and removed at the time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. Publish on 01/24/24 and 01/31/24. Pub dates: Jan 24, 31, 2024 Legal 297019"
    ],
    "notice-59": [],
    "notice-60": [],
    "notice-61": [
        "Extra Space Storage will hold a public auction to sell personal property described below belonging to those individuals listed below at the location indicated:2225 Briar Creek Way, Lompoc, CA 93436. On January 23rd, 2024, at 11:00amSandra Grace Castillo - Personal Items, Household Goods, Boxes, DecorationsKelsey Warner-Lehne - Household GoodsHeidi Craig - Powertools, Furniture, Boxes, Lamps, Fans, Boxes, Household goodsChristina Delacruz - Tools, Electronics, Boxes, Suitcases, Christmas Decor, Jumper CablesErica Curiel - Furniture, Chest, Wagon, Fan, BoxesNatividad Angeles - Furniture, Shelving, Tools, Boxes, Bags, Personal ItemsMonique Herrera Chaidez - Furniture, Household Goods, Personal ItemsJason Segura - Furniture, Sporting Equipment, Clothing, Boxes, Bags, Shopping cartsReba Ortiz - Totes, Bed, Personal Items, BoxesShiela Stevens - Boxes, Books, Personal ItemsThe auction will be listed and advertised on www.storagetreasures.com . Purchases must be made with cash only and paid at the above referenced facility in order to complete the transaction. Extra Space Storage may refuse any bid and may rescind any purchase up until the winning bidder takes possession of the personal property.Pub dates: Jan 31, 2024Legal 294648"
    ],
    "notice-62": [
        "Lien Sale﻿Notice is hereby given that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to sections 21700-21716 of the Business & Professions Code, section 2328 of the UCC, Section 535 of the Penal Code and provisions of the Civil Code.The undersigned will sell at a public sale by competitive bidding on the 9th day of February at 1:00 pm, on the premises where said property has been stored and which is located at Green Box Rentals, Inc., 6988 Avenue 304, Visalia, County of Tulare, State of California, the following:Agee, David - Storage unit 18-1631Miscellaneous items.Purchases must be paid for at the time of purchase in cash only. All purchased items sold as is, where is and must be removed at the time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party.Dated January 10, 2024Todd Nottingham 559 733-5345Sun-Gaz 1/24, 1/31/24094-05"
    ],
    "notice-63": [
        "NOTICE OF PUBLIC SALE OF LIENED PROPERTYNotice is hereby given that a Lien Sale will be held at Mini U Storage, 1177 Camelback Street, Newport Beach, CA 92660, on 2/15/2024 at 10:30am to satisfy the lien on the property stored at the address above in the units listed. Tenants notated the inventories listed at the time of rental. Landlord makes no representation or warranty that the units contain said inventories.Englebert Vis, B2588, Misc HouseholdJessica Belair, A1105, Misc HouseholdBrooke Radcliffe, B2709, Misc Household, Personal EffectsJeffery Pollock, B2551, Misc Household, Personal EffectsAll units must be paid for at the time of sale. Cash only will be accepted. No one under the age of 18 is allowed to attend the sale. Each person attending must sign in and agree to follow all Rules and Regulations of the sale. The landlord reserves the right to bid at the sale. All purchased goods are sold \"as is\" and must be removed within 48 hours following the sale. Shelving is property of landlord; do not remove unless authorized. Buyers must provide a current, original or a photocopy of their original resale permit at time of sale in lieu of sales tax. This sale is subject to cancellation in the event of settlement between landlord and obligated party."
    ],
    "notice-64": [
        "Notice is hereby given that Bakman Water Company (BWC) has requested authority from the California Public Utilities Commission (CPUC) by Advice Letter (AL) 106-W to establish a surcharge for the Rolling Hills service area to repay a loan from the Drinking Water State Revolving Fund to cover the actual cost for the proposed project. The proposed project consists of the installation of customer water meters, water main replacements and realignment for a section of the distribution system, refurbishment of an existing well, and the addition of cathodic protection to the water storage tank. AL No. 106-W was filed in compliance with applicable rules of General Order 96-B. This filing will not interfere with the operation of BWC's other public utility operations. A copy of the AL is available for inspection at 5105 East Belmont Avenue, Fresno, California 93727. Anyone may respond to or protest this Advice Letter."
    ],
    "notice-65": [
        "NOTICE OF LIEN SALENotice is hereby given pursuant to California Business and Professional Codes #21700-21716, Section 2328 of the UCC of the Penal Code, Section 535 the undersigned, StorQuest Self Storage, 5365 N. Island Waterpark Dr., Fresno, CA, will sell at public sale by competitive bidding the personal property of Jazzshaneika Clark, Ronald Ellard, Phillip Garza, Jovan Williams, Michael Sinclair, Stephen Garza, Janice Palmer, consisting of but not limited to household goods, furniture, appliances, clothing, tools, boxes & unknown contents. Auctioneer Company www.storagetreasures.com. The Sale will end at 10:00 AM on February 15, 2024,. Goods must be paid in CASH at site and removed at completion of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party.01/31/2024, 02/07/2024"
    ],
    "notice-66": [
        "FICTITIOUS BUSINESS NAME STATEMENT FBN Number: 20231241 This statement was filed in the office of CATHY DARLING ALLEN, County Clerk of SHASTA County, on 11-21-2023 By: Michael Bridges, Deputy Fictitious Business Name(s) Tarmac American EZ Storage 2909 Tarmac Rd County of Shasta Mailing Address: Tarmaz E-Z Stor Registrant Address(es) Our Blessing LLC 2909 Tarmac Rd County of Shasta State: CA Began Transacting Business: NA Statement Expires On: 11-29-2028 Business Is Conducted By: Limited Liability Company NOTICE - IN ACCORDANCE WITH SUBDIVISION (a) OF SEC-TION 17920, A FICTITIOUS NAME STATEMENT GENERALLY EXPIRES AT THE END OF FIVE YEARS FROM THE DATE ON WHICH IT WAS FILED IN THE OFFICE OF THE COUNTY CLERK, EXCEPT, AS PROVIDED IN SUBDIVISION (b) OF SECTION 17920, WHERE IT EXPIRES 40 DAYS AFTER ANY CHANGE IN THE FACTS SET FORTH IN THE STATEMENT PURSUANT TO SECTION 17913 OTHER THAN A CHANGE IN THE RESIDENCE ADDRESS OF A REGISTERED OWNER. A NEW FICTITIOUS BUSINESS NAME STATEMENT MUST BE FILED BEFORE THE EXPIRATION. THE FILING OF THIS STATEMENT DOES NOT OF ITSELF AUTHORIZE THE USE IN THIS STATE OF A FICTITIOUS BUSINESS NAME IN VIOLATION OF THE RIGHTS OF ANOTHER UNDER FEDERAL, STATE, OR COMMON LAW (SEE SECTION 14411 ET SEQ., BUSINESS AND PROFESSIONS CODE). Our Blessing LLC /s/ Korey Williams (CEO) Print Name: Korey Williams January 23, 30, February 6, 13, 2024 #9758973"
    ],
    "notice-67": [],
    "notice-68": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Stanton located 10881 Dale Ave, Stanton, CA 90680 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Cynthia Vanessa Lorona; Hyiandari Aurora Reyes Dieguez; Joe Xuan Tran; Roberta Kay Long; Ronald Edward Dietl II; Sergio Antonio Vasquez; TeodoraOfelia Miclescu; Teresa de Jesus Penaloza Rioquinto; Tony Tuan Duong. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-69": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Chino Hills located at 15443 Fairfield Ranch Rd., Chino Hills, CA 91709 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Lamor Adrian; Hornaday Cynthia; Edwin Flamingo; Tapia Mario; Lora Bernadette McKinney; Joseph Dominic Giansante; Amanda B Listoe; Brenda Nunley. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Inland Valley Daily BulletinPublished: 1/30/24"
    ],
    "notice-70": [
        "Notice of Self Storage Sale Please take notice South Coast Self Storage located at 3480 W. Warner Ave. Santa Ana, CA 92704 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Fausto J Ambriz; Keith Thomas; Aaron Hart Brower; Pauline M Huber; Robin Kay Brunette; Jaime Gandarilla Maldonado. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-71": [
        "Notice of Self Storage Sale Please take notice AA New Storage located at 1741 Whittier Avenue Costa Mesa, CA 92627 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Curtis Jay Van Aken (2 units); Robyn Leigh Hadem; Steven Arianto (2 units). This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-72": [],
    "notice-73": [
        "NOTICE IS HEREBY GIVEN, StorQuest Self Storage 83614 Dr. Carreon Blvd. Indio, CA 92201 will sell at public sale by competitive bidding the personal property of: Christina Ann Gonzales, Michael Carrington Young, Rachel Stevens, Joe Elizondo, Florentina Ramirez, Mary Delfin, Lorena Rodriguez, Jose Castillejo, Heriberto Cruz, Francisco A Gonzalez. Property to be sold: Misc. household goods, furniture, tools, clothes, boxes & personal contents. Auctioneer Company: www.storagetreasures.com. The Sale will conclude at 12:00 PM on February 14, 2024. Goods must be paid in CASH and removed at the time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. AD DATES: 1/30, 2/6, 2024 TPR24-1060 ___________________________________________"
    ],
    "notice-74": [
        "Notice of Self Storage Sale Please take notice AllSpace Self Storage Costa Mesa located at 1535 Newport Blvd Costa Mesa CA 92627 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Greg Kendrick; Addie Faye Martucci Penner; Joseph A Mascetti; Donovan David Cosby; Smirz E Ken. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-75": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Torrance - Carson St. located at 735 W. Carson St., Torrance, CA 90502 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Anthony Verne Velando Asilun; Arturo Rivera Lagunes; David Allan Becker; Ernesto Carlos Lozano; Herbert Carnell Winston (2 units); Irvin Rendon (2 units); Jesse Quintero; Joan Mayo Medina; Juventino Garrido; Kecia Noel Brown/KD BY KB; Krystle Alexis Barber; Norma Alicia Velazquez Serratos; Pierre Wasolua Nsilu; Shaun Deray Johnson; Tondia Latrice Joseph; Toni Lea McLaughlin; Wendi Rashon Rodney; Ying Bin Ou. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-76": [
        "Lien Sale Notice is hereby given pursuant to Sections 21700 - 21716 of the Business & Professions Code, State of California, the undersigned will sell at public sale by competitive bidding on www.storagetreasures.com closes on February 9, 2024 at 10:59 AM , at Big Oak Center Storage, 13300 E Hwy 20 Clearlake Oaks, California, 95423 County of Lake, State of California. The following are: Mercedes Hunter Anthony Beneveto Justin Lindsey Shavone Bartlette Jaclyn Pruitt All purchased items sold as is, where is and must be removed Within 72 hours. Sale subject to cancellation in the event of settlement between owner and obligated party. 1/31/24"
    ],
    "notice-77": [
        "Notice of Self Storage SalePlease take notice The Storage Company located at 23529 Figueroa Street Carson, CA 90745 intends to hold an auction to sell the goods stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Karen Anne Avilla; David Eastburn Jennings; Michael Sr Ortega. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily BreezePublished: 1/30/24"
    ],
    "notice-78": [
        "NOTICE OF SALE ABANDONED PERSONAL PROPERTYNotice is hereby given that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to the California Self Storage Act. Items will be sold at www.storagetreasures.com by competitive bidding ending on February 13, 2024, at 12pm. Property has been stored and is located at A-1 Self Storage, 10811 Vanowen ST. North Hollywood CA, 91605. Sale subject to cancellation up to the time of sale; company reserves the right to refuse any online bids.Michelle EstradaJoJo CrownShiro GutzieSimon DjeredjianAuction by StorageTreasures.com800-213-4183Los Angeles Daily NewsPublished: 1/30/24"
    ],
    "notice-79": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Harbor City Frampton located at 24490 Frampton Ave. Harbor City, CA 90710 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Anthony Joseph Hunter; Herman Michael II Few; Gregorio Geramiah Gomez; Elsner Gabriel de la Roca. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily BreezePublished: 1/30/24"
    ],
    "notice-80": [
        "Notice of Self Storage SalePlease take notice US Storage Centers – Corona located at 22237 Knabe Road Corona, CA 92883 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Karyn Emily Ceja; Julio Villalobos; Lisa Vasa Misipeka; Thailani Aisa Inojales; Christopher Richard Davis; Stephen Ross Green; Wesley McDowell; John Michael Morrison Taylor; Maria E Duran. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-81": [
        "Notice Is Hereby Given That Pursuant To Sections 21700-21716 Of The Business And Professions Code, Section 2328 Of The UCC, Section 535 Of The Penal Code And Provisions Of The Civil Code, RightSpace Storage - Menifee, 27090 Newport Rd., Menifee, CA, 92584 Will Sell By Competitive Bidding The Following Units. Auction to Be Conducted through Online Auction Services of WWW.LOCKERFOX.COM, with bids opening on or after Tuesday February 06, 2024 at 10:00 am and closing on or after Tuesday February 13, 2024 at 10:00 am Purchases Must Be Made with DEBIT or CREDIT CARD, CERTIFIED CHECK or MONEY ORDER ONLY and Paid at the time of Sale. All Goods are Sold as is and must be Removed within 72 Hours of the time of Purchase. RightSpace Storage - Menifee, Reserves the Right to Retract Bids. Sale is Subject to Adjournment. Sale is subject to cancellation in the event of settlement bid at: www.lockerfox.com. GEORGE MISCEVICH BRIAN JUE Katrina Maras Aaron Marshall TONY JAMES Published on January 30, 2024 TPR24-1046 The Public Record ___________________________________________"
    ],
    "notice-82": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - El Segundo located at 1 Chapman Way El Segundo CA 90245 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Late Bankou-Adagba. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-83": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Redondo Beach located at 1415 Hawthorne Blvd Redondo Beach, CA 90278 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Fernando Avendano; Leo Joseph Flowers (2 units); Sage Thomas Brennan; Shawn Wess Shepherd Jr. (2 units). This sale may be withdrawn at any time without notice. Certain terms and conditions apply.Daily BreezePublished: 1/30/24"
    ],
    "notice-84": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage San Jose Teresa located at 6880 Santa Teresa Blvd, San Jose, CA 95119 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 3:00PM. Victor Guerra; Gabriel Domingues; Bianeth C Amaya Delgado; Michael Brotherton; Robert J Agpalasin. All This sale may be withdrawn at any time without notice. Certain terms and conditions apply.MN# 0006805197 Jan 30 and Feb 6, 2024"
    ],
    "notice-85": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage - Torrance located at 722 W 220th St., Torrance, CA 90502 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 2:00PM. Sparkle Clark; Lorie Scott; Phoebe Romero; Michael Mayo (3 units); Marie Garcia; John Perry; Danna Goyer; Ricardo Gilliard Vidaud; Marian Anhwere; Sergio Hernandez.  This sale may be withdrawn at any time without notice. Certain terms and conditions apply.Daily BreezePublished: 1/30, 2/6/24"
    ],
    "notice-86": [],
    "notice-87": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Laguna Hills located at 23370 Moulton Pkwy Laguna Hills, CA 92653 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Tracy Arnett McLellan. All property is being store at the above selfstorage facility. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-88": [
        "NOTICE OF LIEN SALE NOTICE OF SALE OF PERSONAL PROPERTY EXTRA SELF STORAGE OROVILLE SOUTH Pursuant to the California self-storage facility act: (B&P code 21707 et.sec.) The undersigned will sell contents of: Name: Darla Carias Name: Tevin Hines Name: Steven Kirin Name: Wanda Layne Name: Jackie Paddock TO THE HIGHEST BIDDER ON: February 6, 2024 ENDING AT 3:00 PM SALE TO BE HELD ONLINE AT: www.StorageTreasures.com Purchases must be paid at the time with Cash only. Sale subject to cancellation. Company reserves the right to refuse any online bids. 01/31/2024"
    ],
    "notice-89": [
        "Notice is hereby given, StorQuest Self Storage 79315 Highway 111, La Quinta, CA, 92253 will sell at public sale by competitive bidding the personal property of: Damian Rodol Patino, Kurt Gary Gardner, Alfonso Cajica, Mitchel Cyril Gibellno, Jose Nevarez, Stephanie McNish, Ernest Dugenia, Tiny Shells. : Misc. Household goods, furniture, tools, clothes, boxes, & personal contents. Auctioneer Company: www.storagetreasures.com. The Sale will conclude at 12:00 PM on Feb 14th, 2024. Goods must be paid in CASH and removed at time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. Publication Dates: 01/30, 02/06, 2024 TPR24-1043 ___________________________________________"
    ],
    "notice-90": [
        "Notice of Self Storage SalePlease take notice Corona Self Storage at Dos Lagos located at 21702 Temescal Canyon Rd. Corona, CA 92883 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Rashelle Denise Dickerson; Brandon Scott Legaspi; Courtney Leighann Spencer; Carlos Rodriguez; Anthony Peter Colapinto; Maricela B Acosta; Eugene Christian Schultz (2 units); Donald Dwayne Young; Yamina Esqueda; Ross Alan Anthony; Yvonne Eileen Gomez. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-91": [],
    "notice-92": [
        "Notice is hereby given, StorQuest Self Storage 47350 Dune Palms Road, La Quinta, Ca 92253 will sell at public sale by competitive bidding the personal property of: Ehab Abufarie, MEC & Associates LLC Carter, Martha Carter, I MEC & Associates, Sue Cheryl Lantz, Rick Lantz, MEC & Associates LLC Carter, Martha Carter, I MEC & Associates. Property to be sold: Misc. household goods, furniture, tools, clothes, boxes, and personal content. Auctioneer Company: www.storagetreasures.com. The sale will conclude at 12:00 PM on February 14, 2024. Goods must be paid in CASH and removed at the time of sale. Sale is subject to cancellation in the event of settlement between the owner and the obligated party. AD RUN DATES: 1/30, 2/6, 2024 TPR24-1058"
    ],
    "notice-93": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Gardena located at 620 W. 184 St. Gardena, CA 90248 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Kimberly Betancourt; Rosa Elizat Andrade-Andrade; Aaron Lamont Carter; Tom Neddersen; Corvetta Monique Morris; Thomas Ronald Neddersen; Candice Michelle Arnwine. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-94": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Harbor City 253 located at 1239 W. 253rd St Harbor City, CA 90710 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Peggie Ann Elliott; Janai Anais Buck; Paul Hamilton; Darrell Carl Jr Hampton. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily BreezePublished: 1/30/24"
    ],
    "notice-95": [
        "Notice of Self Storage Sale Please take notice IN Self Storage - Fair Oaks located at 4753 Hazel Ave., Fair Oaks, CA 95628 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/16/2024 at 10:00AM. Bill Martin/Hall Market Media. All property is being stored at the above self-storage facility. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-96": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage - Van Nuys located at 7523 Woodman Pl Van Nuys CA 91405 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 3:00PM. Oscar Ramos; Anthony Bryan Negreary; Jesus Santillan Medel; Rachel McVay; Steven Palmer; Miguel Sandoval; Manuel Hinojosa (2 units). This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-97": [
        "Notice of Self Storage SalePlease take notice Budget Self Storage - Palmdale located at 41843 N. 10th St W Palmdale, CA 93551 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Debra Kay Hurlburt; Christopher Nathan Mattox; Carlos Ruben Martinez; Devontay Travon Madison; Juan Ramirez Villgrana; Juan Filiciano Esqueda. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-98": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Torrance - Crenshaw located at 23711 Crenshaw Blvd Torrance, CA 90505 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Sherrie Nicole Lockhart-Johnson; Tobenna M Onwunyi; Bernd Howard Buettgenbach/Bear Electric; Brianna Merit Reyes Garcia; Donald Orval Shaw; Bernd Howard Buettgenbach. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-99": [
        "NOTICE OF PUBLIC SALE Business & Professionals Code S21700 Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 11:00 AM on February 16, 2024 at Derrel's Mini Storage located at 990 N Mooney Blvd., Tulare, County of Tulare, State of California. Michael G Hodges Isaac Mendoza Tiara Lynn Brazell Brittany Mae Kinsey Frank Cazares Ortega Gary Ramsey Cheryl Ramsey Amy D Bernard Jason Haney Alberta Marie Williams Summerrose Denney 01/30,2/6/2024 # 9780446"
    ],
    "notice-100": [
        "Notice of Self Storage Sale Please take notice Small Town Storage Lancaster located at 42034 3rd Street E, Lancaster, CA 93535 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Timothy Mack Casillas; Constance Ann Kempel; Myisha Danata Stewart; Saraya Meon Ashley; Kimberly Ann Humphrey (3 units); Monique Marie Hood; Josephine Louise Parker. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-101": [],
    "notice-102": [
        "Notice of Self Storage Sale Please take notice SecureSpace Self Storage Rialto located at 2850 Foothill Blvd, Rialto, CA 92376 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 1:30PM. Robert Hagans; Rickquel Atkins. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Inland Valley Daily Bulletin Published: 1/30, 2/6/24"
    ],
    "notice-103": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Norwalk located at 11971 Foster Road Norwalk, CA 90650 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Alejandra Jimenez; Alejandra Yepez; Alfredo Ferrer Moreno; Claudia Yomara Cuavega; Eduardo Ernesto Navarro; Jazzmin Roxann Hernandez; Maria Lourdes Chico Corson; Marina Rachelle Ayala; Perla Griselda Hernandez Huerta; Ralph Anthony Anaya; Ricardo Garcia; Rodney Clay Goodrum; Sergio Andrew II Sanchez; Victor Farned Goeke. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Whittier Daily News Published: 1/30/24"
    ],
    "notice-104": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Redondo Beach located at 1415 Hawthorne Blvd Redondo Beach, CA 90278 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Fernando Avendano; Leo Joseph Flowers (2 units); Sage Thomas Brennan; Shawn Wess Shepherd Jr. (2 units). This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-105": [
        "Notice of Self Storage Sale Please take notice Budget Self Storage Lancaster located at 42722 N 10th Street W Lancaster, CA 93534 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Durlene Olevia Westfall; Lakisha Gordon; Michael Christopher Hensley; Cahulon Lee; Javier Hernandez; Ari Efani BedfordWilliams; Valerie Klemick; Abigail Harris; Eric Turner; Derrick Athanasius Jr Velasquez; Manuel Gerardo Cardenas; Lair Damon Nolan Jr. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-106": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Torrance Carson St. located at 735 W. Carson St., Torrance, CA 90502 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Anthony Verne Velando Asilun; Arturo Rivera Lagunes; David Allan Becker; Ernesto Carlos Lozano; Herbert Carnell Winston (2 units); Irvin Rendon (2 units); Jesse Quintero; Joan Mayo Medina; Juventino Garrido; Kecia Noel Brown/KD BY KB; Krystle Alexis Barber; Norma Alicia Velazquez Serratos; Pierre Wasolua Nsilu; Shaun Deray Johnson; Tondia Latrice Joseph; Toni Lea McLaughlin; Wendi Rashon Rodney; Ying Bin Ou. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-107": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Southbay located at 14680 Aviation Blvd Hawthorne, CA 90250 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Brittany Rogers; Caitlin Eliese Campbell; Fernando Gonzalez; James Brian Fraelich; John David Storer; Kendra Dajana McFirstley; Kina Lane Whitfield; Michelle Anaya; Richard Dale McKinzey; Tyrone Hunt (2 units). This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-108": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Corona Circle City Dr located at 1512 Circle City Dr Corona CA 92879 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Jacobo Hernandez; Carlos Alvarenga; Robert Stephen Smith. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The PressEnterprise Published: 1/30/24"
    ],
    "notice-109": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Carson Wilmington located at 21640 S Wilmington Ave., Carson CA, 90810 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Gracelyn Oliver; Lolita Ann Dates Turner; Quantaris Tylee Pettis; Miro Tahmeer Perry; Elijah Aaron Mack Cyiark; Delois Jean Trammell; Julie Marie Broxterman; Trinity Angelina Muth; Christopher Cree Simmons; Tre Christopher Roberts; Tanesha Nichelle Brown; Johnea Wade; Sandra Henry. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-110": [
        "NOTICE OF PUBLIC SALE: Self Storage Cube contents of the following customers containing household and other goods will be sold for cash by CubeSmart Management, LLC, 7723 Milliken Avenue, Rancho Cucamonga CA 91730 to satisfy a Lien on January 20, 2024 at approx. 10:00 a.m. at storagetreasures.com: Jon Cassingham Foster, Jon Cassingham Foster, Marie Parra, Thelma Pugh, Mary Lee Loney, Adam Holbrook, Mirna Aviles, Susan A Flores Huezo, Apryl Brown, Greg Lopez, Angelo L Espinosa, Ronairo Wilburn, Raymond Orozco, Jessie Mendoza Inland Valley Daily Bulletin SB Published: 1/30/24"
    ],
    "notice-111": [
        "Notice of Self Storage Sale Please take notice Corona Self Storage at Dos Lagos located at 21702 Temescal Canyon Rd. Corona, CA 92883 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Rashelle Denise Dickerson; Brandon Scott Legaspi; Courtney Leighann Spencer; Carlos Rodriguez; Anthony Peter Colapinto; Maricela B Acosta; Eugene Christian Schultz (2 units); Donald Dwayne Young; Yamina Esqueda; Ross Alan Anthony; Yvonne Eileen Gomez. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The PressEnterprise Published: 1/30/24"
    ],
    "notice-112": [
        "Notice of Self Storage Sale Please take notice AllSpace Self Storage Huntington Beach located at 8564 Hamilton Avenue Huntington Beach CA 92646 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. James Patrick Gallagher; Reece Staton; Steven Carr; Edward A Munroe; Michelle Louise Simpson. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-113": [
        "NOTICE OF PUBLIC SALE: Self - Storage Cube contents of the following customers containing household and other goods will be sold for cash by CubeSmart Management, LLC, 7723 Milliken Avenue, Rancho Cucamonga CA 91730 to satisfy a Lien on January 20, 2024 at approx. 10:00 a.m. at storagetreasures.com: Jon Cassingham Foster, Jon Cassingham Foster, Marie Parra, Thelma Pugh, Mary Lee Loney, Adam Holbrook, Mirna Aviles, Susan A Flores Huezo, Apryl Brown, Greg Lopez, Angelo L Espinosa, Ronairo Wilburn, Raymond Orozco, Jessie Mendoza Inland Valley Daily Bulletin - SB Published: 1/30/24"
    ],
    "notice-114": [
        "Notice of Self Storage Sale Please take notice AllSpace Self Storage Garden Grove located at 11382 Trask Avenue Garden Grove CA 92843 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Edward M Martinez; Alejandro Anaya. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-115": [
        "Notice of Self Storage SalePlease take notice Orangecrest Self Storage located at 18601 Van Buren Blvd Riverside, CA 92508 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Jonathan Chi Bilima; Kevin Antony Williams (2 units); Kevin Michael Million; Karla Patricia Patino; David Allen Rose Jr; Rose Lee Williams; Cynthia Jenkinssmith; Shane Travis Duncombe; Yvonne Patricia Thetford. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-116": [
        "Notice is hereby given, StorQuest Self Storage 2711 Tamarisk RD Palm Springs Ca 92262 will sell at public sale by competitive bidding the personal property of: David Mattheus, Colby Urban, Stephanie Perkins, Kimanecha Goree, Sekeena Skinner, Sarah Fultz, Jesse Mills, David Mattheus, Wells E. Wescott : Misc. household goods, furniture, tools, clothes, boxes, & personal contents. Auctioneer Company: www.storagetreasures.com. The Sale will conclude at 12:00 PM on Feb 14, 2024. Goods must be paid in CASH and removed at time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. 1/30, 2/6, 2024 TPR24-1056 ___________________________________________"
    ],
    "notice-117": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Inglewood located at 820 Industrial Ave. Inglewood, CA 90302 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Ashley Marie Thomas; Corey Deshaun Cofield (2 units); Curtis E Haynes; Damian Deshawn Mitchell; Dieudonne Ngnie; Ericka Martin; James Ryan Hoover; Jose Gabriel Rodriguez Gonzalez; Kelvin Lawrence Brown II; Latriece Jonae Harris; Pls Custom Framing Inc; Roosevelt White; Sultanyah Rachel Smith (2 units); Tracy Barnett Smith. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-118": [
        "NOTICE OF PUBLIC SALE Business & Professionals Code S21700 Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 10:00 AM on February 12th, 2024 at Derrel's Mini Storage located at 6176 W. Caldwell Ave Suite A, Visalia, County of Tulare, State of California. Bids to be placed on storagetreasures.com Kerry Dionne Blanca Castaneda Norman Becker Patrick Hernandez Destiny Keyes Robert Dias Tedra Holland Maria Gomez Michael Marshall 9765877 Jan 30, Feb 6, 2024"
    ],
    "notice-119": [],
    "notice-120": [
        "Notice of Self Storage SalePlease take notice US Storage Centers – Norwalk located at 11971 Foster Road Norwalk, CA 90650 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Alejandra Jimenez; Alejandra Yepez; Alfredo Ferrer Moreno; Claudia Yomara Cuavega; Eduardo Ernesto Navarro; Jazzmin Roxann Hernandez; Maria Lourdes Chico Corson; Marina Rachelle Ayala; Perla Griselda Hernandez Huerta; Ralph Anthony Anaya; Ricardo Garcia; Rodney Clay Goodrum; Sergio Andrew II Sanchez; Victor Farned Goeke. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-121": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Harbor City 257th located at 1239 257th Harbor City, CA 90710 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Elle Marie; Amrit Uttam Lal; Sandra Brass; Charlotte Huelanda Barnes; Cassandra Ruth Hammond; Rumalda Gonzalez Campos; Katrina Tiffany Bell; Jasmin Serrato Ceja; Nassim Sagawa; Steven Lee Gonzalez; Danielle Merissa Rosales; Debbie Ruth Hernandez; Carla Kay Crawford; Thomas Wayne Cooper; Daniel Christopher Ramos; Jennifer Raposas. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-122": [],
    "notice-123": [
        "NOTICE OF PUBLIC SALE Business & Professionals Code S21700 Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 09:00 AM on February 16, 2024 at Derrel's Mini Storage located at 1700 S. Blackstone St, Tulare, County of Tulare, State of California. Bids to be placed on storagetreasures.com Hondo K King Kimberly Osorio Alma A Ruvalcaba Paul Chagolla Chastity Urias Desteni Mendoza Sambrina Rodriguez 01/30,02/06/2024 # 9780371"
    ],
    "notice-124": [],
    "notice-125": [
        "NOTICE OF SALE ABANDONED PERSONAL PROPERTY Notice is hereby given that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to the California Self Storage Act. Items will be sold at www.storagetreasures.com by competitive bidding ending on February 13, 2024, at 12pm. Property has been stored and is located at A1 Self Storage, 10811 Vanowen ST. North Hollywood CA, 91605. Sale subject to cancellation up to the time of sale; company reserves the right to refuse any online bids. Michelle Estrada JoJo Crown Shiro Gutzie Simon Djeredjian Auction by StorageTreasures.com 8002134183 Los Angeles Daily News Published: 1/30/24"
    ],
    "notice-126": [
        "Notice of Self Storage Sale Please take notice US Storage Centers El Segundo located at 1 Chapman Way El Segundo CA 90245 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Late BankouAdagba. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Los Angeles Daily News Published: 1/30/24"
    ],
    "notice-127": [
        "Notice of Self Storage Sale Please take notice Orangecrest Self Storage located at 18601 Van Buren Blvd Riverside, CA 92508 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Jonathan Chi Bilima; Kevin Antony Williams (2 units); Kevin Michael Million; Karla Patricia Patino; David Allen Rose Jr; Rose Lee Williams; Cynthia Jenkinssmith; Shane Travis Duncombe; Yvonne Patricia Thetford. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-128": [
        "Notice of Self Storage Sale Please take notice Budget Self Storage Palmdale located at 41843 N. 10th St W Palmdale, CA 93551 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Debra Kay Hurlburt; Christopher Nathan Mattox; Carlos Ruben Martinez; Devontay Travon Madison; Juan Ramirez Villgrana; Juan Filiciano Esqueda. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-129": [
        "NOTICE OF SALE ABANDONED PERSONAL PROPERTY Notice is hereby given that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to the California Self Storage Act. Items will be sold at www.storagetreasures.com by competitive bidding ending on 2/13/2024 at 12:00 PM. Property has been stored and is located at A1 Self Storage, 5310 Vineland Avenue, North Hollywood, CA 91601. Sale subject to cancellation up to the time of sale, company reserves the right to refuse any online bids. Ronald Earl Pipes Ronald Earl Pipes Jennifer Ann Mielziner Regina Gomez Erik Hernandez Donny Jackson Reginald Lawery Asia Carter Christopher Bentley Carlos Lang Steven Hammock Auction by StorageTreasures.com 4803976503 Los Angeles Daily News Published: 1/30/24"
    ],
    "notice-130": [
        "Notice as hereby given that UHaul Company of South Orange County storage auction will take place online Wednesday, February 13, 2024, 12:00 pm at jmichaelsauctions.com at UHaul Moving and Storage of Murrieta 25086 Jefferson Ave Murrieta, CA 92562. Items sold are generally described as: clothing, furniture and/or household items belonging to the following: Candy Powers #1234,Tabatha Pendleton #1313, Jaheim Smith #1165, David Clouser #3014, Anthony Tabor #2200, Oscar Valencia #2382, Kyle Scott #2342, Daniel Mercer #AB5112E, AB3831E, AB9238B and AB4940E. The PressEnterprise Published: 1/30, 2/6/24"
    ],
    "notice-131": [],
    "notice-132": [],
    "notice-133": [
        "Notice of Self Storage Sale Please take notice SecureSpace Self Storage Van Nuys located at 7523 Woodman Pl Van Nuys CA 91405 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 3:00PM. Oscar Ramos; Anthony Bryan Negreary; Jesus Santillan Medel; Rachel McVay; Steven Palmer; Miguel Sandoval; Manuel Hinojosa (2 units). This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Los Angeles Daily News Published: 1/30, 2/6/24"
    ],
    "notice-134": [
        "NOTICE OF PUBLIC SALE Business & Professionals Code S21700 Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 10:00 AM on February 16, 2024 at Derrel's Mini Storage located at 800 Ben Maddox Way, Visalia, County of Tulare, State of California. Bids to be placed on storagetreasures.com Amy Louise Antill Jared Michael Lukehart Brain Wingart Jose Angel Zapien Jr Timoteo Pizana Rachel Nunez Agapito Garza Monica Alvarez 1/30,2/6/2024 # 9780779"
    ],
    "notice-135": [
        "NOTICE OF PUBLIC SALE Business & Professionals Code S21700 Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 09:00 AM on February 11, 2024 at Derrel's Mini Storage located at 345 E. Caldwell Ave, Visalia, County of Tulare, State of California. Bids to be placed on storagetreasures.com Thomas Stallings Trina Mercado Darnell Bennett Tamika Reyanne Haywood 9765767  Jan 30, Feb 6, 2024"
    ],
    "notice-136": [],
    "notice-137": [
        "Notice is hereby given that UHaul Company of South Orange County storage auction will take place online Tuesday, February 13, 2024, 12:00 pm at jmichaelsauctions.com at UHaul Moving and Storage of California Oaks 41451 Kalmia St Murrieta, CA 92562. Items sold are generally described as: clothing, furniture and/or household items belonging to the following: Jasmine K. Olsewski #3311, Jee Leepark #3423, Cameron Purifie #3807, Jeffrey Garcia #3814, Christian James Arceyut #3833, Yvonne Savage #3907. The PressEnterprise Published: 1/30, 2/6/24"
    ],
    "notice-138": [
        "Notice of Self Storage Sale Please take notice The Storage Company located at 23529 Figueroa Street Carson, CA 90745 intends to hold an auction to sell the goods stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Karen Anne Avilla; David Eastburn Jennings; Michael Sr Ortega. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-139": [
        "NOTICE OF LIEN SALE Extra Self Storage Red Bluff will sell the contents of the following units to satisfy the lien: Name: Randal Nixon Name: Jared Gipson Name: Clarence Stevens Name: Joshua Walsh TO THE HIGHEST BIDDER ON: February 6th 2024 Ending at 3:00 PM SALE TO BE HELD ONLINE AT: www.storagetreasures.com Purchases must be paid at the time with Cash only. Sale subject to cancellation. Company reserves the right to refuse any online bids."
    ],
    "notice-140": [
        "Notice is hereby given that U-Haul Company of South Orange County storage auction will take place online, Tuesday, February 13, 2024, 12:00 pm at jmichaelsauctions.com at U-Haul Moving and Storage Of Temecula 27941 Jefferson Ave, Temecula, CA 92590, Items sold are generally described as: clothing, furniture and/or household items belonging to the following: Valesca Irizarry #1106, Leland Anderson #1244, William Stilling #1208 and Shane Williams #1160 & 1024. The Press-EnterprisePublished: 1/30, 2/6/24"
    ],
    "notice-141": [
        "Notice is hereby given, StorQuest Self Storage 42625 Jackson St, Indio CA 92203 will sell at public sale by competitive bidding the personal property of: Hayde Nieto, Oscar Antonio Valenzuela, Lydia Ruiz, Amanda Del Toro, Luis Brandon Garcia, Luis David Hernendez, John Eldon Jr Kindt, Josephine Nava, Rodrigo Jr Pena Misc. household goods, furniture, tools, clothes, boxes, & personal contents. Auctioneer Company: www.storagetreasures.com. The Sale will conclude at 12:00 PM on FEBRUARY 14, 2024. Goods must be paid in CASH and removed at time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. TPR24-1045 01/30, 2/6, 2024 ___________________________________________"
    ],
    "notice-142": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage Los Angeles Firestone located at 2268 Firestone Blvd Los Angeles AC 90002 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 4:00PM. Yoba Bethel; Roselani Lozano; Manuel Beltran Perez; Aelea Hill; James Cartwright; Desiree McGhee; Alejandra Depaz; Cordell Clayborn; Jovon Ross; Shaneika Adrienne Hall; Lachelle Arnold; Susana Rodriguez; Marie Garcia; Andrea Hill; John Hackman; Jonnathon Quintero; Shaminicia Butler; Sergio Gonzalez; Megan Kelley; Johnny Evans; Lilia Carino Guzman; Yolanda Garcia Olivares; Jesus Hernandez Gomez. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-143": [
        "NOTICE OF LIEN SALE NOTICE OF SALE OF PERSONAL PROPERTY Extra Self-Storage Paradise Pursuant to the California self-storage facility act: (B&P code 21770 et.sec.) The undersigned will sell contents of: Name: Frank Horio Name: David Schick Name: Trevor Thatcher Name: Trevor Thatcher TO THE HIGHEST BIDDER ON: February 6, 2024 ENDING AT 3:00 PM SALE TO BE HELD ONLINE AT: www.StorageTreasures.com Purchases must be paid at the time with Cash only. Sale subject to cancellation. Company reserves the right to refuse any online bids. 01/31/2024"
    ],
    "notice-144": [
        "Pursuant to Chapter 10, commencing with Section 21700 of the Business Professionals Code, NOTICE IS HEREBY GIVEN that Lighthouse Storage will sell at public sale by competitive bidding on February 13, 2024 at 10:30 A.M. on the premises where the said property has been stored and which are located at Lighthouse Storage 14400 Beach Blvd. Westminster, 92683 , State Of California, County of Orange, the following: Emmanuel Jaramillo, Glenn Jones, Gengo Grip & Lighting LLC/Christopher Charles Rauch, Teresa MyHuong Vu, Bich Van Thi Nguyen. Vacuum Cleaner, Chest, Shoes, Bags, Tools, Boxes, Totes, Luggage, Ice Chests, Skateboard, mattress, box spring, garden tools, power tools, hand tools, pallet mover, crates, type writer, air compressor, paintings, clothes, dresser, television, Computer, monitor, speakers, holiday décor, drum set, lights, Etc. Must be paid in cash only. There is a $100 minimum cleaning deposit on all units. All purchased items are sold as is, where is and must be removed at time of sale. Sale subject to cancellation up to the time of the sale and company reserves right to refund any bid. American Auctioneers B/N #FS8632014. Phone number: 8008387653."
    ],
    "notice-145": [
        "Notice of Self Storage SalePlease take notice Budget Self Storage - Lancaster located at 42722 N 10th Street W Lancaster, CA 93534 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Durlene Olevia Westfall; Lakisha Gordon; Michael Christopher Hensley; Cahulon Lee; Javier Hernandez; Ari Efani Bedford-Williams; Valerie Klemick; Abigail Harris; Eric Turner; Derrick Athanasius Jr Velasquez; Manuel Gerardo Cardenas; Lair Damon Nolan Jr. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-146": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Orange located at 1460 N. Main St., Orange, CA 92867 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Azel Gustavo Gonzalez; Brenda Sanchez; Christopher David Allen; Christopher Lee Conry; David Harvey Everston; Edward Charles Fahrenholz; John Glenn Padilla (2 units); Kimberly Candelaria Marie Singh; Krysti Jo Branstetter; Krystle D K S S BelmontePhillips; Rodney Jr. Goldsberry; Ronald Jr. Bennett. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-147": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Costa Mesa located at 1600 Superior Avenue Costa Mesa, CA 92627 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Clark Anthony Wimer/The Honest Energy Company; Samantha Marcela Fonseca; Omar Villegas; Guadalupe Rojas Vazquez. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-148": [],
    "notice-149": [
        "Notice of Self Storage Sale Please take notice SecureSpace Self Storage Brea located at 2700 E Imperial Hwy Brea CA 92821 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 3:30PM. Amerdeep Sran; William Allen; David Salkin; Scott Ozeki; William Foster; Ben Ignacio; Vanessa Pitts; John Rowe; Enrique Antillon; Reuben Dwemoh; Kimberly Covarrubias. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30, 2/6/24"
    ],
    "notice-150": [
        "Notice of Self Storage Sale  Please take notice SecureSpace Self Storage Rancho Penasquitos located at 10389 Azuaga St San Diego CA 92129 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Isaac Salinas. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-151": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Upland 1808 W Foothill Blvd Upland CA 91786 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Elizabeth Burgoyne (2 units); Erica Lina Renderos; Frank Jr Hernandez; James Michael Gotz; Marcella Orioli. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-152": [],
    "notice-153": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Chino located at 13555 Ramona Ave Chino CA 91710 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Christina Camacho (2 units); Kandyce Jelks; Paula Martinez; Sandon Larson; Edwin Hernandez; Shantel Star Essex; Steven Alexander Pu Ramos. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Inland Valley Daily Bulletin Published: 1/30/24"
    ],
    "notice-154": [
        "Notice of Self Storage Sale Please take notice Covina Self Storage located at 1101 North Azusa Ave. Suite C Covina, CA 91722 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Adolfo Jr Garcia; Mariah Nicole Oliva; Cecilia Amorette Kathleen Vega; Joseph Efrain Alarcon; Alexander Julian Gradias; Veronica Nidia Vasques; Javier Armando Olvera; Guadalupe Espinoza; Gonzalo Adrian Padilla; Tatyanna Tonnai Moore. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-155": [],
    "notice-156": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Upland 1808 W Foothill Blvd Upland CA 91786 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Elizabeth Burgoyne (2 units); Erica Lina Renderos; Frank Jr Hernandez; James Michael Gotz; Marcella Orioli. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Inland Valley Daily Bulletin Published: 1/30/24"
    ],
    "notice-157": [
        "Notice of Public Sale Notice is hereby given that Security Public Storage at 2975 Pinole Valley Rd Pinole, Ca. 94564 will sell the contents of the storage units listed below at a public auction to satisfy a lien placed on the contents (pursuant to Division 8 Chapter 10 Sec 21700-21716 of the California Codes). The sale will take place at the website www.StorageTreasures.com on February 14, 2024 at 12 pm. The sale will be conducted under the direction of Christopher Rosa (Bond-3112562) and www.StorageTreasures.com on behalf of the facility's management. Units will be available for viewing prior to the sale on www.StorageTreasures.com. Contents will be sold for cash only to the highest bidder. A 10-15% buyer's premium will be charged and possibly a cleaning deposit per unit. All sales are final. Seller reserves the right to withdraw the property at any time before the sale or to refuse any bids. The property to be sold is described as \"general household items\" unless otherwise noted. Tenant Name Angelica E. Maravilla Danielle Sumler Jared Alan Oller Felicia Allen Jane L. Vanzutphen Kairo Ortega Purchased goods are sold as is and must be removed within 48 hours from time and date of purchase. Payment is to be with cash only and made at the time of purchase. This sale is subject to cancellation without notice in the event of settlement between owner and obligated party. Security Public Storage 2975 Pinole Valley Rd Pinole, Ca. 94564 510-758-1400 WCT 6805042 January 31, 2024"
    ],
    "notice-158": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Irwindale located at 13201 Ramona Blvd Irwindale, CA 91706 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Fredia Jean Beggs; Julieta del Rosario Ramirez; Marie Asuncion Fabricante Fontelera; Quang van Ha. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. San Gabriel Valley Tribune Published: 1/30/24"
    ],
    "notice-159": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Torrance Crenshaw located at 23711 Crenshaw Blvd Torrance, CA 90505 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Sherrie Nicole LockhartJohnson; Tobenna M Onwunyi; Bernd Howard Buettgenbach/Bear Electric; Brianna Merit Reyes Garcia; Donald Orval Shaw; Bernd Howard Buettgenbach. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-160": [
        "Notice of Self Storage Sale Please take notice Tyler Mall Mini Storage located at 10090 Indiana Ave., Riverside, CA 92503 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Eugene Christian Schultz; Coralynn Larocco; Connieann Cervantes Toyer; Sofia Perez; Chandra Renee McKinley; Abrehanah Salamniahi; Eliza Lauren Wright; Adrian Vasquez; Wilebaldo Cristian Gomez; Brianna Lynn Coriell; Alvaro Arellano; Patricia Louise Johnson Gregg; Ruben Bernado Jr Chavez; Alma Rosa Dela Torre. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-161": [],
    "notice-162": [],
    "notice-163": [
        "Notice of Self Storage Sale Please take notice SecureSpace Self Storage Torrance located at 722 W 220th St., Torrance, CA 90502 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 2:00PM. Sparkle Clark; Lorie Scott; Phoebe Romero; Michael Mayo (3 units); Marie Garcia; John Perry; Danna Goyer; Ricardo Gilliard Vidaud; Marian Anhwere; Sergio Hernandez. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30, 2/6/24"
    ],
    "notice-164": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Gardena located at 620 W. 184 St. Gardena, CA 90248 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Kimberly Betancourt; Rosa Elizat AndradeAndrade; Aaron Lamont Carter; Tom Neddersen; Corvetta Monique Morris; Thomas Ronald Neddersen; Candice Michelle Arnwine. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-165": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Harbor City 253 located at 1239 W. 253rd St Harbor City, CA 90710 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Peggie Ann Elliott; Janai Anais Buck; Paul Hamilton; Darrell Carl Jr Hampton. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-166": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Valley Blvd located at 4800 Valley Blvd, Los Angeles, CA 90032 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Lauralinda Bedell; Andres MirandaCruz; Alejandro Alvarez Jr; Arturo Alegria Nieto; Dixie Lydia Bailon; Gonzalo Bartolome Esquivel Fernandez; Mayra Jeanette Castro; Marina Isabel Padilla; Derek Marcel Jr Talbird; Karina Adriana Lopez; Silvia Torres; Abraham Zurita; Efren Pacheco. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-167": [
        "Notice is hereby given that UHaul Company of South Orange County storage auction will take place online, Tuesday, February 13, 2024, 12:00 pm at jmichaelsauctions.com at UHaul Moving and Storage Of Temecula 27941 Jefferson Ave, Temecula, CA 92590, Items sold are generally described as: clothing, furniture and/or household items belonging to the following: Valesca Irizarry #1106, Leland Anderson #1244, William Stilling #1208 and Shane Williams #1160 & 1024. The PressEnterprise Published: 1/30, 2/6/24"
    ],
    "notice-168": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Valley Blvd located at 4800 Valley Blvd, Los Angeles, CA 90032 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Lauralinda Bedell; Andres Miranda-Cruz; Alejandro Alvarez Jr; Arturo Alegria Nieto; Dixie Lydia Bailon; Gonzalo Bartolome Esquivel Fernandez; Mayra Jeanette Castro; Marina Isabel Padilla; Derek Marcel Jr Talbird; Karina Adriana Lopez; Silvia Torres; Abraham Zurita; Efren Pacheco. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-169": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Chino Hills located at 15443 Fairfield Ranch Rd., Chino Hills, CA 91709 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Lamor Adrian; Hornaday Cynthia; Edwin Flamingo; Tapia Mario; Lora Bernadette McKinney; Joseph Dominic Giansante; Amanda B Listoe; Brenda Nunley. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Inland Valley Daily Bulletin Published: 1/30/24"
    ],
    "notice-170": [
        "NOTICE OF SALE ABANDONED PERSONAL PROPERTYNotice is hereby given that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to the California Self Storage Act. Items will be sold at www.storagetreasures.com by competitive bidding ending on 2/13/2024 at 12:00 PM. Property has been stored and is located at A-1 Self Storage, 5310 Vineland Avenue, North Hollywood, CA 91601. Sale subject to cancellation up to the time of sale, company reserves the right to refuse any online bids.Ronald Earl PipesRonald Earl PipesJennifer Ann MielzinerRegina GomezErik HernandezDonny JacksonReginald LaweryAsia CarterChristopher BentleyCarlos LangSteven HammockAuction by StorageTreasures.com480-397-6503Los Angeles Daily NewsPublished: 1/30/24"
    ],
    "notice-171": [
        "Extra Space Storage, on behalf of itself or its affiliates, Life Storage or Storage Express, will hold a public auction to satisfy Extra Spaces lien, by selling personal property belonging to those individuals listed below at the location indicated. 1340 E 6th St Beaumont CA 92223, February 2, 2024 at 12:00pm Janet Wright, Robert Rasha, Joanna Velarde, Jane Wright, Johnnie Sampson, Carina Loeza, La Wayne Williams, Natalie Berg, Andrea Lozoya, Rice Arnold, Lorene Ceci, Janet Wright The auction will be listed and advertised on www.storagetreasures.com. Purchases must be made with cash only and paid at the above referenced facility in order to complete the transaction. Extra Space Storage may refuse any bid and may rescind any purchase up until the winning bidder takes possession of the personal property. Run Date: 1/23, 1/30, 2024 TPR24-1041 ___________________________________________"
    ],
    "notice-172": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Westminster located at 14528 Edwards St., Westminster, CA 92683 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Siniva Mauala; Denise Delapaz; Matthew David McElhiney; Anthony Josue Guzman; Jonathon Brandan Castle; Patrick Gilmore Murphy; Tracey Russell Drapkin; Phillip Matthew Zweifel; William A Smith; Jaclyn Karen McKie; Jonathan Douglas Crawford; Joanne Marie Galante Cutler. All property is being stored at the above selfstorage facility. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-173": [
        "Notice is hereby given that U-Haul Company of South Orange County storage auction will take place online Tuesday, February 13, 2024, 12:00 pm at jmichaelsauctions.com at U-Haul Moving and Storage of California Oaks 41451 Kalmia St Murrieta, CA 92562. Items sold are generally described as: clothing, furniture and/or household items belonging to the following: Jasmine K. Olsewski #3311, Jee Leepark #3423, Cameron Purifie #3807, Jeffrey Garcia #3814, Christian James Arceyut #3833, Yvonne Savage #3907. The Press-EnterprisePublished: 1/30, 2/6/24"
    ],
    "notice-174": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage San Jose Lonus located at 900 Lonus St, San Jose, CA 95126 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 3:30PM. Damaso Ramos; Nhan Hua; Jose Herrera; Ashley Hunt; Eduardo S Palacios; Margaret Lorenz (2 units); Jefferson Tover; Maria Elena Murillo; Nerisa Lelei Ilaoa; Nick Pisano; Samuel Maiah; Eric Ames; Delia Vanes; Joshua Gonzalez Garcia; Jose Escapite; Raja V Jasti/Zeroui. This sale may be withdrawn at any time without notice. Certain terms and conditions apply.MN# 0006805196"
    ],
    "notice-175": [],
    "notice-176": [
        "Notice of Self Storage Sale Please take notice US Storage Centers - Simi Valley located at 2073 Royal Ave. Simi Valley, CA 93065 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. James Scott Jones; Lori Lee Ulnick; Dawn Louise Venning; Cookie E. Murillo; Peter F Milinazzo. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. #9749208; 1/30/2024"
    ],
    "notice-177": [
        "Notice of Public Lien Sale Notice of Public Lien Sale Notice is given that pursuant to sections 21700-21713 of Business Professions code, section 2328 of the 535 of the Penal code, that All City Storage LLC at 1750 La Costa Meadows Drive San Marcos CA 92078 will sell by competitive bidding on or after 9:00 AM, on January 31, 2024 property belonging to those listed below. Auction to be held via online auction www.storagetreasures.com. Property to be sold as follows: household goods, furniture, personal items, tools, clothing, electronics, auto parts and misc. unknown boxes, belonging to the following: Melissa Costa B3120; Grant Mcginnis C3186; April Holman D1042"
    ],
    "notice-178": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage Rialto located at 2850 Foothill Blvd, Rialto, CA 92376 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 1:30PM. Robert Hagans; Rickquel Atkins. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-179": [],
    "notice-180": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Corona located at 22237 Knabe Road Corona, CA 92883 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Karyn Emily Ceja; Julio Villalobos; Lisa Vasa Misipeka; Thailani Aisa Inojales; Christopher Richard Davis; Stephen Ross Green; Wesley McDowell; John Michael Morrison Taylor; Maria E Duran. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The PressEnterprise Published: 1/30/24"
    ],
    "notice-181": [
        "CALIFORNIA AUCTION NOTICE IS HEREBY GIVEN THAT THE CONTENTS of the following storage units will be offered for sale by public auction to the highest bidder for enforcement of the storage lien. Location of self-storage facility: Cochrane Road Self Storage 411 Woodview Ave., Morgan Hill, CA 95037 The auction will start on Wednesday, January 31, 2024, at 10:00 AM and will end on Wednesday, February 14, 2024, at 12:00 PM Location of sale: https://www.storagetreasures.com/ Terms: Cash or Credit Card; Cochrane Road Self Storage, LLP reserves the right to refuse any bid or cancel auction. Auctioneer: https://www.storagetreasures.com/ The following customers scheduled for auction are: Richard Hartman Logan Hinkle Jeff Torre Units may contain household items, tools, electronics, furniture, clothes, boxes, and miscellaneous items. SJMN #6806632; January 31; February 7, 2024"
    ],
    "notice-182": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Harbor City Frampton located at 24490 Frampton Ave. Harbor City, CA 90710 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Anthony Joseph Hunter; Herman Michael II Few; Gregorio Geramiah Gomez; Elsner Gabriel de la Roca. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. Daily Breeze Published: 1/30/24"
    ],
    "notice-183": [
        "Notice of Self Storage SalePlease take notice US Storage Centers – Chino located at 13555 Ramona Ave Chino CA 91710 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Christina Camacho (2 units); Kandyce Jelks; Paula Martinez; Sandon Larson; Edwin Hernandez; Shantel Star Essex; Steven Alexander Pu Ramos. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-184": [
        "Notice of Self Storage Sale Please take notice US Storage Centers - Oxnard located at 1401 Maulhardt Ave Oxnard CA 93030 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Jan Woodfill; Jim Gay; Kiyana Marie Morris; Marivel Elizabeth E Rodriguez; Melissa Francine Melendez; Michelle Shanae White. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. 9749256; 1/30/2024"
    ],
    "notice-185": [
        "Notice of Self Storage Sale  Please take notice SecureSpace Self Storage Spring Valley located at 11902 Campo Rd, Spring Valley, CA 91978 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:30PM. Kelly M Adams; Christopher T Edmond; Keri Ciesielski; Maureen Riley. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-186": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Laguna Niguel located at 27194 Camino Capistrano Laguna Niguel, CA 92677 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Heidi Ann Hollister; Casey R Thaler; Shannon Michelle McGregor; Juan GonzalezRayon. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-187": [
        "Notice as hereby given that U-Haul Company of South Orange County storage auction will take place online Wednesday, February 13, 2024, 12:00 pm at jmichaelsauctions.com at U-Haul Moving and Storage of Murrieta 25086 Jefferson Ave Murrieta, CA 92562. Items sold are generally described as: clothing, furniture and/or household items belonging to the following: Candy Powers #1234, Tabatha Pendleton #1313, Jaheim Smith #1165, David Clouser #3014, Anthony Tabor #2200, Oscar Valencia #2382, Kyle Scott #2342, Daniel Mercer #AB5112E, AB3831E, AB9238B and AB4940E. The Press-EnterprisePublished: 1/30, 2/6/24"
    ],
    "notice-188": [
        "Notice Is Hereby Given That Pursuant To Sections 21700-21716 Of The Business And Professions Code, Section 2328 Of The UCC, Section 535 Of The Penal Code And Provisions Of The Civil Code, RightSpace Storage - San Jacinto, 442 W Esplanade Ave, San Jacinto, CA, 92583 Will Sell By Competitive Bidding The Following Units. Auction to Be Conducted through Online Auction Services of WWW.LOCKERFOX.COM, with bids opening on or after Tuesday February 06, 2024 at 10:00 am and closing on or after Tuesday February 13, 2024 at 10:00 am Purchases Must Be Made with DEBIT or CREDIT CARD, CERTIFIED CHECK or MONEY ORDER ONLY and Paid at the time of Sale. All Goods are Sold as is and must be Removed within 72 Hours of the time of Purchase. RightSpace Storage - San Jacinto, Reserves the Right to Retract Bids. Sale is Subject to Adjournment. Sale is subject to cancellation in the event of settlement bid at: www.lockerfox.com. Deborah Estrada Jaynita R Mcwilliams Mayra Labrada Robert Thompson Benjamin Salgado Darrell Hunt Zed Deanda Victoria Udeze Victoria Udeze Ryan Martin Victoria Udeze Imelda Bustamante Published on January 30, 2024 TPR24-1047 The Public Record ___________________________________________"
    ],
    "notice-189": [
        "Notice of Self Storage SalePlease take notice IN Self Storage - Milpitas located at 15 Dixon Landing Rd., Milpitas, CA intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 10:00AM. Osvaldo Beristain Lezama. This sale may be withdrawn at any time without notice. Certain terms and conditions apply.MN# 0006805194 Jan 30 and Feb 6, 2024"
    ],
    "notice-190": [
        "Notice Is Hereby Given That Pursuant To Sections 21700-21716 Of The Business And Professions Code, Section 2328 Of The UCC, Section 535 Of The Penal Code And Provisions Of The Civil Code, Guava Street Self Storage, 41176 Guava St., Murrieta, CA, 91801 Will Sell By Competitive Bidding The Following Units. Auction to Be Conducted through Online Auction Services of WWW.LOCKERFOX.COM, with bids opening on or after Tuesday February 06, 2024 at 10:00 am and closing on or after Tuesday February 13, 2024 at 10:00 am Purchases Must Be Made with DEBIT or CREDIT CARD, CERTIFIED CHECK or MONEY ORDER ONLY and Paid at the time of Sale. All Goods are Sold as is and must be Removed within 72 Hours of the time of Purchase. Guava Street Self Storage, Reserves the Right to Retract Bids. Sale is Subject to Adjournment. Sale is subject to cancellation in the event of settlement bid at: www.lockerfox.com. Lonnie Alexander Lonnie Alexander Lonnie Alexander Published on January 30, 2024 TPR24-1048 The Public Record ___________________________________________"
    ],
    "notice-191": [
        "Notice of Self Storage SalePlease take notice Covina Self Storage located at 1101 North Azusa Ave. Suite C Covina, CA 91722 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Adolfo Jr Garcia; Mariah Nicole Oliva; Cecilia Amorette Kathleen Vega; Joseph Efrain Alarcon; Alexander Julian Gradias; Veronica Nidia Vasques; Javier Armando Olvera; Guadalupe Espinoza; Gonzalo Adrian Padilla; Tatyanna Tonnai Moore. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-192": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage San Jose Hedding located at 355 W Hedding St, San Jose, CA 95110 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 2:30PM. Richard Bradley; Map Sy.  This sale may be withdrawn at any time without notice. Certain terms and conditions apply.MN# 0006805198 Jan 30 and Feb 6, 2024"
    ],
    "notice-193": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Harbor City 257th located at 1239 257th Harbor City, CA 90710 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Elle Marie; Amrit Uttam Lal; Sandra Brass; Charlotte Huelanda Barnes; Cassandra Ruth Hammond; Rumalda Gonzalez Campos; Katrina Tiffany Bell; Jasmin Serrato Ceja; Nassim Sagawa; Steven Lee Gonzalez; Danielle Merissa Rosales; Debbie Ruth Hernandez; Carla Kay Crawford; Thomas Wayne Cooper; Daniel Christopher Ramos; Jennifer Raposas. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-194": [],
    "notice-195": [
        "Notice of Self Storage SalePlease take notice US Storage Centers – Irwindale located at 13201 Ramona Blvd Irwindale, CA 91706 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Fredia Jean Beggs; Julieta del Rosario Ramirez; Marie Asuncion Fabricante Fontelera; Quang van Ha. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-196": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Carson - Wilmington located at 21640 S Wilmington Ave., Carson CA, 90810 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Gracelyn Oliver; Lolita Ann Dates Turner; Quantaris Tylee Pettis; Miro Tahmeer Perry; Elijah Aaron Mack Cyiark; Delois Jean Trammell; Julie Marie Broxterman; Trinity Angelina Muth; Christopher Cree Simmons; Tre Christopher Roberts; Tanesha Nichelle Brown; Johnea Wade; Sandra Henry. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-197": [
        "NOTICE OF LIEN SALE Extra Self-Storage Chico Annex will sell the contents of the following units to satisfy the lien: Name: Dwight Eble Name: Erick Kauffman Name: Cynthia Sanchez Name: Samuel Thrift TO THE HIGHEST BIDDER ON: February 06, 2024 ENDING AT 3:00 PM SALE TO BE HELD ONLINE AT: www.StorageTreasures.com Purchases must be paid at the time with Cash only. Sale subject to cancellation. Company reserves the right to refuse any online bids. 01/31/2024"
    ],
    "notice-198": [
        "Notice of Self Storage Sale  Please take notice SecureSpace Self Storage Vista located at 220 Huff St, Vista, CA 92083 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 2:30PM. Rene Aguilar (2 units); Angelica Flores; Scott Burns; Noah Shaw; Ted Lazich. intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility."
    ],
    "notice-199": [
        "Lien Sale Auction Advertisement Notice is hereby given that Pursuant to the California Self-Service Storage Facility Act, (B&P Code 21700 et. seq.) Auction to be held at 12:00 pm on February 14, 2024, at www.selfstorageauction.com. The property is stored at: Security 1st Self Storage 60 E Grand Ave. Oroville, CA 95965 NAME OF TENANT Amy P. Deckard Michael Kelly Thomas Debbie Wyatt Sunnie Bertelli 1/31/24 CNS-3775601# CHICO ENTERPRISE-RECORD"
    ],
    "notice-200": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage Milpitas located at 324 S Main St, Milpitas, CA 95035 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 2:00PM. Bernadette Martinez; Darnell Giggans; Peter Giovannoni; William Macias; Nicole Frandsen; Lidia Zuniga Ramirez; Robert Green. This sale may be withdrawn at any time without notice. Certain terms and conditions apply.MN# 0006805195"
    ],
    "notice-201": [
        "Notice of Lien Sale NOTICE IS HEREBY GIVEN, StorQuest Self Storage 78120 42nd Ave Bermuda Dunes, CA 92203 will sell at public sale by competitive bidding the personal property of: Adam Ruegg, Annie Ruegg, Pamela Sue Martinez, Sixta Tulia Payan, Susan Marie olson, Shawn Colby Grayson, Nadia Gonzalez Property to be sold: Misc. household goods, furniture, tools, clothes, boxes & personal contents. Auctioneer Company: www.storagetreasures.com. The Sale will conclude at 12:00 PM on February 14th, 2024. Goods must be paid in CASH and removed at the time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. AD DATES: 01/30, 02/06, 2024 TPR24-1049 ___________________________________________"
    ],
    "notice-202": [
        "Notice of Lien Sale NOTICE IS HEREBY GIVEN, StorQuest Self Storage 32500 Date Palm Dr, Cathedral City, CA 92234 will sell at public sale by competitive bidding the personal property of: Melody Gerson Morrison, Tim Jones , Arthur Garcia Jr, Luxurious Customs, Isiah Q Washington Property to be sold: Misc. household goods, furniture, tools, clothes, boxes & personal contents. Auctioneer Company: www.storagetreasures.com. The Sale will conclude at 12:00 PM on Feb,14, 2024. Goods must be paid in CASH and removed at the time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. AD DATES: 1/30, 2/6, 2024 TPR24-1059"
    ],
    "notice-203": [
        "Notice of Self Storage Sale Please take notice AC Self Storage Rohnert Park located at 220 Business Park Drive Rohnert Park CA 94928 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storage treasures.com on 2/15/2024 at 12:00PM. Jefferey Crane; Jordana Cevalala Eliza Whippy; Kelly Turnbull; Daniel Burns; Stephen C. Perry; Brenda Frauzino; Daniel Martinez. This sale may be withdrawn at any time without notice."
    ],
    "notice-204": [
        "Notice of Self Storage SalePlease take notice US Storage Centers – Stanton located 10881 Dale Ave, Stanton, CA 90680 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Cynthia Vanessa Lorona; Hyiandari Aurora Reyes Dieguez; Joe Xuan Tran; Roberta Kay Long; Ronald Edward Dietl II; Sergio Antonio Vasquez; Teodora-Ofelia Miclescu; Teresa de Jesus Penaloza- Rioquinto; Tony Tuan Duong. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-205": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Southbay located at 14680 Aviation Blvd Hawthorne, CA 90250 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Brittany Rogers; Caitlin Eliese Campbell; Fernando Gonzalez; James Brian Fraelich; John David Storer; Kendra Dajana McFirstley; Kina Lane Whitfield; Michelle Anaya; Richard Dale McKinzey; Tyrone Hunt (2 units). This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-206": [
        "Notice of Self Storage SalePlease take notice Small Town Storage - Lancaster located at 42034 3rd Street E, Lancaster, CA 93535 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Timothy Mack Casillas; Constance Ann Kempel; Myisha Danata Stewart; Saraya Meon Ashley; Kimberly Ann Humphrey (3 units); Monique Marie Hood; Josephine Louise Parker. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-207": [
        "Notice of Self Storage SalePlease take notice Tyler Mall Mini Storage located at 10090 Indiana Ave., Riverside, CA 92503 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Eugene Christian Schultz; Coralynn Larocco; Connieann Cervantes Toyer; Sofia Perez; Chandra Renee McKinley; Abrehanah Salamniahi; Eliza Lauren Wright; Adrian Vasquez; Wilebaldo Cristian Gomez; Brianna Lynn Coriell; Alvaro Arellano; Patricia Louise Johnson Gregg; Ruben Bernado Jr Chavez; Alma Rosa Dela Torre. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-208": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Corona Circle City Dr located at 1512 Circle City Dr Corona CA 92879 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Jacobo Hernandez; Carlos Alvarenga; Robert Stephen Smith. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Press-EnterprisePublished: 1/30/24"
    ],
    "notice-209": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Inglewood located at 820 Industrial Ave. Inglewood, CA 90302 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Ashley Marie Thomas; Corey Deshaun Cofield (2 units); Curtis E Haynes; Damian Deshawn Mitchell; Dieudonne Ngnie; Ericka Martin; James Ryan Hoover; Jose Gabriel Rodriguez Gonzalez; Kelvin Lawrence Brown II; Latriece Jonae Harris; Pls Custom Framing Inc; Roosevelt White; Sultanyah Rachel Smith (2 units); Tracy Barnett- Smith.  This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-210": [],
    "notice-211": [
        "Pursuant to Chapter 10, commencing with Section 21700 of the Business Professionals Code, NOTICE IS HEREBY GIVEN that Lighthouse Storage will sell at public sale by competitive bidding on February 13, 2024 at 10:30 A.M. on the premises where the said property has been stored and which are located at Lighthouse Storage- 14400 Beach Blvd. Westminster, 92683 , State Of California, County of Orange, the following: Emmanuel Jaramillo, Glenn Jones, Gengo Grip & Lighting LLC/Christopher Charles Rauch, Teresa My-Huong Vu, Bich Van Thi Nguyen. Vacuum Cleaner, Chest, Shoes, Bags, Tools, Boxes, Totes, Luggage, Ice Chests, Skateboard, mattress, box spring, garden tools, power tools, hand tools, pallet mover, crates, type writer, air compressor, paintings, clothes, dresser, television, Computer, monitor, speakers, holiday décor, drum set, lights, Etc. Must be paid in cash only. There is a $100 minimum cleaning deposit on all units. All purchased items are sold as is, where is and must be removed at time of sale. Sale subject to cancellation up to the time of the sale and company reserves right to refund any bid. American Auctioneers B/N #FS863-20-14. Phone number: 800-838-7653."
    ],
    "notice-212": [
        "FICTITIOUS BUSINESSNAME STATEMENTThe Name(s) of the Business(es):1. Nevada City Self Storage LLC13388 Joe Day Ranch Rd.Nevada City, CA 95959is (are) hereby registered by the following owner(s):Jacquelyn DayJoseph DayThis business is conducted by:A Limited Liability Company, State of CATHE REGISTRANT COMMENCED TO TRANSACT BUSINESS UNDER THE FICTITIOUS BUSINESS NAME(S) LISTED ABOVE ON:2022-01-01\"I declare that all information in this statement is true and correct. (A registrant who declares as true information which he or she knows to be false is guilty of a crime).SIGNATURE OF REGISTRANT:/s/ Jacquelyn DayThis statement was filed with the Clerk-Recorder of Nevada County onJanuary 23 2024Assigned File20240000078Published: January 30, February 6 , 13, 20, 2024"
    ],
    "notice-213": [
        "Notice of Self Storage SalePlease take notice AllSpace Self Storage - Costa Mesa located at 1535 Newport Blvd Costa Mesa CA 92627 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Greg Kendrick; Addie Faye Martucci Penner; Joseph A Mascetti; Donovan David Cosby; Smirz E Ken. This sale may be withdrawn at any time without notice. Certain terms and conditions apply.The Orange County RegisterPublished: 1/30/24"
    ],
    "notice-214": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Westminster located at 14528 Edwards St., Westminster, CA 92683 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Siniva Mauala; Denise Delapaz; Matthew David McElhiney; Anthony Josue Guzman; Jonathon Brandan Castle; Patrick Gilmore Murphy; Tracey Russell Drapkin; Phillip Matthew Zweifel; William A Smith; Jaclyn Karen McKie; Jonathan Douglas Crawford; Joanne Marie Galante Cutler. All property is being stored at the above self-storage facility. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-215": [
        "Notice of Self Storage SalePlease take notice AllSpace Self Storage - Huntington Beach located at 8564 Hamilton Avenue Huntington Beach CA 92646 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. James Patrick Gallagher; Reece Staton; Steven Carr; Edward A Munroe; Michelle Louise Simpson. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-216": [
        "ADVERTISEMENT OF SALE(Online Auction)NOTICE IS HEREBY GIVEN that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to Sections 21700-21716 of the Business & Professions Code. The undersigned will sell at public sale by competitive bidding on the 6th day of February 2024, at 10:00AM, at www.storagetreasures.com . Property is stored at Fortress-Secure Mini-Storage, 1281 Furukawa Way, Santa Maria, CA County of Santa Barbara, State of California, the contents of the following tenant’s storage space(s):Denetria Walls, Frank Estrada, Erica Telles, James Bastanchury, Erica Telles, Veronica Ruiz, & William Deeks.Purchases must be paid for at the time of purchase in cash and credit cards only. All purchased items sold as is where is and must be removed within 72 hours of the sale. Sale is subject to cancellation in the event of settlement between owner and obligated party.Auctioneer: Plastino Interests, Inc., CA Bond#7901004996Online Auction Platform: www.storagetreasures.comFacility Phone: (805) 922-7000Pub dates: Jan 23, 30, 2024Legal 297296"
    ],
    "notice-217": [
        "NOTICE OF PUBLIC AUCTION Pursuant to the California Self Storage Facilities Act, (B&P Code 21700 et. seq.), Canyon Self Storage located at 930 Noble Way, Santa Maria, CA 93454, 805-928-1611, intends to sell at public auction personal property including but not limited to furniture, bed frame, water cooler, and/or other misc. items of the following Occupants of the Facility: Kelli J Waquan and Anthony Yanez. The items will be sold on February 6th, 2024 at 9:00am at www.storagetreasures.com after being listed and advertised on said online auction website. The winner of the sale is subject to the terms and conditions of the website, preregistration to bid is required.Pub dates: Jan 23, 30, 2024Legal 296217"
    ],
    "notice-218": [
        "Notice of Self Storage SalePlease take notice AA New Storage located at 1741 Whittier Avenue Costa Mesa, CA 92627 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Curtis Jay Van Aken (2 units); Robyn Leigh Hadem; Steven Arianto (2 units). This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-219": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Laguna Niguel located at 27194 Camino Capistrano Laguna Niguel, CA 92677 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Heidi Ann Hollister; Casey R Thaler; Shannon Michelle McGregor; Juan Gonzalez-Rayon. This sale may be withdrawn at any time without notice. Certain terms and conditions apply.The Orange County RegisterPublished: 1/30/24"
    ],
    "notice-220": [
        "Notice of Self Storage SalePlease take notice South Coast Self Storage located at 3480 W. Warner Ave. Santa Ana, CA 92704 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Fausto J Ambriz; Keith Thomas; Aaron Hart Brower; Pauline M Huber; Robin Kay Brunette; Jaime Gandarilla Maldonado. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-221": [
        "Notice of Self Storage SalePlease take notice AllSpace Self Storage - Garden Grove located at 11382 Trask Avenue Garden Grove CA 92843 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Edward M Martinez; Alejandro Anaya. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-222": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Laguna Hills located at 23370 Moulton Pkwy Laguna Hills, CA 92653 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Tracy Arnett McLellan. All property is being store at the above self-storage facility. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-223": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage Brea located at 2700 E Imperial Hwy Brea CA 92821 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 3:30PM. Amerdeep Sran; William Allen; David Salkin; Scott Ozeki; William Foster; Ben Ignacio; Vanessa Pitts; John Rowe; Enrique Antillon; Reuben Dwemoh; Kimberly Covarrubias. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-224": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Orange located at 1460 N. Main St., Orange, CA 92867 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Azel Gustavo Gonzalez; Brenda Sanchez; Christopher David Allen; Christopher Lee Conry; David Harvey Everston; Edward Charles Fahrenholz; John Glenn Padilla (2 units); Kimberly Candelaria Marie Singh; Krysti Jo Branstetter; Krystle D K S S Belmonte-Phillips; Rodney Jr. Goldsberry; Ronald Jr. Bennett. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-225": [
        "Notice of Self Storage SalePlease take notice US Storage Centers - Costa Mesa located at 1600 Superior Avenue Costa Mesa, CA 92627 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Clark Anthony Wimer/The Honest Energy Company; Samantha Marcela Fonseca; Omar Villegas; Guadalupe Rojas Vazquez. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County RegisterPublished: 1/30/24"
    ],
    "notice-226": [
        "Notice of Self Storage Sale Please take notice Small Town Storage - Vacaville located at 226 Bella Vista Rd. Vacaville, CA 95687 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. David Wayne Ellerbe; Janae Ruth Hughes; Angelique Vault; Stanley Ignacio V Martinez; Dakota Allen Howard; Jason Alan Hall; Tonisha Antoinette Wiley. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-227": [
        "Notice of Self Storage Sale Please take notice SecureSpace Self Storage San Jose Hedding located at 355 W Hedding St, San Jose, CA 95110 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 2:30PM. Richard Bradley; Map Sy. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. MN# 0006805198 Jan 30 and Feb 6, 2024"
    ],
    "notice-228": [
        "Foothill Self Storage Auction February 8,2024 at 10AM 1041 E Foothill Blvd. upland CA 91786Ignacio Espinoza unit 897 (10x10) - lockers, fishing poles misc. itemsWilliam Alexander unit 898 (10x10)- misc. itemsLisa Boyer unit 74 (5x5) Guitars, car amp, misc. totesSharron Calloway unit 585 (10x20)-Misc totes, misc. boxes,furniture,blanketsJames Adams jr unit 616 (5x15)-lamp,dresser,misc itemsCharlena Fleming units 595,445,312,546 (10x20) (5x10) (5x10) (10x20) tv, Xbox games, clothes, furniture, pictures, misc. boxes, kitchen ware, fridge, printer, tableLaura Cannon unit 159 (12x16) Workout equipment, misc. boxes, art supplies, dresser ice chestAlberto Torres unit 32 (5x10) Rims, misc. boxes car jacks, dollhouse, toy cars.Inland Valley Daily Bulletin - SBPublished: 1/22, 1/29/24"
    ],
    "notice-229": [
        "LIEN SALE Elijah Guido Rennan Levita Praveen Singh Charles Cendana The following persons are in lien at North Milpitas Self Storage 1001 Hanson Ct. Milpitas, CA 95035: The items to be sold include: Household items, furniture, clothes, toys and miscellaneous electronics. The date of the sale will be 06/19/2023 at 11:00 am The location of the sale will be: Online at www.storagetreasures.com The auction end date will be 06/19/2023 at 12:00 pm All bids must be placed prior to this time. MN# ###### Jan 23 and 30, 2024"
    ],
    "notice-230": [
        "Notice of Self Storage Sale Please take notice SecureSpace Self Storage San Leandro located at 13760 E 14th St., San Leandro, CA 95478 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 4:00PM. Armin Punongbayan; Ahmad Nejati; Liltoria Chestnut; Carlisa Harris; Halie Pecot. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. TVH 6806136; Jan. 30; Feb. 6, 2024"
    ],
    "notice-231": [
        "Notice of Self Storage Sale Please take notice SecureSpace Self Storage San Jose Lonus located at 900 Lonus St, San Jose, CA 95126 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 3:30PM. Damaso Ramos; Nhan Hua; Jose Herrera; Ashley Hunt; Eduardo S Palacios; Margaret Lorenz (2 units); Jefferson Tover; Maria Elena Murillo; Nerisa Lelei Ilaoa; Nick Pisano; Samuel Maiah; Eric Ames; Delia Vanes; Joshua Gonzalez Garcia; Jose Escapite; Raja V Jasti/Zeroui. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. MN# 0006805196 Jan 30 and Feb 6, 2024"
    ],
    "notice-232": [
        "LIEN SALE Notice is hereby given that a public lien sale of the following describes personal property will be held online at www.storageauctions.com Auction Date:Monday February 05, 2024 at 9:00 am Location: Advanced Mini Storage 2 - Murray, 7739 Murray Dr., Stockton, CA, 95210 The contents of the rental storage units all containing household goods and belonging to the following persons will be sold: Laura Pompa Erma G Howard This notice is given in accordance with the provisions of Section 21700 et seq of the Business & Professions Code of the State of California Publication Dates L00000000"
    ],
    "notice-233": [
        "LIEN SALE Notice is hereby given that a public lien sale of the following describes personal property will be held online at www.storageauctions.com Auction Date:Monday February 05, 2024 at 9:00 am Location: Advanced Mini Storage 1 - Monte Diablo, 2625 Monte Diablo Ave., Stockton, CA, 95203 The contents of the rental storage units all containing household goods and belonging to the following persons will be sold: Donyell Jones Elizabeth A Rodriguez Jose Hernandez Pamela M Goldsworth Elizabeth Jones Khasatie Hernandez Le Brown David Mesta This notice is given in accordance with the provisions of Section 21700 et seq of the Business & Professions Code of the State of California Publication Dates L00000000"
    ],
    "notice-234": [],
    "notice-235": [
        "Notice of Self Storage Sale Please take notice SecureSpace Self Storage Milpitas located at 324 S Main St, Milpitas, CA 95035 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 2:00PM. Bernadette Martinez; Darnell Giggans; Peter Giovannoni; William Macias; Nicole Frandsen; Lidia Zuniga Ramirez; Robert Green. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. MN# 0006805195 Jan 30 and Feb 6, 2024"
    ],
    "notice-236": [
        "Foothill Self Storage Auction February 8,2024 at 10AM 1041 E Foothill Blvd. upland CA 91786 Ignacio Espinoza unit 897 (10x10) lockers, fishing poles misc. items William Alexander unit 898 (10x10) misc. items Lisa Boyer unit 74 (5x5) Guitars, car amp, misc. totes Sharron Calloway unit 585 (10x20)Misc totes, misc. boxes,furniture,blankets James Adams jr unit 616 (5x15)lamp,dresser,misc items Charlena Fleming units 595,445,312,546 (10x20) (5x10) (5x10) (10x20) tv, Xbox games, clothes, furniture, pictures, misc. boxes, kitchen ware, fridge, printer, table Laura Cannon unit 159 (12x16) Workout equipment, misc. boxes, art supplies, dresser ice chest Alberto Torres unit 32 (5x10) Rims, misc. boxes car jacks, dollhouse, toy cars."
    ],
    "notice-237": [
        "NOTICE OF PUBLIC SALE. Notice is hereby given that PODS Enterprises, LLC, located at 220 E Stanley St. Compton, CA 90220, will sell the contents of certain containers at auction to the highest bidder to satisfy owner’s lien. Auction will be held online at www.StorageTreasures.com starting on February 7, 2024 and ending on February 14, 2024. Contents to be sold may include general household goods, electronics, office & business equipment, furniture, clothing and other miscellaneous property. The name of the occupants and the respective items to be sold are as follows: Yolanda Latimer- cart, chest, contractor bags, storage bins and other miscellaneous; James Germany- Drum set, exercise machine, dresser, bins, boxes, and other miscellaneous items; Monday Motorbikes Attn: Josh Rasmussen- Couch, shelving, rugs, boxes, bins, and other miscellaneous items; Tony Perez- Computer chair, chests, dressers, boxes, and other miscellaneous items; Robert Barry- Mattresses, suitcase, filing cabinet, lamp, and other miscellaneous items; Kevin Dennis- Mattress, bicycles, tables, clothing rack, boxes, and other miscellaneous items; Gregory Barr- Grill, chairs, mattresses, shelving, and other miscellaneous items"
    ],
    "notice-238": [
        "NOTICE OF PUBLIE LIEN SALE Notice is hereby given by undersigned that a public lien sale of the following described personal property will be held ONLINE @ www.storagetreasures.com starting @ 8am on 02/06/24 for Shoreline Self Storage, 100 Kimberly Ln, Lakeport, CA 95453. NUCHOLS JO5, SWING H11, NEISLE G83, VIRAMONTES D21, POMMIER E21, BELL K27, RIDGEL E24. All units contain miscellaneous household and garage items: This notice is given in accordance with the Pursuant to Section 21700-21716 of the Business & Professions Code, Section 2328 UCC, Section 535 Penal Code and provisions of the civil code. Pub: 1-23,30/24"
    ],
    "notice-239": [],
    "notice-240": [
        "PUBLIC LIEN SALE OF PERSONAL PROPERTY NOTICE IS HEREBY GIVEN that the undersigned intends to sell the Personal Property described to enforce a lien imposed on said property pursuant to Section 21700-21716 of the Business and Professions Code, Section 2328 of the Penal Code and Provisions of the Civil Code. The undersigned will sell at public sale competitive bidding on the Date: Tuesday, FEBRUARY 13, 2024 at 11:00 AM On the premises where the property has been stored and which are located at 2049 East Monte Vista Ave. Vacaville, Ca 95688: Airport Self Storage-Solano County, State of California. Consisting of misc personal property: F006 James Ernest Mack Jr. H005 James Ernest Mack Jr. H007 James Luigi Scrivani H064 Adebongio Bongi Crane K038 Tamyra Billingsley All purchases to be paid in cash only. Each unit will be sold as one lot. Buyers must remove ALL ITEMS out of the unit purchase within 24 hours. Sale subject to cancellation without notice in the event settlement is made between obligated parties and Airport Self Storage. Management reserves the right to set minimum bid or refuse any bids. Auctioneer: Storage Auction Experts License 5860870"
    ],
    "notice-241": [
        "Notice of Self Storage Sale Please take notice Mad River Storage Center located at 1400 Glendale Dr., McKinleyville CA 95519 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.bid13.com on 2/15/2024 at 12:00PM. Philip Wood; Caleb Blood. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-242": [],
    "notice-243": [
        "Notice of Self Storage Sale Please take notice IN Self Storage Milpitas located at 15 Dixon Landing Rd., Milpitas, CA intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 10:00AM. Osvaldo Beristain Lezama. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. MN# 0006805194 Jan 30 and Feb 6, 2024"
    ],
    "notice-244": [],
    "notice-245": [
        "FICTITIOUS BUSINESS NAME STATEMENT File No.: 2024-9000743 Filed with Jordan Z. Marks Recorder/County Clerk County of San Diego: Jan 10, 2024 Fictitious Business Name(s): a. Overland-Tandberg Located at: 2633 Camino Ramon, Suite 325, San Ramon , California 94583 Contra Costa County. ?Mailing Address: 2633 Camino Ramon, Suite 325, San Ramon, CA 94583 Registered Owners Name(s): a. Overland Storage, Inc., 2633 Camino Ramon, Suite 325, San Ramon, CA 94583 , Delaware . This business is conducted by: a Corporation . The first day of business was 11/14/2018 . I declare that all information in this statement is true and correct. (A registrant who declares as true any material matter pursuant to Section 17913 of the Business and Professions code that the registrant knows to be false is guilty of a misdemeanor punishable by a fine not to exceed one thousand dollars (1,000).) Registrant Name /s/ Eric Kelly , Chief Executive Officer 01/29/24, 02/05/24, 02/12/24, 02/19/24"
    ],
    "notice-246": [
        "ADVERTISEMENT OF SALE Notice is hereby given that the undersigned intends to sell the personal property and household items described below to enforce a lien imposed on said property under the CA. Self-Service Storage Facility Act (Bus. & Prof. Code ss 21700-21716). The undersigned will sell at public sale by competitive bidding on February 15, 2024 at 10:00 A.M. on the premises where said property has been stored and which are located at Pete's Mini Storage, 1404 S. State St., County of Mendocino, Ukiah, CA the following: 1. Mike Schuler Unit- I-3 Hsld Items. Boxes and contents unknown 2. Fortunata Iannetta Unit- I-2 Hsld Items. Boxes and contents unknown 3. Deborah D. Schuler Unit- G-7 Hsld Items. Boxes and contents unknown 4. Cheryl Cornett Unit- H-7 Hsld Items. Boxes and contents unknown 5. Melina Menezes Unit- D-4 Hsld Items. Boxes and contents unknown Purchases must be paid for at the time of purchase in cash. All purchased items sold as is, where is, and must be removed at the time of sale. Sale subject to cancellation in the event of settlement between owner and obligated party. Auctioneer: Douglas P. Carter (707) 468-8885 Bond Pete's 1049915. Pub: 1-30 & 2-6/2024"
    ],
    "notice-247": [
        "Notice of Self Storage Sale Please take notice SecureSpace Self Storage San Jose Teresa located at 6880 Santa Teresa Blvd, San Jose, CA 95119 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 3:00PM. Victor Guerra; Gabriel Domingues; Bianeth C Amaya Delgado; Michael Brotherton; Robert J Agpalasin. All This sale may be withdrawn at any time without notice. Certain terms and conditions apply. MN# 0006805197 Jan 30 and Feb 6, 2024"
    ],
    "notice-248": [],
    "notice-249": [
        "NOTICE OF PUBLIC SALE OF PERSONAL PROPERTY Notice is hereby given that pursuant to CA Business & Professions Codes Sect 21700- 21716, Uniform Commercial Code Sect 2328, CA Penal Code Sect 535 and CA Auction Licensing Act, the undersigned will sell at public sale by competitive bidding on the 6th day of February 2024, at 12:00 pm (noon) on premises where said property is stored and which are located at Harbor Bay RV & Self Storage, 500 Maitland Drive, City of Alameda, County of Alameda, State of CA, the goods, chattels, tools, equipment and other effects of general household or business inventory stored by or for the parties: Unit Name: G222 J.P. SEAFOOD CO H266 J.P. SEAFOOD CO Purchases are SOLD-AS-IS, CASH-ONLY, and must be paid at time of sale and removed within 24 hours. Sale is subject to cancellation due to settlement between owner and obligated party. Auctioneer-John Cordoza, CAI, BAS, CES, Bond # 5860870 HBS, LLC. Publish 01-23- 2024 and 01-30-2024. ATS# 6804190 Jan. 23 & Jan 30 2024"
    ],
    "notice-250": [
        "NOTICE OF PUBLIC SALE. Notice is hereby given that PODS Enterprises, LLC, located at 220 E Stanley St. Compton, CA 90220, will sell the contents of certain containers at auction to the highest bidder to satisfy owner's lien. Auction will be held online at www.StorageTreasures.com starting on February 7, 2024 and ending on February 14, 2024. Contents to be sold may include general household goods, electronics, office & business equipment, furniture, clothing and other miscellaneous property. The name of the occupants and the respective items to be sold are as follows: Yolanda Latimer cart, chest, contractor bags, storage bins and other miscellaneous; James Germany Drum set, exercise machine, dresser, bins, boxes, and other miscellaneous items; Monday Motorbikes Attn: Josh Rasmussen Couch, shelving, rugs, boxes, bins, and other miscellaneous items; Tony Perez Computer chair, chests, dressers, boxes, and other miscellaneous items; Robert Barry Mattresses, suitcase, filing cabinet, lamp, and other miscellaneous items; Kevin Dennis Mattress, bicycles, tables, clothing rack, boxes, and other miscellaneous items; Gregory Barr Grill, chairs, mattresses, shelving, and other miscellaneous items"
    ],
    "notice-251": [
        "The undersigned will sell at public sale by competitive bidding the personal property of: Garrett Siscel, Taylor Dixion, Misty Marmolejo and Kevin Crossman Property to be sold including but not limited to: household items, furniture, appliances, clothes &contents. Auctioneer Company: WWW.storagetreasures.comThe sale ends at 10:00 am 02/06/2024. Goods must be paid for by cash & removed at completion of sale. Sale is subject to cancellation in the event of settlement between owner & obligated party. Self Storage of Vacaville, 201 Leisure Town Rd. Vacaville, CA 95687 (707)514-7777"
    ],
    "notice-252": [
        "Property of the following person(s) will be sold for cash only, at Public Auction on Thursday February 8, 2024 at 1:00 p.m. at Kelseyville TnT Storage, 3562 Big Valley Rd., Kelseyville, CA.: Unit #13 - Greehling,Brandon-Household goods,furniture Unit #315- Peters,James-Household goods,furniture,garden equipment,automotive Unit #330- Torres, Andrew- Gardening equipment, tools Unit #339- Holstine, Britany- Household goods, furniture Unit #357-Ford, Anna- Furniture,Household goods Sale subject to cancellation in the event of settlement between Owner/Agent and obligated parties. TnT Storage 707-279-9090 Ratel Investments Bond # 70405590"
    ],
    "notice-253": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 9:00 AM on February 12, 2024 at Derrel's Mini Storage located at 100 E. Sierra Ave, Fresno, County of Fresno,State of California. Bids to be placed on storagetreasures.comBrandy McintyreMaria WigginsMiguel GuevaraDonald Woods* Slaters 50/5001/29/2024, 02/05/2024"
    ],
    "notice-254": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 11:00 AM on February 15 2024 at Derrel's Mini Storage located at 3170 Shaw Ave, Clovis, County of Fresno, State of California. Bids to be placed on storagetreasures.com01/29/2024, 02/05/2024"
    ],
    "notice-255": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 10:00 AM on February 16, 2024 at Derrel's Mini Storage located at 3330 E. Tulare St, Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.comNancy TorresCarmen ArreolaSamantha Rose ElieSarah Virginia RodriguezErnesto GarciaMichael Wayne SandovalLeonardo Rafael RiosRicardo Alfonso Ramirez AraujoCarmen ArreolaGilberto BaezAsia Marie ChapmanRegina Marie Williams01/29/2024, 02/05/2024"
    ],
    "notice-256": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 10:00 AM on February 12, 2024 at Derrel's Mini Storage located at 2581 N. Willow Ave, Clovis, County of Fresno, State of California. Bids to be placed on storagetreasures.comJason KeefMarcus Ajay AyalaMarcus Ajay AyalaJosue Murillo01/29/2024, 02/05/2024"
    ],
    "notice-257": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 9:00 AM on February 16 2024 at Derrel's Mini Storage located at 3275 W. Ashlan Ave, Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.comDelores PerezMary KruschenStephanie BarrettCarlos Molina JrBruce FranklinMarcia FlemingNathaniel Gallardo01/29/2024, 02/05/2024"
    ],
    "notice-258": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 09:00 AM on February 5, 2024 at Derrel's Mini Storage located at 1385 N. Maple Ave, Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.com Teresa Patricia Gomez DominguezSay VongsengchanhThomas BattlesPaulita RamirezDiana ReyesJeannette CoxJessica PortilloJacquelyn Renee Munoz01/22/2024, 01/29/2024"
    ],
    "notice-259": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 11:00 AM on February 12 2024 at Derrel's Mini Storage located at 4660 E. Dakota Ave, Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.comJerman DuarteAbel ZamoraMichael Anthony BrownChelina Galindo CovarrubiasMichelle Zeletta GoodeNazinah B BilalJosefina Casillas01/29/2024, 02/05/2024"
    ],
    "notice-260": [
        "Notice of Self Storage Sale Please take notice Southgate Mini Storage located at 1025 Golden Gate Dr., Napa, CA 94558 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur at the facility on 2/7/2024 at 2:00 PM. David Auerbach (3 units); James Day; Melvin Stout (10 units); William Wieting. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. 192438 Pub Jan 22, 29, 2024 2ti."
    ],
    "notice-261": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 10:00 AM on February 5, 2024 at Derrel's Mini Storage located at 1441 N. Clovis Ave, Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.comRuby Eudosia Garcia PalmerinJamal OguinnPatricia CorralesPatricia CorralesRebecca Ann HerreraOfelia KeenoRandy LamasDenise VerdugoInfinity ChaconAlice MclaurinPaul Sexton* Nical Solutions IncPorsha EllsberryAndria LariosJaime LariosStacy MilesPhillip Nathaniel ColeRobert Banks01/22/2024, 01/29/2024"
    ],
    "notice-262": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 11:00 AM on February 8 2024 at Derrel's Mini Storage located at 1800 W. Belmont Ave, Fresno, County of Fresno, State of California.Alfonso LLAMASDarlene Rose GarciaRichard Wallace AlisonMelody BowlanLavern GearinMario HerreraRoberto Montes TapiaRoberto Montes TapiaRoberto Montes TapiaOlga Lydia DiazShontel GainesNicole Linda NevarezMarcella MoralesRhonda HempsteadFrank VarelaDaniel John Ramos IIIBernardino Valdivia JrEstevan Rodriguez Hernandez JrMonica Marie Soliz01/22/2024, 01/29/2024"
    ],
    "notice-263": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 09:00 AM on February 8, 2024 at Derrel's Mini Storage located at 3245 S. Chestnut Ave, Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.comBettrina Lynn KousolG & G Transport Llc .Kristal Destiny RamirezFelicia Crystal MesaArminda J VaughanVictoria Coleta Lima01/22/2024, 01/29/2024"
    ],
    "notice-264": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 09:00 AM on February 15, 2024 at Derrel's Mini Storage located at 1191 E. Nees Ave, Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.com* Glenn Wilson Atty At LawHannah De La PenaAlain GeromeKaren RiveraAbigail MartinesDustin EllisonManuel SanchezAndrew AvalosMarc DysonDevina Alpha FallsJonathan OlfordVictoria RiddleFrank Iii HinojosVictoria RiddleMark Randall Ii CulyNicholas PalacioFrank Hinojos01/29/2024, 02/05/2024"
    ],
    "notice-265": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 10:00 AM on February 15, 2024 at Derrel's Mini Storage located at 2530 S. Clovis Ave., Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.comAudrey Real TorresEdgar Castro EvansJohana VegaAnnette AlvaradoMatthew Jarmaine Jr PiggFrancisco CavazosMartin Lopez01/29/2024, 02/05/2024"
    ],
    "notice-266": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 11:00 AM on February 12 2024 at Derrel's Mini Storage located at 4660 E. Dakota Ave, Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.comJerman DuarteAbel ZamoraMichael Anthony BrownChelina Galindo CovarrubiasMichelle Zeletta GoodeNazinah B BilalJosefina Casillas01/29/2024, 02/05/2024"
    ],
    "notice-267": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 10:00 AM on February 8, 2024 at Derrel's Mini Storage located at 1080 Sunnyside Ave, Clovis, County of Fresno, State of California. Bids to be placed on storagetreasures.comGay RicksDavid GoodladDoug ScholzCourtney De'Shan Murphy01/22/2024, 01/29/2024"
    ],
    "notice-268": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 11:00 AM on February 5, 2024 at Derrel's Mini Storage located at 4441 W. Herndon Ave, Fresno, County of Fresno, State of California. Bids to be placed on storagetreasures.comNicole TurnipseedJanice Quetta SaleemGregory BarlettaSimonette Asistin TugasMichael Conroy Jr JohnsonTheresa Marie DunawayClinton Bernard LewisMargarita CanabaMarlaina Michelle RecekNicole Turnipseed01/22/2024, 01/29/2024"
    ],
    "notice-269": [
        "NOTICE OF PUBLIC SALEBusiness & Professionals Code S21700Notice is hereby given that a public lien sale of the following described personal property will be held at the hour of 11:00 AM on February 16, 2024 at Derrel's Mini Storage located at 491 Herndon Ave, Clovis, County of Fresno, State of California. Bids to be placed on storagetreasures.comEdgar TanassiLynn VisitacionStephanie HahnTomeia VernersAshley Stella LopezJennifer Marie GinsburgJoan LambornMitchell F Jelen SrChrystan CavanaughPeggy DunnDouglas BagshawDjin Min GunaraMiguel Rubio01/29/2024, 02/05/2024"
    ],
    "notice-270": [
        "NOTICE INVITING BIDS TITLE OF WORK: Moss Landing Aboveground Fuel Storage Tank Installation Project SUMMARY OF WORK: Monterey One Water (M1W) is requesting bids for performing services for the installation of an aboveground diesel storage tank at the Moss Landing Pump Station. Services will include purchase and installation of a new aboveground storage tank, installation of new pad and leak containment sump, and all electrical and plumbing for connection to existing generator and fuel management system. RECEIPT AND OPENING OF BIDS: M1W will receive proposals by electronic submission only, until 2:00 PM, February 28, 2024. Bids will be opened and read aloud at that time and date through a web-based conference call. Link to be provided by emailing: Jennifer@my1water.org. SECURING BID DOCUMENTS: All bid documents will be available for download via M1W's online bidding system. To access the contract documents, bidders must contact Jennifer Gonzalez at jennifer@my1water.org for a free account to access Procore. PRE-BID MEETING: A pre-bid meeting will be held at 10:00 AM. local time, January 31, 2024, at the Monterey One Water's Moss Landing Pump Station at 8147 Moss Landing Road, Moss Landing. Signed: Paul A. Sciuto M1W General Manager Publish Dates: 1/23/2024 & 1/29/2024"
    ],
    "notice-271": [],
    "notice-272": [],
    "notice-273": [
        "Notice of Self Storage Sale  Please take notice The Eastlake Self Storage located at 2351 Boswell Rd., Chula Vista, CA 91914 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur at the facility on 2/13/2024 at 9:00AM. Jacob Robare unit #BA039; Donald Abshier unit #BA091; David Corretjer unit #BB008; Andre Maglalang/SOUTH BAY BULLS unit #BB078; Juan Perez unit #CB013; Nina Camacho-Guagliata unit #CB040; Kyle Lopez unit #D2162; Melvin Burton unit #D2163; Bryant Cullins unit #D2267; Louann Williams unit #D2269; Laurie Corbin-Gregg unit #D2389. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-274": [],
    "notice-275": [
        "Notice of Self Storage Sale Please take notice Associated Storage Miramar located at 9434 Kearny Mesa Rd, San Diego, CA 92126 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur at the storage facility on 2/14/2024 at 12:30PM. Claudette Clark unit #B040; Dante H Spandow unit #D005; Daniel Gilliam unit #D008; Roger Krueger unit #F049; John Morrison unit #F059; Henry Alejandro Ros Lopez unit #G055; Taelor Shull unit #H029; Steve Kook unit #H060; Obilyn Mowry unit #H064; Jocelyn Gilliam units #J006 & #S006; Cassie Misa unit #M026; Richard Ludwig units #N002 & #N013; David Rio units #N098, #N111, #N112 & #N113; Susan Adele Foote unit #P074; Victor Aguon unit #R099; Tinh Hoang unit #T155; James Vitale unit #U024. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-276": [
        "Five Star Mini Storage 58/21 Clark Road Paradise, Ca. 95969 (530) 876-9999 NOTICE OF LIEN SALE NOTICE OF SALE OF PERSONAL PROPERTY Pursuant to the California Self-Storage Facility Act (B&P code 21707-et. sec) The undersigned will sell the contents of Unit No. #140 Barnett, Daniel #510 Hail, Erica #262 Barchus, Kerry #523 Thompson, Ruth #109 Enlow, Gina #542 Glass, Barb To the highest bidder starting on Febuary 12th, 2023 * Tenant must pay in full day before by 5 PM to stop sale! Beginning at 9:30 A.M. Sale to be held on line at www.austinsonlineauction.com Signed : Eadrie Broyles Manager"
    ],
    "notice-277": [
        "Avalon Storage 8645 Airport Rd. Redding, CA 96002 530-221-1321   Notice is hereby given that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to Sections 21700-21716 of the Business & Professions Code, Sections 2328 of the UCC, Section 535 of the Penal Code and provisions of the Civil Code.   Avalon Storage will be holding an on-line auction listed with storageauctions.com. Competitive bidding will begin on January 12, 2024, ending January 25, 2024, at 12:00pm. The property being sold is located at Avalon Storage, 8645 Airport Rd, Redding, CA 96002 County of Shasta, State of California, the following:   Belongings of: Eddie Sosa Unit 611   Sale subject to cancellation in the event of settlement between owner and obligated party. Jan. 14, 28, 2024 9735901"
    ],
    "notice-278": [],
    "notice-279": [
        "Notice of Self Storage Sale﻿Please take notice Butterfield Self Storage located at 955 Jarvis Dr., Morgan Hill CA 95037 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.bid13.com on 2/12/2024 at 9:30AM. Troy Robinson; Nathan Woodward. This sale may be withdrawn at any time without notice. Certain terms and conditions apply.MN# 0006803959 Jan 27 and Feb 3, 2024"
    ],
    "notice-280": [
        "Extra Space Storage, on behalf of itself or its affiliates, Life Storage or Storage Express, will hold a public auction to satisfy Extra Space's lien, by selling personal property belonging to those individuals listed below at the location indicated. 3480 Tennessee St, Vallejo, CA 94591, February 7th, 2024, at 9:30am Ayumi Angel Mosley, Daniel Hernandez, Yesenia Valencia, Ema Pearce, Arian Kucere, Maurice Eric Browder, Joseph Zabala, Loretta Sullivan, Charles Lynch, Alberto Padilla, Deltrice Thorner 4311 Sonoma Blvd, Vallejo, CA 94589, February 7th, 2024, at 9:30am Cornelia burns The auction will be listed and advertised on www.storagetreasures.com. Purchases must be made with cash only and paid at the above referenced facility in order to complete the transaction. Extra Space Storage may refuse any bid and may rescind any purchase up until the winning bidder takes possession of the personal property."
    ],
    "notice-281": [
        "Notice of Lien Sale C&M Self Storage, 297 Brush ST, Ukiah, CA 95482, will cause to be sold to the general public online, personal property, beginning 01/29/2024 and will end on 02/07/2024. Online auction hosted by www.storagetreasures.com Tenant name: Jon Chambers"
    ],
    "notice-282": [
        "Notice of Public Auction As defined by the California Self Storage Facilities Act, Business and Professions Code sections 21700 - 21716. American Self Storage LLC. Auction Start Date 02/04/2024. Auction End Date 02/14/2024 at 8:00 AM. Auction will be conducted entirely online at http://www.storagetreasures.com Auctioneer: Storage-Treasures LLC. Phone: (480) 397-6503 Property being sold: All units: Miscellaneous household goods G-28 Robert Miguel H-18 Connie Morrison I-29 Robert Miles Published: 01/21, 01/28/2024"
    ],
    "notice-283": [
        "LIEN SALENotice is hereby given that a public lien sale of the following describes personal property will be held online at www.storageauctions.comAuction Date: Monday February 05, 2024 at 9:00 amLocation: Old Barn Self Storage, 175 Spring Hill Drive, Grass Valley, CA, 95945The contents of the rental storage units all containing household goods and belonging to the following persons will be sold:Phil KrausseVanessa PlaugherBrooke MayfieldKendra ThibodeauWilliam FraserThis notice is given in accordance with the provisions of Section 21700 et seq of the Business & Professions Code of the State of CaliforniaPublished: January 20, 27, 2024"
    ],
    "notice-284": [
        "Keep-It Self Storage(formerly AirPark Mini Storage)Notice of Lein SaleUNIT # 758DUPONT, ANTHONYUNIT # 762SOUZA, PAULUNIT # 803ROMANO CHICLIFFUNIT # K2B64ALVARADO, VINCEUNIT # K2D60PANKEY, CHELSEAUNIT # K2D59REED, PHILIPUNIT # K2C65, K2D65 & K2D76MILLS, JAYUNIT # K2D29WHITEDONEY, TIFFANYUNIT # 511LALLY, KEIRAUNIT # 858ABRAMS, HOLLYUNIT # 410WRIGHT, GARFIELDUNIT # K2B52LEE, ELLAAuctions will be held MONDAY February 12th at 9AMon StorageTreasures.comKeep-It Self Storage12906 Loma Rica DriveGrass Valley, CA 954959:00 AM to 5:00 PM, MON-FRI(530) 272-3391Published: January 27, February 3, 2024"
    ],
    "notice-285": [],
    "notice-286": [],
    "notice-287": [
        "NOTICE OF PUBLIC SALE: Self-storage Cube contents of the following customers containing household and other goods will be sold for cash by CubeSmart Management, LLC 1680 W Redlands Blvd Redlands, CA 92373 to satisfy a lien on February 15, 2024 at approx. 10:00 AM at www.storagetreasures.com: Esmeralda Howard, Rafael Roy Padilla, Ifeanyi Ugochuku, Darren S Whitty, Eduardo Angeles, Mya Roberts Redlands Daily FactsPublished: 1/26/24"
    ],
    "notice-288": [],
    "notice-289": [
        "NOTICE OF PUBLIC SALE Self-storage Cube contents of the following customers containing household and other goods will be sold for cash by CubeSmart Management, LLC 40410 California Oaks Rd, Murrieta, CA 92562 to satisfy a lien on February 14th, 2024, at approx. 1:30pm at www.storagetreasures.com: Brittany Bowens, Chantel Schock, Paul Henderson, Paul Henderson, GRACE SMITH, Dennel Sarsoza, Michelle Tusler, Leslie Coe"
    ],
    "notice-290": [],
    "notice-291": [],
    "notice-292": [
        "NOTICE OF PUBLIC SALE OF PERSONAL PROPERTY Pursuant to the California Self-Service Storage Facility Act, (B & P Code 21700 et. Seq.) and the judgement entered on January 16, 2024 in the action entitled \"Rhoads Property Holdings, LLC, dba CSI Mini Storage vs. Sara M. Hauge\", et al, Case No. 22CV021257 (Copy Attached), the undersigned will sell at Public Auction on Thursday, February 15, 2024 at 1:00 pm the personal property stored by Sara M. Hauge in Storage Unit Numbers: 104, 51A, 63B and 69F, which are located at: Rhoads Property Holdings, LLC, dba CSI Mini Storage 51 W. Hornet Ave., Alameda, CA. 94501 Ph: (510) 748-1851 The auction will be conducted by Nor Cal Storage, Auctions, Inc. Bond No. 7900468597 Ph. (916) 604-9695 ATS# 6804679 Jan. 25, Feb. 1, 2024"
    ],
    "notice-293": [],
    "notice-294": []
}