{
  "source": "BBC News",
  "fetch_date": "2025-06-05T14:19:03.949125",
  "article_count": 35,
  "articles": [
    {
      "headline": "'We don't want them': Trump bans travel from 12 countries to the US",
      "summary": "The US president also announces restrictions on citizens from seven other countries.",
      "link": "https://www.bbc.com/news/live/cvgqwyxxpzgt",
      "image_url": "https://ichef.bbci.co.uk/ace/standard/1536/cpsprodpb/5d4f/live/8b0a5030-41cf-11f0-b6e6-4ddb91039da1.jpg.webp",
      "date": "",
      "category": "",
      "full_text": "The travel ban announcement comes after a US judge ruled to temporarily halt deportation proceedings against the family of a man accused of the Colorado attack on Sunday. As a reminder, as he announced the travel ban Donald Trump said the attack \"underscored the extreme dangers\" posed by foreign nationals who had not been \"properly vetted\". The man accused of carrying out the attack, Mohamed Sabry Soliman, has been identified as an Egyptian national, but Egypt is not included on the list of banned countries. Officials say his family, who are not charged in the attack, are Egyptian citizens. US District Judge Gordon Gallagher, a Biden appointee, ordered deportation proceedings to be halted, a day after the White House said it had six one-way tickets to deport the wife and five children from the US. Lawyers for the defence had accused the government of unfairly targeting the family, who say they were unaware of Soliman's violent plans and have co-operated with investigators."
    },
    {
      "headline": "'I was pushed across the India border into Bangladesh at gunpoint'",
      "summary": "The BBC met people in India's Assam who say they were accused of being illegal immigrants and forced across the border.",
      "link": "https://www.bbc.com/news/articles/cqj78v79z9do",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/6d9d/live/d48985c0-404c-11f0-95b4-19782fc5d14e.jpg.webp",
      "date": "11 hrs ago",
      "category": "Asia",
      "full_text": "Shona Banu still shudders when she thinks of the past few days. The 58-year-old, a resident of Barpeta district in India's north-eastern state of Assam, says that she was called to the local police station on 25 May and later taken to a point at the border with neighbouring Bangladesh. From there, she says, she and around 13 other people were forced to cross over to Bangladesh. She says she was not told why. But it was a scenario she had been dreading - Ms Banu says she has lived in Assam all her life but for the past few years, she has been desperately trying to prove that she is an Indian citizen and not an \"illegal immigrant\" from Bangladesh. \"They pushed me over at gunpoint. I spent two days without food or water in the middle of a field in knee-deep water teeming with mosquitoes and leeches,\" Ms Banu said, wiping away tears. After those two days in no man's land - between India and Bangladesh - she says she was taken to what appeared to be an old prison on the Bangladeshi side. After two days there, she and a few others - she is not sure if all of them were from the same group sent with her - were escorted by Bangladeshi officials across the border, where Indian officials allegedly met them and sent them home. It's not clear why Ms Banu was abruptly sent to Bangladesh and then brought back. But her case is among a spate of recent instances where officials in Assam have rounded up people declared foreigners by tribunals in the past - on suspicion of being \"illegal Bangladeshis\" - and sent them across the border. The BBC found at least six cases where people said their family members had been picked up, taken to border towns and just \"pushed across\". Officials from India's Border Security Force, the Assam police and the state government did not respond to questions from the BBC. Crackdowns on alleged illegal immigrants from Bangladesh are not new in India - the countries are divided by a 4,096km (2,545 miles) long porous border which can make it relatively easy to cross over, even though many of the sensitive areas are heavily guarded. But it's still rare, lawyers working on these cases say, for people to be picked up from their homes abruptly and forced into another country without due process. These efforts seem to have intensified over the past few weeks. The Indian government has not officially said how many people were sent across in the latest exercise. But top sources in the Bangladesh administration claim that India \"illegally pushed in\" more than 1,200 people into the country in May alone, not just from Assam but also other states. Out of this, they said on condition of anonymity, Bangladesh identified 100 people as Indian citizens and sent them back. In a statement, the Border Guard Bangladesh said it had increased patrolling along the border to curb these attempts. India has not commented on these allegations. While media reports indicate that the recent crackdown includes Rohingya Muslims living in other states too, the situation is particularly tense and complex in Assam, where issues of citizenship and ethnic identity have long dominated politics. The state, which shares a nearly 300km-long border with Muslim-majority Bangladesh, has seen waves of migration from the neighbouring country as people moved in search of opportunities or fled religious persecution. This has sparked the anxieties of Assamese people, many of whom fear this is bringing in demographic change and taking away resources from locals. The Bharatiya Janata Party - in power in Assam and nationally - has repeatedly promised to end the problem of illegal immigration, making the state's National Register of Citizens (NRC) a priority in recent years. The register is a list of people who can prove they came to Assam by 24 March 1971, the day before neighbouring Bangladesh declared independence from Pakistan. The list went through several iterations, with people whose names were missing given chances to prove their Indian citizenship by showing official documents to quasi-judicial forums called Foreigners Tribunals. After a chaotic process, the final draft published in 2019 excluded nearly two million residents of Assam - many of them were put in detention camps while others have appealed in higher courts against their exclusion. Ms Banu said her case is pending in the Supreme Court but that authorities still forced her to leave. The BBC heard similar stories from at least six others in Assam - all Muslims - who say their family members were sent to Bangladesh around the same time as Ms Banu, despite having necessary documents and living in India for generations. At least four of them have now come back home, with no answers still about why they were picked up. A third of Assam's 32 million residents are Muslims and many of them are descendants of immigrants who settled there during British rule. Maleka Khatun, a 67-year-old from Assam's Barpeta who is still in Bangladesh, says she has temporarily been given shelter by a local family. \"I have no-one here,\" she laments. Her family has managed to speak to her but don't know if and when she can return. She lost her case in the foreigners' tribunal and in the state's high court and hadn't appealed in the Supreme Court. Days after the recent round of action began, Chief Minister Himanta Biswa Sarmacited a February Supreme Court directionwhich ordered the government to start deportation proceedings for people who had been \"declared foreigners\" but were still held in detention centres. \"The people who are declared foreigners but haven't even appealed in court, we are pushing them back,\" Sarma said. He also claimed that people with pending court appeals were not being \"troubled\". But Abdur Razzaque Bhuyan, a lawyer working on many citizenship cases in Assam, alleged that in many of the recent instances, due process - which would, among other things, require India and Bangladesh to cooperate on the action - was not followed. \"What is happening is a wilful and deliberate misinterpretation of the court order,\" he said. Mr Bhuyan recently filed a petition on behalf of a student organisation seeking the Supreme Court's intervention in stopping what they said was a \"forceful and illegal pushback policy\" but was asked to first approach the Assam high court. In Morigaon, around 167km from Barpeta, Reeta Khanum sat near a table which had a pile of papers on it. Her husband Khairul Islam, a 51-year-old school teacher, was in the same group as Ms Banu that was allegedly picked up by authorities. A tribunal had declared him a foreigner in 2016, after which he spent two years in a detention centre before being released. Like Ms Banu, his case is also being heard in the Supreme Court. \"Every document is proof that my husband is Indian,\" Ms Khanum said, leafing through what she said was Mr Islam's high school graduation certificate and some land records. \"But that wasn't enough to prove his nationality to authorities.\" She says her husband, his father and grandfather were all born in India. But on 23 May, she says that policemen arrived at their home and took Mr Islam away without any explanation. It was only a few days later - when a viral video surfaced of a Bangladeshi journalist interviewing Mr Islam in no man's land - that the family learnt where he was. Like Ms Banu, Mr Islam has now been sent back to India. While his family confirmed his return, the police told the BBC they had \"no information\" about his arrival. Sanjima Begum says she is sure her father was declared a foreigner due to a case of mistaken identity - he was also taken on the same night as Mr Islam. \"My father's name is Abdul Latif, my grandfather was Abdul Subhan. The notice that came [years ago, from the foreigners' tribunal] said Abdul Latif, son of Shukur Ali. That's not my grandfather, I don't even know him,\" Ms Begum said, adding that she had all the necessary documents to prove her father's citizenship. The family has now heard that Mr Latif is back in Assam, but he hasn't reached home yet. While some of these people are back home now, they fear they might be picked up again abruptly. \"We are not playthings,\" Ms Begum said. \"These are human beings, you can't toss them around as per your whims.\" Additional reporting by Aamir Peerzada and Pritam Roy"
    },
    {
      "headline": "Putin will seek revenge for Ukraine drone attack, warns Trump",
      "summary": "Trump says a call with the Russian president was a \"good conversation\" but would not lead to \"immediate peace\".",
      "link": "https://www.bbc.com/news/articles/cx2r108l785o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/4b75/live/7d2896c0-4170-11f0-835b-310c7b938e84.png.webp",
      "date": "13 hrs ago",
      "category": "World",
      "full_text": "Vladimir Putin has said he will have to respond to Ukraine's major drone attack on Russian airbases, US President Donald Trump has warned. Speaking after a phone call with the Russian president, Trump said: \"President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields.\" Russian officials declined to confirm this on Wednesday night, but Moscow had earlier said that military options were \"on the table\" for its response. Trump warned in a social media post that the phone call, which lasted more than an hour, would not \"lead to immediate peace\" between Russia and Ukraine. Russia's RIA Novosti, a state-owned news agency, said Putin told Trump that Ukraine has tried to \"disrupt\" the negotiations and that the government in Kyiv has \"essentially turned into a terrorist organisation\". The two also \"exchanged views on the prospects for restoring cooperation between the countries, which has enormous potential,\" it said. The conversation between the two leaders marks the first since Ukrainelaunched a surprise attack using smuggled drones to strike Russian airbaseson 1 June, targeting what it said were nuclear-capable long-range bombers. Trump told Putin in the call that the US was not warned in advance of the attack, Russian presidential aide Yury Ushakov said. Ukraine's Minister of Strategic Industries Yuriy Sak told Radio 4's World Tonight programme his country had hoped the US would respond to the \"incessant Russian missile and drone attacks\" with \"more sanctions and with more pressure\". Last week, Trump appeared to set a two-week deadline for Putin, threatening to change how the US is responding to Russia if he believed Putin was still \"tapping\" him along on peace efforts in Ukraine. The comment was one of a string of critical remarks by Trump, who on 26 May said that Putin had gone \"absolutely crazy\" and was \"playing with fire\" afterRussia escalated drone and missile attacks on cities in Ukraine, killing dozens of civilians. Trump made no mention of a deadline or his previous remarks in Wednesday's post on his Truth Social platform. In a post on X, Ukrainian President Volodymyr Zelensky talked about the scale Russian attacks on his country since Moscow's full-scale invasion in 2022. \"Many have spoken with Russia at various levels. But none of these talks have brought a reliable peace, or even stopped the war,\" Zelensky wrote. \"If the world reacts weakly to Putin's threats, he interprets it as a readiness to turn a blind eye to his actions,\" he added. On Wednesday, a delegation of Ukrainian officials including Deputy Prime Minister Yulia Svyrydenko and Presidential Office head Andriy Yermak were set to meet with US senators in Washington to discuss arms purchases and efforts to stop the fighting. In a social media post, Yermak said that the delegation planned to discuss \"defense support and the situation on the battlefield\", sanctions against Russia and a previously signed reconstruction investment fund. The post also comes just days after a second round of direct peace talks in Istanbul between the warring sides ended without a major breakthrough, although they agreed to swap more prisoners of war. Ukrainian negotiators said Russia rejected an \"unconditional ceasefire\" - a key demand of Kyiv and its Western allies including the US. The Russian team said they had proposed multi-day ceasefires in \"certain areas\" of the frontline in Ukraine, although they gave no further details. Trump has previously - and repeatedly - said he believes the two sides are making progress, despite ongoing fighting on the frontline and aerial attacks carried out in both Russia and Ukraine. Separately on Wednesday, Putin also had a call with the US-born Pope Leo XIV. The Vatican confirmed that \"particular attention\" was paid to peace in the Ukraine war. In Putin's call with Trump, the two leaders also discussed Iran. Trump said he believed the two \"were in agreement\" that \"Iran cannot have a nuclear weapon\". The US reportedly proposed Iran halt all production of enriched uranium - which can be used to make reactor fuel but also nuclear weapons - and instead rely on a regional consortium for supplies. Iran has not yet responded to the plan presented at talks last Saturday. According to Trump, Putin \"suggested that he will participate in discussions with Iran and that he could, perhaps, be helpful in getting this brought to a rapid conclusion\". \"It is my opinion that Iran has been slow walking their decision on this very important matter,\" Trump wrote. \"We will need a definitive answer in a very short period of time.\" Iran's Supreme Leader Ayatollah Ali Khamanei has criticised the US proposal and said it will not stop enriching uranium."
    },
    {
      "headline": "England include Bethell and Overton in first India Test squad",
      "summary": "England recall Jacob Bethell for the first Test against India and respond to a lengthy pace-bowling injury list by naming Jamie Overton in the squad.",
      "link": "https://www.bbc.com/sport/cricket/articles/c4gk7j6jz47o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/1fc8/live/dbcc1610-4180-11f0-b6e6-4ddb91039da1.png.webp",
      "date": "48 mins ago",
      "category": "Cricket",
      "full_text": "Jacob Bethell (left) has won three previous Test caps, Jamie Overton has one England have recalled Jacob Bethell for the first Test against India and responded to a lengthy pace-bowling injury list by naming Jamie Overton in the squad. Bethell, 21, makes an immediate return after not featuring inthe victory over Zimbabwebecause of Indian Premier League (IPL) commitments, but could miss out on a place in the final XI. Fast bowler Gus Atkinson is likely to be absent for the first two Tests of the five-match series with the hamstring injury he suffered against Zimbabwe, and joins Mark Wood, Jofra Archer and Olly Stone on the sidelines. Chris Woakes and Brydon Carse are back, while Surrey's Overton is in a Test squad for the first time since the tour of Pakistan in 2022. Josh Tongue and Sam Cook are also in, but there is no place for Matthew Potts in the group of five frontline seamers for the series opener at Headingley on 20 June. ——————————————————— England squad for first Test against India:Ben Stokes (captain), Zak Crawley, Ben Duckett, Ollie Pope, Joe Root, Harry Brook, Jacob Bethell, Jamie Smith (wicketkeeper), Chris Woakes, Jamie Overton, Brydon Carse, Sam Cook, Josh Tongue, Shoaib Bashir. ——————————————————— Overton's only previous Test came at the same ground in 2022, when he made 97 against New Zealand. The 31-year-old is currently recovering from a broken little fingersustained in the first one-day internationalagainst West Indies last week. Woakes, Carse and Tongue are the most likely trio to make the XI in Leeds. Despite the absentees, all three would have reasonable claims to be in England's first-choice team even if all the seamers were fit. England's fast-bowling reserves have been further depleted by injuries to youngsters Josh Hull and Sonny Baker, who have heel and ankle problems respectively. Both have pulled out of England Lions' second four-day game against India A, due to start on Friday. Woakes and Tongue will feature for the Lions, but Test captain Ben Stokes, who considered playing as he recovers from hamstring surgery, has opted out. How Bazball's baby showed merit in England's thinking 10cc star sees first match - and does love cricket From prodigy to leader: Can Shubman Gill shape the future of Indian Test cricket? England were hopeful Atkinsonwould be available for the beginning of the India series, while Archer's long route back to Test cricket has been delayed by a thumb injury that prevented him playing for the Lions. His next target would be to play for Sussex in the County Championship before the end of this month. Warwickshire's Bethell impressed in three Tests in New Zealand before Christmas, making half-centuries in the second innings of each, batting at number three. When he missed the Test against Zimbabwe, England were spared the decision on whether to include him in their team and reverted back to their established top seven. In Bethell's absence, Ollie Pope made a sublime century in his regular spot of number three. Whereas Stokes appeared to suggest before the Zimbabwe TestBethell would come straight back into the XI for the India series,he later clarified that the left-hander would merely return to the squad. Stokes also claimed his comments were\"twisted to suit an agenda\". Since then, Bethell has further impressed in England's one-day team, making a sparkling 82 in the first ODI against West Indies. Stokes at least seemed to confirm that England's choice would be between Bethell and Pope, rather than opener Zak Crawley or spinner Shoaib Bashir being candidates to be left out. Get cricket news sent straight to your phone"
    },
    {
      "headline": "What we know about Trump's latest travel ban",
      "summary": "President Trump has signed a proclamation banning travel to the US from nationals of 12 countries.",
      "link": "https://www.bbc.com/news/articles/cx271g270v7o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/edeb/live/c9371e70-41c9-11f0-bace-e1270fc31f5e.jpg.webp",
      "date": "3 hrs ago",
      "category": "US & Canada",
      "full_text": "Donald Trump has signed a ban on travel to the US from 12 countries citing national security risks, according to the White House. There are also seven additional countries whose nationals will face a partial travel restrictions. The US president said the list could be revised if \"material improvements\" were made and additional countries could be added as \"threats emerge around the world\". This is the second time he has ordered a ban on travel from certain countries. He signed a similar order in 2017, during his first term in office. Trump has signed a proclamation banning travel to the US from nationals of 12 countries: There are an additional seven countries whose nationals face partial travel restrictions: The ban takes effect on Monday at 12:01 (05:01 BST), a cushion that avoids the chaos that unfolded at airports nationwide when a similar measure took effect with virtually no notice eight years ago. No end date has been provided; the order calls for periodic review. The White House said these \"common sense restrictions\" would \"protect Americans from dangerous foreign actors\". In a video posted to his Truth Social website, Trump said therecent alleged terror attack in Boulder, Colorado\"underscored the extreme dangers\" posed by foreign nationals who had not been \"properly vetted\". Twelve people were injured in Colorado on Sunday when a man attacked a group gathering in support of Israeli hostages, throwing two incendiary devices and using a makeshift flamethrower. The man accused of carrying out the attack has been identified as an Egyptian national, but Egypt is not included on the list of banned countries. Trump has close ties with Egyptian President Abdel Fattah al-Sisi, who has in the past been described by the US president as his \"favourite dictator\". There are a number of people from affected countries who may still be able to enter the US due to the following exemptions: In addition, the Secretary of State may grant exemptions to individuals on a \"case-by-case\" basis, if \"the individual would serve a United States national interest\". Trump's latest order, which is expected to face legal challenges, drew a swift response, at home and abroad. Somalia promised to work with the United States to address any security issues. In a statement, Somali ambassador to the US, Dahir Hassan Abdi, said his country \"values its longstanding relationship\" with America. Venezuela's Interior Minister Diosdado Cabello warned that \"being in the United States is a great risk for anyone, not just for Venezuelans\". Democrats were quick to condemn the move. \"This ban, expanded from Trump's Muslim ban in his first term, will only further isolate us on the world stage,\" Pramila Jayapal, a Democrat congresswoman from Washington, says in a social media post. Another Democrat, congressman Don Beyer, says Trump \"betrayed\" the ideals of the US' founders. Human rights groups have also criticised the ban. Amnesty International USA described it as \"discriminatory, racist, and downright cruel\", while the US-based Human Rights First, called it \"yet another anti-immigrant and punitive action taken\" by the president. Trump ordered his original travel ban during his first term in the White House in 2017. It featured some of the same countries as his latest order, including Iran, Libya and Somalia. Critics called it a \"Muslim ban\" as the seven countries initially listed were Muslim majority, and it was immediately challenged in courts across the US. The White House revised the policy, ultimately adding two non-Muslim majority countries, North Korea and Venezuela. It was upheld by the Supreme Court in 2018. President Joe Biden, who succeeded Trump, repealed the ban in 2021, calling it \"a stain on our national conscience.\" Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weeklyUS Politics Unspunnewsletter. Readers in the UK cansign up here. Those outside the UK cansign up here."
    },
    {
      "headline": "Three Maori MPs suspended over 'intimidating' haka",
      "summary": "\"We will never be silenced,\" says Hana-Rawhiti Maipi-Clarke, who started the protest dance.",
      "link": "https://www.bbc.com/news/articles/c5yg9k8x8pwo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/f433/live/a0a18ab0-41db-11f0-bace-e1270fc31f5e.png.webp",
      "date": "2 hrs ago",
      "category": "Asia",
      "full_text": "New Zealand's parliament has voted to suspend three Māori MPs for their protest haka during a sitting last year. Opposition MP Hana-Rawhiti Maipi-Clarke, who started the traditional dance after being asked if her party, Te Pāti Māori (Māori Party), supported a controversial bill, has received a seven-day ban. The party's co-leaders Rawiri Waititi and Debbie Ngarewa-Packer have been banned for 21 days. The bill that sparked the protest haka sought to redefine the country's founding treaty and has since been voted down. New Zealand has long been lauded for its attempts to uphold indigenous rights, but its relationship with the Māori community has deteriorated in recent years under the current conservative government. Last November, a video of the trio performing the haka - a chanting dance of defiance sometimes performed at sports events and graduation ceremonies in New Zealand - went viral and drew global attention. A parliamentary committee ruled last month that the act could have \"intimidated\" other lawmakers. Their suspensions are unprecedented. Before this, the longest ban for any New Zealand lawmaker lasted three days. Maipi-Clarke delivered an emotional speech on Thursday as the house debated the penalties. \"We will never be silenced, and we will never be lost,\" she said, holding back tears. \"Are our voices too loud for this house – is that why we are being punished?\" During the debate, New Zealand's Foreign Minister Winston Peters was asked to apologise after calling Te Pāti Māori a \"bunch of extremists\" and said the country \"has had enough of them\". The Māori party holds six of parliament's 123 seats. The Treaty Principles Bill, which sought to redefine New Zealand's founding treaty with Māori people, was voted down 112 votes to 11 in April - days after a government committee recommended that it should not proceed. Act, the right-wing party which tabled it, argued there is a need to legally define the principles of the Treaty of Waitangi - the 1840 pact between the British Crown and Māori leaders signed during New Zealand's colonisation - which it said resulted in the country being divided by race. Critics, however, said it was the Treaty Principles Bill which would have divided the country and led to the unravelling of much-needed support for many Māori. The proposed legislation sparked widespread outrage across the country and saw more than 40,000 people taking part in a protest outside parliament during its first reading in November last year."
    },
    {
      "headline": "What we know about Trump's latest travel ban",
      "summary": "President Trump has signed a proclamation banning travel to the US from nationals of 12 countries.",
      "link": "https://www.bbc.com/news/articles/cx271g270v7o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/edeb/live/c9371e70-41c9-11f0-bace-e1270fc31f5e.jpg.webp",
      "date": "3 hrs ago",
      "category": "US & Canada",
      "full_text": "Donald Trump has signed a ban on travel to the US from 12 countries citing national security risks, according to the White House. There are also seven additional countries whose nationals will face a partial travel restrictions. The US president said the list could be revised if \"material improvements\" were made and additional countries could be added as \"threats emerge around the world\". This is the second time he has ordered a ban on travel from certain countries. He signed a similar order in 2017, during his first term in office. Trump has signed a proclamation banning travel to the US from nationals of 12 countries: There are an additional seven countries whose nationals face partial travel restrictions: The ban takes effect on Monday at 12:01 (05:01 BST), a cushion that avoids the chaos that unfolded at airports nationwide when a similar measure took effect with virtually no notice eight years ago. No end date has been provided; the order calls for periodic review. The White House said these \"common sense restrictions\" would \"protect Americans from dangerous foreign actors\". In a video posted to his Truth Social website, Trump said therecent alleged terror attack in Boulder, Colorado\"underscored the extreme dangers\" posed by foreign nationals who had not been \"properly vetted\". Twelve people were injured in Colorado on Sunday when a man attacked a group gathering in support of Israeli hostages, throwing two incendiary devices and using a makeshift flamethrower. The man accused of carrying out the attack has been identified as an Egyptian national, but Egypt is not included on the list of banned countries. Trump has close ties with Egyptian President Abdel Fattah al-Sisi, who has in the past been described by the US president as his \"favourite dictator\". There are a number of people from affected countries who may still be able to enter the US due to the following exemptions: In addition, the Secretary of State may grant exemptions to individuals on a \"case-by-case\" basis, if \"the individual would serve a United States national interest\". Trump's latest order, which is expected to face legal challenges, drew a swift response, at home and abroad. Somalia promised to work with the United States to address any security issues. In a statement, Somali ambassador to the US, Dahir Hassan Abdi, said his country \"values its longstanding relationship\" with America. Venezuela's Interior Minister Diosdado Cabello warned that \"being in the United States is a great risk for anyone, not just for Venezuelans\". Democrats were quick to condemn the move. \"This ban, expanded from Trump's Muslim ban in his first term, will only further isolate us on the world stage,\" Pramila Jayapal, a Democrat congresswoman from Washington, says in a social media post. Another Democrat, congressman Don Beyer, says Trump \"betrayed\" the ideals of the US' founders. Human rights groups have also criticised the ban. Amnesty International USA described it as \"discriminatory, racist, and downright cruel\", while the US-based Human Rights First, called it \"yet another anti-immigrant and punitive action taken\" by the president. Trump ordered his original travel ban during his first term in the White House in 2017. It featured some of the same countries as his latest order, including Iran, Libya and Somalia. Critics called it a \"Muslim ban\" as the seven countries initially listed were Muslim majority, and it was immediately challenged in courts across the US. The White House revised the policy, ultimately adding two non-Muslim majority countries, North Korea and Venezuela. It was upheld by the Supreme Court in 2018. President Joe Biden, who succeeded Trump, repealed the ban in 2021, calling it \"a stain on our national conscience.\" Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weeklyUS Politics Unspunnewsletter. Readers in the UK cansign up here. Those outside the UK cansign up here."
    },
    {
      "headline": "Deadly mushroom cook weighed fatal dose on kitchen scales, says prosecutor",
      "summary": "Erin Patterson told the court she didn't believe the mushrooms in photos recovered from her phone were toxic.",
      "link": "https://www.bbc.com/news/articles/c93yxgyln5po",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/d4e0/live/73d337a0-41df-11f0-bace-e1270fc31f5e.jpg.webp",
      "date": "2 hrs ago",
      "category": "Australia",
      "full_text": "An Australian woman accused of murdering relatives with beef Wellington documented herself using kitchen scales to calculate a lethal dose of toxic mushrooms, prosecutors allege. Erin Patterson has pleaded not guilty to killing three people and attempting to murder another at her home in regional Victoria in July 2023. The 50-year-old says she never intended to hurt them and it was a tragic accident. Prosecutors on Thursday suggested photos found on her phone showing wild fungi being weighed depict her measuring the amount required to kill her guests. Ms Patterson told the court she had likely taken the photos in question but said she didn't believe the mushrooms in them were death caps. Ms Patterson's in-laws, Don and Gail Patterson, both 70, along with Gail's sister Heather Wilkinson, 66, all fell ill and died days after the lunch. Heather's husband, local pastor Ian Wilkinson, was also hospitalised but recovered after coming out of a weeks-long induced coma. The high-profile trial, which started almost six weeks ago, has already heard from more than 50 prosecution witnesses. Ms Patterson became the first defence witness to take the stand on Monday afternoon. Under cross-examination from the lead prosecutor, Ms Patterson admitted she had foraged for wild mushrooms in the three months before the July lunch, despite telling police and a health official that she hadn't. The court was also shown images, taken in late April 2023 and recovered from Ms Patterson's phone, which depicted mushrooms being weighed. Ms Patterson previously admitted she had repeatedly deleted electronic data in the days following the lunch because she feared that if officers found such pictures they would blame her for the guests' deaths. Pointing to earlier evidence from a fungi expert who said the mushrooms in the images were \"highly consistent\" with death caps, Dr Rogers alleged Ms Patterson had knowingly foraged them days before. She had seen a post on iNaturalist - a website for logging plant and animal sightings - and travelled to the Loch area ten days later on 28 April to pick the toxic fungi, Dr Rogers alleged. Ms Patterson said she couldn't recall if she went to the town that day, but denied she went there to find death cap mushrooms or that she had seen the iNaturalist post. \"I suggest that you were weighing these mushrooms so that you could calculate the weight required for... a fatal dose,\" Dr Rogers put to her. \"Disagree,\" Ms Patterson replied. The mother-of-two also spoke about putting powdered dried mushrooms into a range of foods like spaghetti, brownies and stew, which prosecutors allege was practice for the fatal lunch. Ms Patterson said this was not true, but rather an attempt to get \"extra vegetables into my kids' bodies\". Prosecutors repeatedly asked her, with different wording each time, whether she had knowingly used the same food dehydrator to prepare death cap mushrooms for the lunch. CCTV played at the trial shows Ms Patterson disposing of the appliance at a local dump. \"That's why you rushed out, the day after your release from [hospital], to get rid of the evidence,\" Dr Rogers said. \"No,\" replied Ms Patterson. Earlier, Ms Patterson's barrister asked her why she repeatedly lied to police about foraging mushrooms and having a food dehydrator. \"It was this stupid knee-jerk reaction to dig deeper and keep lying,\" she told the court. \"I was just scared, but I shouldn't have done it.\" Ms Patterson also repeated her claim that she never intentionally put the poisonous fungi in the meal. She said the mushrooms used in the beef Wellington may have accidentally included dried, foraged varieties that were kept in a container with store-bought ones. Ms Patterson was also quizzed on evidence given by other witnesses that she had asked her guests to come to the lunch to discuss health issues, namely a cancer diagnosis. She said she didn't outright say she had cancer, but still shouldn't have misled her relatives, saying she'd done so partly because their concern made her feel loved. \"I suggest that you never thought you would have to account for this lie about having cancer because you thought the lunch guests would die,\" Dr Rogers said. \"Your lie would never be found out.\" \"That's not true,\" Ms Patterson said. She will resume being cross examined on Friday. The trial, initially expected to take six weeks, is now expected to run for at least another fortnight, the judge has told the court."
    },
    {
      "headline": "Israeli military recovers two hostages' bodies in southern Gaza",
      "summary": "Israeli Americans Judi Weinstein Haggai, 70, and her husband Gadi, 72, were killed during the 7 October 2023 attacks.",
      "link": "https://www.bbc.com/news/articles/c989rl23zzno",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/14b0/live/c5bd5140-41da-11f0-802b-eb80266ed226.jpg.webp",
      "date": "2 hrs ago",
      "category": "World",
      "full_text": "Israeli forces have recovered the bodies of two Israeli Americans taken back to Gaza as hostages during the Hamas-led attack on southern Israel on 7 October 2023, the Israeli military says. Judi Weinstein Haggai, 70, who was also a Canadian citizen, and her husband Gadi Haggai, 72, were murdered by gunmen from the Mujahideen Brigades group when they attacked Kibbutz Nir Oz, a statement said. Their bodies were found in the southern Khan Younis area of Gaza overnight and brought back to Israel for forensic identification. There are now 56 hostages still being held by Hamas in Gaza, at least 20 of whom are believed to be alive. Israeli Prime Minister Benjamin Netanyahu said he and his wife sent their condolences to the families of Judi and Gadi Haggai. \"Our hearts grieve over this terrible loss. May their memories be blessed,\" he added. \"I would like to thank, and express appreciation to, the fighters and commanders for this determined and successful operation. We will not rest, nor will we be silent, until we return home all of our hostages – the living and the deceased.\" The couple's families recalled how they \"went out for a walk on the morning of that cursed Saturday and never returned\". \"We welcome the closure and their return to a proper burial at home, in Israel,\" a statement said. The Hostages and Missing Families Forum called on decision-makers to do everything they can to agree a new ceasefire deal with Hamas to secure the return of all the remaining hostages. \"There is no need to wait another 608 agonising days for this,\" a statement said. \"The mission can be completed as early as tomorrow morning. This is what the majority of the Israeli people want.\" Israel launched a military campaign in Gaza in response to the unprecedented cross-border attack almost 20 months ago, in which about 1,200 people were killed and 251 others were taken hostage. At least 54,607 people have been killed in Gaza since then, according to the territory's Hamas-run health ministry."
    },
    {
      "headline": "When joy turned to horror for Bengaluru fans celebrating team's IPL win",
      "summary": "Eleven people were killed and dozens injured in a crush outside a cricket stadium in India's Bengaluru.",
      "link": "https://www.bbc.com/news/articles/cwyj2jryj67o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/90b1/live/ffbba1c0-41b8-11f0-8b6d-b9754fa10cb7.jpg.webp",
      "date": "3 hrs ago",
      "category": "Asia",
      "full_text": "When Shamili left her home in India's Bengaluru city on Wednesday, it wasn't to see her favourite cricket team - she isn't even a fan of the game. But the buzz around the Royal Challengers Bengaluru's (RCB's) Indian Premier League victory parade - the home teamwon the tournamentfor the first time - had swept through the city like wildfire. Wearing an RCB jersey with \"18 Virat\" on the back - a nod to Virat Kohli, the city's favourite cricket icon - Shamili joined her sister and friends near the Chinnaswamy Stadium, looking forward to celebrations. What she didn't expect was to get caught in a terrifying crush. The victory parade turned deadly when surging crowds - far beyond what authorities expected - led to ahorrific crush that killed 11 peopleand injured dozens more. Survivors like Shamili are now grappling with trauma, pain and a sense of disbelief after the celebration spiralled into catastrophe. \"I kept saying, 'let's go, let's go' - the crowd was getting out of control,\" Shamili recalled, sitting on a bed at the government-run Bowring and Lady Curzon Hospital. \"The next thing I knew, I was on the ground. People were walking over me. I thought I was going to die.\" She is not alone. Many who had come just to soak in the atmosphere - fans, families, curious onlookers - found themselves caught in a tide of bodies as crowds swelled beyond control. Police had expected no more than 100,000 people. In reality, Karnataka's chief minister Siddaramaiah said, the crowd surged to 200,000-300,000. The stadium, with a capacity of 32,000, was overwhelmed long before the team arrived. Videos from before the crush showed people climbing trees and trying to scale the stadium walls. Haneef Mohammed, an engineering student, told BBC Hindi that he had no intention of going inside because he didn't have a pass or ticket. \"I was just standing and watching the crowds near the main gate. Suddenly, people started running all around and the police started hitting people with their lathis,\" he said. Police in India often wield lathis - long bamboo sticks - to try and control crowds. Mr Mohammed got hit on the head with a lathi and started bleeding. He says the police immediately arranged for a vehicle to take him to the hospital. The ages of the 11 victims range from 13 to 43 years. The youngest, Divyanshi, was a Class 9 student who had come to the stadium with her mother and other family members. Other victims include college students and a young tech worker who had come to the stadium with her colleagues. A doctor who spoke on condition of anonymity said that most of them were \"brought dead to hospital\" due to suffocation or broken ribs. The massive crowds had delayed ambulances getting to the site of the crush. Even as chaos and panic ensued on the roads around the Chinnaswamy stadium, the RCB team went inside the stadium after being felicitated on the footsteps of the Vidhana Soudha - the seat of power in Karnataka - by the governor, chief minister and other ministers. \"They went on a victory lap around the stadium. Inside the stadium, there was no sign that anything had happened outside,'' said a young man who spoke on condition of anonymity. IPL chairman Arun Dhumal said he did not know who had planned the event in Bengaluru and that RCB officials inside the stadium were not aware of the crush until they got phone calls. In a statement on X, RCB said it was \"deeply anguished by the unfortunate incidents\". \"Immediately upon being made aware of the situation, we promptly amended our programme and followed the guidance and advice of the local administration,\" it said. \"At a loss for words. Absolutely gutted,\" star player Kohli wrote on Instagram. But questions still remain over how and why the event was organised. \"Normally, the felicitation of a team should be done in a controlled environment. But here, there appeared to be no preparation,\" a relative of an injured person at the Bowring Hospital said. Chief Minister Siddaramaiah has announced a magisterial enquiry into the incident. \"A moment of joy has turned into sorrow,\" he said on Wednesday. Follow BBC News India onInstagram,YouTube,TwitterandFacebook"
    },
    {
      "headline": "Three Maori MPs suspended over 'intimidating' haka",
      "summary": "\"We will never be silenced,\" says Hana-Rawhiti Maipi-Clarke, who started the protest dance.",
      "link": "https://www.bbc.com/news/articles/c5yg9k8x8pwo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/f433/live/a0a18ab0-41db-11f0-bace-e1270fc31f5e.png.webp",
      "date": "2 hrs ago",
      "category": "Asia",
      "full_text": "New Zealand's parliament has voted to suspend three Māori MPs for their protest haka during a sitting last year. Opposition MP Hana-Rawhiti Maipi-Clarke, who started the traditional dance after being asked if her party, Te Pāti Māori (Māori Party), supported a controversial bill, has received a seven-day ban. The party's co-leaders Rawiri Waititi and Debbie Ngarewa-Packer have been banned for 21 days. The bill that sparked the protest haka sought to redefine the country's founding treaty and has since been voted down. New Zealand has long been lauded for its attempts to uphold indigenous rights, but its relationship with the Māori community has deteriorated in recent years under the current conservative government. Last November, a video of the trio performing the haka - a chanting dance of defiance sometimes performed at sports events and graduation ceremonies in New Zealand - went viral and drew global attention. A parliamentary committee ruled last month that the act could have \"intimidated\" other lawmakers. Their suspensions are unprecedented. Before this, the longest ban for any New Zealand lawmaker lasted three days. Maipi-Clarke delivered an emotional speech on Thursday as the house debated the penalties. \"We will never be silenced, and we will never be lost,\" she said, holding back tears. \"Are our voices too loud for this house – is that why we are being punished?\" During the debate, New Zealand's Foreign Minister Winston Peters was asked to apologise after calling Te Pāti Māori a \"bunch of extremists\" and said the country \"has had enough of them\". The Māori party holds six of parliament's 123 seats. The Treaty Principles Bill, which sought to redefine New Zealand's founding treaty with Māori people, was voted down 112 votes to 11 in April - days after a government committee recommended that it should not proceed. Act, the right-wing party which tabled it, argued there is a need to legally define the principles of the Treaty of Waitangi - the 1840 pact between the British Crown and Māori leaders signed during New Zealand's colonisation - which it said resulted in the country being divided by race. Critics, however, said it was the Treaty Principles Bill which would have divided the country and led to the unravelling of much-needed support for many Māori. The proposed legislation sparked widespread outrage across the country and saw more than 40,000 people taking part in a protest outside parliament during its first reading in November last year."
    },
    {
      "headline": "When joy turned to horror for Bengaluru fans celebrating cricket victory",
      "summary": "Eleven people were killed and dozens injured in a crush outside a cricket stadium in India's Bengaluru.",
      "link": "https://www.bbc.com/news/articles/cwyj2jryj67o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/90b1/live/ffbba1c0-41b8-11f0-8b6d-b9754fa10cb7.jpg.webp",
      "date": "3 hrs ago",
      "category": "Asia",
      "full_text": "When Shamili left her home in India's Bengaluru city on Wednesday, it wasn't to see her favourite cricket team - she isn't even a fan of the game. But the buzz around the Royal Challengers Bengaluru's (RCB's) Indian Premier League victory parade - the home teamwon the tournamentfor the first time - had swept through the city like wildfire. Wearing an RCB jersey with \"18 Virat\" on the back - a nod to Virat Kohli, the city's favourite cricket icon - Shamili joined her sister and friends near the Chinnaswamy Stadium, looking forward to celebrations. What she didn't expect was to get caught in a terrifying crush. The victory parade turned deadly when surging crowds - far beyond what authorities expected - led to ahorrific crush that killed 11 peopleand injured dozens more. Survivors like Shamili are now grappling with trauma, pain and a sense of disbelief after the celebration spiralled into catastrophe. \"I kept saying, 'let's go, let's go' - the crowd was getting out of control,\" Shamili recalled, sitting on a bed at the government-run Bowring and Lady Curzon Hospital. \"The next thing I knew, I was on the ground. People were walking over me. I thought I was going to die.\" She is not alone. Many who had come just to soak in the atmosphere - fans, families, curious onlookers - found themselves caught in a tide of bodies as crowds swelled beyond control. Police had expected no more than 100,000 people. In reality, Karnataka's chief minister Siddaramaiah said, the crowd surged to 200,000-300,000. The stadium, with a capacity of 32,000, was overwhelmed long before the team arrived. Videos from before the crush showed people climbing trees and trying to scale the stadium walls. Haneef Mohammed, an engineering student, told BBC Hindi that he had no intention of going inside because he didn't have a pass or ticket. \"I was just standing and watching the crowds near the main gate. Suddenly, people started running all around and the police started hitting people with their lathis,\" he said. Police in India often wield lathis - long bamboo sticks - to try and control crowds. Mr Mohammed got hit on the head with a lathi and started bleeding. He says the police immediately arranged for a vehicle to take him to the hospital. The ages of the 11 victims range from 13 to 43 years. The youngest, Divyanshi, was a Class 9 student who had come to the stadium with her mother and other family members. Other victims include college students and a young tech worker who had come to the stadium with her colleagues. A doctor who spoke on condition of anonymity said that most of them were \"brought dead to hospital\" due to suffocation or broken ribs. The massive crowds had delayed ambulances getting to the site of the crush. Even as chaos and panic ensued on the roads around the Chinnaswamy stadium, the RCB team went inside the stadium after being felicitated on the footsteps of the Vidhana Soudha - the seat of power in Karnataka - by the governor, chief minister and other ministers. \"They went on a victory lap around the stadium. Inside the stadium, there was no sign that anything had happened outside,'' said a young man who spoke on condition of anonymity. IPL chairman Arun Dhumal said he did not know who had planned the event in Bengaluru and that RCB officials inside the stadium were not aware of the crush until they got phone calls. In a statement on X, RCB said it was \"deeply anguished by the unfortunate incidents\". \"Immediately upon being made aware of the situation, we promptly amended our programme and followed the guidance and advice of the local administration,\" it said. \"At a loss for words. Absolutely gutted,\" star player Kohli wrote on Instagram. But questions still remain over how and why the event was organised. \"Normally, the felicitation of a team should be done in a controlled environment. But here, there appeared to be no preparation,\" a relative of an injured person at the Bowring Hospital said. Chief Minister Siddaramaiah has announced a magisterial enquiry into the incident. \"A moment of joy has turned into sorrow,\" he said on Wednesday. Follow BBC News India onInstagram,YouTube,TwitterandFacebook"
    },
    {
      "headline": "How airline fees have turned baggage into billions",
      "summary": "The amount carriers now charge for luggage is raising the ire of politicians and consumer groups.",
      "link": "https://www.bbc.com/news/articles/c0qg3ylx2g9o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/99df/live/7c390cc0-3fa6-11f0-9662-93b759fb8bcd.jpg.webp",
      "date": "10 hrs ago",
      "category": "Business",
      "full_text": "With Air Canada and Southwest the latest airlines to charge passengers for check-in luggage, the ballooning cost of such ancillary or \"junk fees\" is provoking anger among politicians and consumer groups. At the same time, sales of suitcases small enough for passengers to take on the plane as hand luggage are booming. Standing outside Toronto's downtown airport, Lauren Alexander has flown over from Boston for the weekend. She describes such additional charges as \"ridiculous\". \"It feels like a trick,\" says the 24-year-old. \"You buy the ticket, you think it's going to be less expensive, then you have to pay $200 (£148) extra [to bring a suitcase].\" To avoid the fee, Ms Alexander instead travelled with a small backpack as hand luggage. Sage Riley, who is 27, agrees, telling the BBC, \"It can be pricey.\" There was a time when checked bags, seat selection and your meals all came as standard on commercial flights. But that all changed with the rise of the budget airlines, says Jay Sorensen of US aviation consultancy IdeaWorks. It was in 2006 when UK low-cost carrier FlyBe became what is believed to be the world's first airline to start charging passengersto check in bags.It charged £2 for a pre-booked item of luggage, and £4 if the customer hadn't paid in advance. Other budget carriers then quickly followed suit, with the so-called flag carriers or established airlines then also doing so, at least on shorter flights. In 2008 American Airlines became the first US airline to charge a fee, $15, for the first checked bag on its domestic routes. Mr Sorenson says such traditional airlines felt they had no choice when they \"began to realise that the low-cost carriers were providing very significant competition\". He adds: \"They felt they had to do something to meet that.\" Fast forward to today, and US airlines alone made $7.27bn from check-in baggage fees last year,according to federal figures.That is up from $7bn in 2023, and $5.76bn in 2019. Little wonder then that more of us are trying to just take carry-on. Kirsty Glenn, managing director of UK luggage firm Antler, confirms that there is an ongoing surge in demand for small suitcases that meet airline dimension limits for carry-on luggage. \"We have seen huge spikes in searches online and on our website,\" she says. Describing a new small-dimension case her company launched in April, Ms Glenn adds: \"Testament to the trend of only travelling with hand luggage, it's sold like crazy.\" At the same time, social media content about travel packing \"hacks\" and luggage that meets airlines' carry-on size measurements, have soared according to travel journalist Chelsea Dickenson. She makes this content for TikTok. \"Social media has really propelled this idea of needing a bag that fits the baggage allowance requirements, says Ms Dickenson. \"It's become a core part of the content that I create and post on social media.\" Ms Dickenson, whose social media following has ballooned to close to a million followers, adds that her luggage videos have become a \"core part of the content\" she creates. \"It blows my mind,\" she says. \"I could spend weeks and weeks researching a big trip, and the resulting videos will not come close to doing as well as me going and buying a cheap suitcase, taking it to the airport, testing it in one of those baggage sizes and reporting back.\" The overall global cost of all airline extra fees, from luggage to seat selection, buying wifi access, lounge access, upgrades, and food and drink, isexpected to reach $145bn this year,14% of the sector's total revenues. That's according to the International Air Transport Association, which represents the industry. This compares with $137bn last year. These numbers have caught the attention of some politicians in Washington, and last December airline bosses were grilled before a senate committee. It was a Democrat senator who used the term\"junk fees\". He wants the federal government to review such costs and potentially fine airlines. We asked the US Department of Transportation for a comment, but did not get a response. But if having to pay for check-in wasn't enough, a growing number of airlines are now charging for hand luggage. For example, Irish budget airline Ryanair will only allow you to carry a small bag that fits under the seat in front of you for free. If you want to take a bigger bag or suitcase to go in the overhead locker that will cost you from £6. Other European airlines that now have similar charges for hand luggage are Easyjet, Norwegian Airlines, Transavia, Volotea, Vueling, and Wizzair. This has annoyed pan-European consumer group Becu (The European Consumer Organisation), which last month filed a complaint with the European Commission. Becu cites a 2014 EU Court of Justice ruling, which said \"carriage of hand baggage cannot be made subject to a price supplement, provided that it meets reasonable requirements in terms of its weight and dimensions, and complies with applicable security requirements\". However, what determines \"reasonable requirements\" continues to be a grey area in need of an official ruling. There can, however, be a different way of doing things, as shown by Indian airline IndiGo. Its boss Pieter Eibers says that it does not charge for check-in luggage. \"The entire philosophy here is different,\" he says. \"We don't want long lines, and endless debates at gates about the weight of luggage. We don't have any of that. We turn our planes around in 35 minutes.\""
    },
    {
      "headline": "How satellite images show scale of Ukraine's drone attack on Russian bombers",
      "summary": "The images show heavy damage to bases in north-western and central Russia after Sunday's surprise raid.",
      "link": "https://www.bbc.com/news/articles/cvg9zdxwk29o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/41bb/live/3c701ac0-4159-11f0-b6e6-4ddb91039da1.png.webp",
      "date": "15 hrs ago",
      "category": "BBC Verify",
      "full_text": "New satellite images and drone footage show serious damage inflicted on aircraft at several Russian airbases during Ukraine's surprise drone strike on Sunday. The images of two Russian airbases in north-western and central Russia, taken on Wednesday morning, show 12 aircraft damaged or destroyed. Meanwhile, drone footage, released by the Security Service of Ukraine (SBU) on Wednesday, showed attacks on these two bases as well as two more targeted elsewhere. Ukraine claims that it targeted 41 strategic bombers in the operation, adding that \"at least\" 13 were destroyed. Security officials say the shock incursion took 18 months to plan and saw many drones smuggled into Russia. The SBU video is almost five minutes long and consists of edited footage taken by drones in the process of conducting attacks on Olenya, Ivanovo, Dyagilevo and Belaya airbases. In each shot the feed cuts out before any explosion, but in some instances we see other planes on fire in the background. At no point do we see any indication of defensive measures from Russian forces, even after the attack was clearly well underway. Many of the aircraft are covered in tyres - a Russian tactic said to be aimed at mitigating against drone strikes. Some of the aircraft are seen apparently loaded with cruise missiles and well fuelled - judging by the extent and spread of fires. This suggests they were prepared to conduct strikes. The clearest satellite imagery covers Olenya and Belaya and shows five damaged or destroyed planes at the former and seven at the latter. Olenya is a major Russian airbase in the north-west of the country. The SBU footage shows smoke pouring from three aircraft, identified as Tu-95 strategic bombers and an approach to a fourth. Video footage also shows a drone approaching a Tu-22M strategic bomber sitting on the runway in this very same position. Satellite imagery from Maxar clearly shows a destroyed aircraft sitting beside a row of Tu-22M type aircraft. Manufacturing of both the Tu-95 and Tu-22 ended at the fall of the Soviet Union in the early 1990s, which will make repair difficult and replacement near impossible. Elsewhere in the SBU video, an AN-12 Transporter can be seen being approached. The Maxar satellite image does not show the aftermath of this, but other imagery reviewed by BBC Verify from AviVector - a satellite image analyst on X - suggests that it too was destroyed. Imagery provided by Planet Labs from this morning shows the entirety of Belaya airbase in Irkutsk Oblast, nearly 3,000km from the Ukrainian border. It shows three damaged Tu-95s and four Tu-22s and in various parts of the base. The SBU footage shows many of the same aircraft being approached. In two instances we see the drone carefully position itself on the wing of a Tu-95 - next to one of its fuel tanks. The final shot of the footage shows smoke rising from numerous sites across the base. At Ivanovo airbase two A50-AWACS planes are seen being targeted. The aircraft serves as an early warning and control asset - or spy plane -  and is identifiable by the sizeable radar system on its fuselage. Ukraine previouslyshot down two of these aircraftin January and February 2024. As yet we have not seen any imagery or footage that captures any damage to these aircraft at Ivanovo. While satellite imagery from the site does show wreckage, BBC Verify has confirmed that the damage was present at the site before Sunday's attack and is likely from another incident. The SBU footage from Dyagilevo in Ryazan region shows three Tu-22s being approached, but there is no clear indication of damage sustained in either the footage or available satellite imagery. Additional reporting by Shayan Sardarizadeh What do you want BBC Verify to investigate?"
    },
    {
      "headline": "This armoured vehicle was used in Iraq - now it stands on the US-Mexico border",
      "summary": "The Trump administration has expanded military bases near the border in order to deploy troops to detain migrants.",
      "link": "https://www.bbc.com/news/articles/cvgd3rz47j4o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/e755/live/74978b10-3b26-11f0-aeea-fdc959b41973.jpg.webp",
      "date": "4 hrs ago",
      "category": "",
      "full_text": "In the heart of the Texas desert, a Stryker is parked near a stretch of border wall. The light but powerful eight-wheeled combat vehicle was used in the Iraq and Afghanistan wars – and now is being used to stop what US President Donald Trump has called an \"invasion\" at the US-Mexico border. The Stryker is just one of about 100 such vehicles being used along the 3,100 km border. In addition, it is estimated there are over 8,000 soldiers, as well as spy planes and drones, and two Navy ships monitoring the coast. A few kilometres away on the Mexican side of the border, a young man standing on top of a hill is one of the few signs of this so-called \"invasion\". He is what Border Patrol agents call a \"hawk,\" the ones who monitor and decide when and where to encourage migrants to cross into the United States. But those crossings – not long ago at an all time high – have slowed to a trickle. The declining numbers have raised questions about Trump's border tactics, which include an unprecedented deployment of American military might. Trump has been accused of bypassing the conventional distinction between the armed forces and domestic police by deploying the military to the border. In the US, the Posse Comitatus Act prevents federal armed forces from participating in law enforcement activities unless Congress has expressly authorized it. However, the military is allowed to patrol its own bases and arrest trespassers through what is known as the \"military purpose doctrine\". Between April 18 and May 1, the Pentagon created two National Defense Areas, both bordering the Mexican state of Chihuahua, and made them de facto parts of existing military bases. What this has done, says Elizabeth Goitein, senior director of the left-leaning Brennan Center for Justice's Liberty & National Security Program, is allow the military to patrol huge swaths of the border. Migrants caught crossing into these areas would be considered trespassers and may be temporarily detained by US soldiers until Border Patrol agents arrive. \"It's exactly what the administration is trying to set up here: to turn up to a third of the southern border into a military installation,\" she told BBC Mundo. \"When someone enters the area and is detained, they can argue that the primary reason for doing so is to protect the base.\" The military command insists that its mission is to detain and alert border agents so they can make the official arrest - not to do domestic police work. The Trump administration argues the expanded military areas are necessary for national security, and points to its decisive election victory as a mandate. Stronger border security was a key Trump campaign promise and one of the biggest issues for voters. White House Press Secretary Karoline Leavitt says the new areas \"will enhance our ability to detect, interdict and prosecute the illegal aliens, criminal gangs, and terrorists who were able to invade our country\". \"It will also bolster our defenses against fentanyl and other dangerous narcotics that have been poisoning our communities,\" she added. Ms Goitein questions how the expansion of the military is justified, given the numbers of crossings at the border have fallen to historic lows. While numbers began falling before Trump took office, the decline has accelerated since January, as the administration has ramped up its efforts to arrest and deport illegal migrants. In April, more than 8,000 people were detained for illegally entering the country at the southwest border. A year ago, the number was 128,000 in April - a 94 % drop - according to government statistics. Brigadier General Jeremy Winters, who is in charge of coordinating the efforts of different law enforcement agencies along the southern border, has said even one illegal crossing is too many. \"Containment is at 95%. But 95% is not 100%,\" he said during a press conference. \"For us to accept that 95% is good enough would be to say that it's conceptually okay to break the law. And that's not what we're doing here.\" The creation of these national defense areas has had a direct effect on arrests, statistics show. As of 3 June, the Joint Task Force on the Southern Border has detected approximately 340 migrant in these militerised zones. To the common charge of entering the United States illegally, prosecutors now can add the charge of intentionally violating security regulations in the areas now declared restricted. While both are classified as misdemeanors, the penalties for violating security regulations are much steeper. While entering the country without permission through a location not designated as a port of entry carries a maximum sentence of six months in prison and a fine of up to US$5,000, the second charge increases the possible penalties to up to one year in prison and a fine of US$100,000. \"This is pure wilderness, a desert\" Carlos Ibarra, the public defender for several of the detainees, told BBC Mundo. \"(The migrants) continue arriving as usual, but suddenly, they face military charges. And they don't understand anything.\" Some of those additional charges were dismissed, with a New Mexico judge finding that military signs were not clearly marked or could be missed. But many have been convicted and pleaded guilty. Meanwhile, the militarisation of the border will continue. Trump even recently said that he pressured Mexican President Claudia Sheinbaum to allow the Army to cross into the neighbouring country to conduct operations against cartels, something the president flatly rejected. For now, the troops remain on the US side of the border. \"This is their primary mission. This is not training. This is an operation to seal and protect our border, our own homeland,\" Brigadier General Winters said."
    },
    {
      "headline": "When joy turned to horror for Bengaluru fans celebrating cricket victory",
      "summary": "Eleven people were killed and dozens injured in a crush outside a cricket stadium in India's Bengaluru.",
      "link": "https://www.bbc.com/news/articles/cwyj2jryj67o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/90b1/live/ffbba1c0-41b8-11f0-8b6d-b9754fa10cb7.jpg.webp",
      "date": "3 hrs ago",
      "category": "Asia",
      "full_text": "When Shamili left her home in India's Bengaluru city on Wednesday, it wasn't to see her favourite cricket team - she isn't even a fan of the game. But the buzz around the Royal Challengers Bengaluru's (RCB's) Indian Premier League victory parade - the home teamwon the tournamentfor the first time - had swept through the city like wildfire. Wearing an RCB jersey with \"18 Virat\" on the back - a nod to Virat Kohli, the city's favourite cricket icon - Shamili joined her sister and friends near the Chinnaswamy Stadium, looking forward to celebrations. What she didn't expect was to get caught in a terrifying crush. The victory parade turned deadly when surging crowds - far beyond what authorities expected - led to ahorrific crush that killed 11 peopleand injured dozens more. Survivors like Shamili are now grappling with trauma, pain and a sense of disbelief after the celebration spiralled into catastrophe. \"I kept saying, 'let's go, let's go' - the crowd was getting out of control,\" Shamili recalled, sitting on a bed at the government-run Bowring and Lady Curzon Hospital. \"The next thing I knew, I was on the ground. People were walking over me. I thought I was going to die.\" She is not alone. Many who had come just to soak in the atmosphere - fans, families, curious onlookers - found themselves caught in a tide of bodies as crowds swelled beyond control. Police had expected no more than 100,000 people. In reality, Karnataka's chief minister Siddaramaiah said, the crowd surged to 200,000-300,000. The stadium, with a capacity of 32,000, was overwhelmed long before the team arrived. Videos from before the crush showed people climbing trees and trying to scale the stadium walls. Haneef Mohammed, an engineering student, told BBC Hindi that he had no intention of going inside because he didn't have a pass or ticket. \"I was just standing and watching the crowds near the main gate. Suddenly, people started running all around and the police started hitting people with their lathis,\" he said. Police in India often wield lathis - long bamboo sticks - to try and control crowds. Mr Mohammed got hit on the head with a lathi and started bleeding. He says the police immediately arranged for a vehicle to take him to the hospital. The ages of the 11 victims range from 13 to 43 years. The youngest, Divyanshi, was a Class 9 student who had come to the stadium with her mother and other family members. Other victims include college students and a young tech worker who had come to the stadium with her colleagues. A doctor who spoke on condition of anonymity said that most of them were \"brought dead to hospital\" due to suffocation or broken ribs. The massive crowds had delayed ambulances getting to the site of the crush. Even as chaos and panic ensued on the roads around the Chinnaswamy stadium, the RCB team went inside the stadium after being felicitated on the footsteps of the Vidhana Soudha - the seat of power in Karnataka - by the governor, chief minister and other ministers. \"They went on a victory lap around the stadium. Inside the stadium, there was no sign that anything had happened outside,'' said a young man who spoke on condition of anonymity. IPL chairman Arun Dhumal said he did not know who had planned the event in Bengaluru and that RCB officials inside the stadium were not aware of the crush until they got phone calls. In a statement on X, RCB said it was \"deeply anguished by the unfortunate incidents\". \"Immediately upon being made aware of the situation, we promptly amended our programme and followed the guidance and advice of the local administration,\" it said. \"At a loss for words. Absolutely gutted,\" star player Kohli wrote on Instagram. But questions still remain over how and why the event was organised. \"Normally, the felicitation of a team should be done in a controlled environment. But here, there appeared to be no preparation,\" a relative of an injured person at the Bowring Hospital said. Chief Minister Siddaramaiah has announced a magisterial enquiry into the incident. \"A moment of joy has turned into sorrow,\" he said on Wednesday. Follow BBC News India onInstagram,YouTube,TwitterandFacebook"
    },
    {
      "headline": "This armoured vehicle was used in Iraq - now it stands on the US-Mexico border",
      "summary": "The Trump administration has expanded military bases near the border in order to deploy troops to detain migrants.",
      "link": "https://www.bbc.com/news/articles/cvgd3rz47j4o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/e755/live/74978b10-3b26-11f0-aeea-fdc959b41973.jpg.webp",
      "date": "4 hrs ago",
      "category": "",
      "full_text": "In the heart of the Texas desert, a Stryker is parked near a stretch of border wall. The light but powerful eight-wheeled combat vehicle was used in the Iraq and Afghanistan wars – and now is being used to stop what US President Donald Trump has called an \"invasion\" at the US-Mexico border. The Stryker is just one of about 100 such vehicles being used along the 3,100 km border. In addition, it is estimated there are over 8,000 soldiers, as well as spy planes and drones, and two Navy ships monitoring the coast. A few kilometres away on the Mexican side of the border, a young man standing on top of a hill is one of the few signs of this so-called \"invasion\". He is what Border Patrol agents call a \"hawk,\" the ones who monitor and decide when and where to encourage migrants to cross into the United States. But those crossings – not long ago at an all time high – have slowed to a trickle. The declining numbers have raised questions about Trump's border tactics, which include an unprecedented deployment of American military might. Trump has been accused of bypassing the conventional distinction between the armed forces and domestic police by deploying the military to the border. In the US, the Posse Comitatus Act prevents federal armed forces from participating in law enforcement activities unless Congress has expressly authorized it. However, the military is allowed to patrol its own bases and arrest trespassers through what is known as the \"military purpose doctrine\". Between April 18 and May 1, the Pentagon created two National Defense Areas, both bordering the Mexican state of Chihuahua, and made them de facto parts of existing military bases. What this has done, says Elizabeth Goitein, senior director of the left-leaning Brennan Center for Justice's Liberty & National Security Program, is allow the military to patrol huge swaths of the border. Migrants caught crossing into these areas would be considered trespassers and may be temporarily detained by US soldiers until Border Patrol agents arrive. \"It's exactly what the administration is trying to set up here: to turn up to a third of the southern border into a military installation,\" she told BBC Mundo. \"When someone enters the area and is detained, they can argue that the primary reason for doing so is to protect the base.\" The military command insists that its mission is to detain and alert border agents so they can make the official arrest - not to do domestic police work. The Trump administration argues the expanded military areas are necessary for national security, and points to its decisive election victory as a mandate. Stronger border security was a key Trump campaign promise and one of the biggest issues for voters. White House Press Secretary Karoline Leavitt says the new areas \"will enhance our ability to detect, interdict and prosecute the illegal aliens, criminal gangs, and terrorists who were able to invade our country\". \"It will also bolster our defenses against fentanyl and other dangerous narcotics that have been poisoning our communities,\" she added. Ms Goitein questions how the expansion of the military is justified, given the numbers of crossings at the border have fallen to historic lows. While numbers began falling before Trump took office, the decline has accelerated since January, as the administration has ramped up its efforts to arrest and deport illegal migrants. In April, more than 8,000 people were detained for illegally entering the country at the southwest border. A year ago, the number was 128,000 in April - a 94 % drop - according to government statistics. Brigadier General Jeremy Winters, who is in charge of coordinating the efforts of different law enforcement agencies along the southern border, has said even one illegal crossing is too many. \"Containment is at 95%. But 95% is not 100%,\" he said during a press conference. \"For us to accept that 95% is good enough would be to say that it's conceptually okay to break the law. And that's not what we're doing here.\" The creation of these national defense areas has had a direct effect on arrests, statistics show. As of 3 June, the Joint Task Force on the Southern Border has detected approximately 340 migrant in these militerised zones. To the common charge of entering the United States illegally, prosecutors now can add the charge of intentionally violating security regulations in the areas now declared restricted. While both are classified as misdemeanors, the penalties for violating security regulations are much steeper. While entering the country without permission through a location not designated as a port of entry carries a maximum sentence of six months in prison and a fine of up to US$5,000, the second charge increases the possible penalties to up to one year in prison and a fine of US$100,000. \"This is pure wilderness, a desert\" Carlos Ibarra, the public defender for several of the detainees, told BBC Mundo. \"(The migrants) continue arriving as usual, but suddenly, they face military charges. And they don't understand anything.\" Some of those additional charges were dismissed, with a New Mexico judge finding that military signs were not clearly marked or could be missed. But many have been convicted and pleaded guilty. Meanwhile, the militarisation of the border will continue. Trump even recently said that he pressured Mexican President Claudia Sheinbaum to allow the Army to cross into the neighbouring country to conduct operations against cartels, something the president flatly rejected. For now, the troops remain on the US side of the border. \"This is their primary mission. This is not training. This is an operation to seal and protect our border, our own homeland,\" Brigadier General Winters said."
    },
    {
      "headline": "Stores open at midnight as fans rush to buy Nintendo Switch 2",
      "summary": "One retailer says it's the \"biggest gaming pre-order ever\" - but there questions over whether high prices will dent sales.",
      "link": "https://www.bbc.com/news/articles/ckgxwe774zwo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/1e59/live/3ca78330-41c1-11f0-b142-e9bdc136ef30.jpg.webp",
      "date": "Just now",
      "category": "Technology",
      "full_text": "The Nintendo Switch 2 has been released worldwide, with stores opening at midnight so fans could get their hands on the long-awaited console the moment it became available. Some shops have the devices available to buy off the shelf - but in most cases customers have been picking up consoles they had ordered in advance, with UK retailer Currys calling it its \"biggest gaming pre-order ever.\" Despite the excitement there have been some setbacks, with one supplier, Game,cancelling some pre-orders. In the US, Nintendo briefly pulled Switch 2 pre-orders in Aprilover concerns around tariffsbefore starting again a few weeks later. But that doesn't appear to have put fans off- with queues forming at stores around the world as gamers vied to be among the first to unbox their new console. Currys told the BBC it had sold 30,000 units - which it attributed to the \"incredible excitement\" associated with the launch. Despite the initial excitement, questions remain over whether the Switch 2 will match the success of its predecessor - the third-best selling console in history - in part because of its high game prices. A physical copy of its most high-profile game, Mario Kart World, comes in at £74.99 - £15 more expensive than a typical Switch title. The original Nintendo Switch has shifted more than 150 million units since its 2017 release. A successor has been in the works for years - so perhaps unsurprisingly Tushar Sandarka, the President of the University of York's Mario Kart society, is among those excited about the launch, and the new version of Mario coming with it. \"It's coming out with Mario Kart World - which is the first since 2014 - it's a big deal for us,\" the 19-year-old said. \"Securing a pre-order was such a tough decision because it's so expensive. \"Even if it's a bit higher than I would have wanted to pay for it, it's going to serve me well for the next 7 or 8 years.\" But not everyone the BBC spoke to said they would be picking up the console on launch. Mae and Lottie, both students in York, said they would stick to the original Switch because of the cost. \"It's quite spenny,\" Mae said. \"What we've got is fine.\" Lottie agreed, but said she was disappointed not to play on the new Mario Kart game - which she said could cost her as much as \"a day's pay\". \"I'm not spending that on a game,\" she said. For Nintendo, the Switch 2 represents a change in strategy - in the past its new devices have been given an entirely new name. \"This is the first time Nintendo has ever launched a straight sequel,\" GamesRadar+ brand director Sam Loveridge told the BBC. \"It's a clear proposition for consumers - they know exactly what they're getting from this console if they are familiar with the original Switch.\" She said \"everything is pointing to\" pre-orders having sold well. \"When pre-orders first went live, it was an absolute scramble to find any stock, but Nintendo was clearly prepared and since those early weeks, it's been a lot easier to secure yourself a console for launch day,\" she said. I was one of the lucky few to get my hands on the Switch 2 at an event in April. Like its predecessor, it is a \"hybrid\" console - a handheld device which can also be plugged into a TV to play on the big screen. But it has a bigger and brighter screen, along with lots more power and storage. It still has a bit of innovation - you can use the controller like a computer mouse by twisting it on its side, making PC games such as Civilization VII a more enjoyable experience than using joysticks. But many of the showcase Nintendo games on display at that event  - including Metroid Prime 4, Donkey Kong: Bananza, and Super Mario Party Jamboree TV - won't be available at launch. Instead the only new Nintendo game on the new console will be Mario Kart World, barring a small title called Welcome Tour which showcases some of the new hardware. \"It might seem like an odd bet, but with the original Mario Kart 8 being the best-selling Wii U game and Mario Kart 8 Deluxe being the best-selling Nintendo Switch game, there's a very established audience there,\" Ms Loveridge said. The gaming giant is also releasing on day one upgraded versions of the Switch's Legend of Zelda games, Breath of the Wild and Tears of the Kingdom, which take advantage of the console's greater power. Beyond that, gamers will have to look to third-party games for alternatives on launch. The range of games includes Rune Factory: Guardians of Azuma, Cyberpunk 2077, and Bravely Default. \"This more powerful console offers plenty of opportunities for third-party games publishers bringing Nintendo into more direct competition with Sony and Microsoft,\" said Katie Holt, senior games industry research analyst at Ampere Analysis . And fans can expect more from third-party games as the console develops too - with Nintendo senior director Takuhiro Dohta telling me he expected games to get even better. \"When there are software titles set for the launch of the hardware, the developers still don't fully know the capabilities and hardware well enough,\" he said. \"As developers continue to develop, they start to understand how it works and what it's capable of, so I think we can expect improvements not only in graphics but in gameplay too.\" Sign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here."
    },
    {
      "headline": "New trailer for Wicked sequel takes fans back to Oz",
      "summary": "Cynthia Erivo and Ariana Grande will return for the second half of The Wizard of Oz spin-off.",
      "link": "https://www.bbc.com/news/articles/cx2e187e1njo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/4147/live/4c8eadd0-4155-11f0-b6e6-4ddb91039da1.jpg.webp",
      "date": "8 hrs ago",
      "category": "Culture",
      "full_text": "The first full-length trailer for Wicked's forthcoming sequel has been released, offering fans a glimpse of how the Wizard of Oz spin-off will conclude. Wicked: For Good will see Cynthia Erivo return as Elphaba, the Wicked Witch of the West, alongside Ariana Grande as Glinda the Good Witch of the North. The sequel picks up where the first film left off and covers the years after Elphaba and Glinda's decision to part ways. Elphaba is now an enemy of the state of Oz, while Glinda has become a public figure controlled by the Wizard. The new trailer shows Glinda's bedroom window cracking. She goes outside to her balcony to search for Elphaba, who then appears next to her from the shadows. It also teases the arrival of Dorothy - seen walking down the yellow brick road with her friends - suggesting the character might have a bigger role in the films than in the musical. But the actress who plays her has not yet been revealed. At another point in the trailer, Elphaba is seen writing the phrase \"Our wizard lies\" in the clouds above Oz using her broom stick. Other highlights include Elphaba receiving a handwritten note from Glinda reading: \"I hope you get what your heart desires.\" The trailer ends with Elphaba saying she's \"off to see the Wizard\" before flying on a broom into the distance with her winged monkeys. Director Jon M Chutold Vanity Fair:\"Our heart was broken when Glinda can't make the choice that we want her to so badly at the end of movie one, and it feels empowering for Elphaba to fly away from society. \"In movie two, we get to see the consequences of those choices. The temperature is up.\" The films have been adapted from the hugely successful Broadway and West End musical, which itself was based on Gregory Maguire's 1995 novel. However, the stage musical was split into two films for its big-screen adaptation, with the second due to be released on 21 November. The two movies were shot simultaneously at Elstree Studios in Hertfordshire between December 2022 and January 2024, with production interrupted mid-way through by the Hollywood actors' strike. Wicked wasthe highest-grossing movie of 2024 in the UK,and scored 10 Oscar nominations - winning two for best costume and production design. At two hours 40 minutes, the first film alone was almost as long as the entire length of the stage show. Erivo and Grande's chemistry and real-life friendship prompted several viral interview moments during the first film's promotional run last year, and the pair jointly opened the Academy Awards in March with a Wicked medley. But one challenge facing the sequel is that most of the best known songs from the musical, such as Defying Gravity, Popular and The Wizard And I, featured in the first film. The forthcoming follow-up will feature two brand new songs,with Chu explaining:\"They're great additions to this movie. They were necessary in this movie to help tell the story.\" Two other Wicked staples - For Good and No Good Deed - will also appear in part two. The sequel will see Grande and Erivo joined once again by co-stars Michelle Yeoh, Jonathan Bailey and Jeff Goldblum as the Wizard. Grande's Glinda is seen in the trailer wearing a wedding dress, suggesting she may be about to marry Bailey's Fiyero, who - echoing the lyrics to the title track For Good - promises he has \"changed\". Meanwhile, Goldblum's wizard is seen declaring to Dorothy, the tin man, scarecrow and lion: \"Get me the broom of the Wicked Witch of the West.\" One of the teaser's most emotional moments comes when Elphaba is seen telling Glinda: \"You're the only friend I've ever had.\" \"And I've had so many friends,\" laughs a characteristically self-assured Glinda. \"But only one that mattered.\""
    },
    {
      "headline": "Stores open at midnight as fans rush to buy Nintendo Switch 2",
      "summary": "One retailer says it's the \"biggest gaming pre-order ever\" - but there questions over whether high prices will dent sales.",
      "link": "https://www.bbc.com/news/articles/ckgxwe774zwo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/1e59/live/3ca78330-41c1-11f0-b142-e9bdc136ef30.jpg.webp",
      "date": "Just now",
      "category": "Technology",
      "full_text": "The Nintendo Switch 2 has been released worldwide, with stores opening at midnight so fans could get their hands on the long-awaited console the moment it became available. Some shops have the devices available to buy off the shelf - but in most cases customers have been picking up consoles they had ordered in advance, with UK retailer Currys calling it its \"biggest gaming pre-order ever.\" Despite the excitement there have been some setbacks, with one supplier, Game,cancelling some pre-orders. In the US, Nintendo briefly pulled Switch 2 pre-orders in Aprilover concerns around tariffsbefore starting again a few weeks later. But that doesn't appear to have put fans off- with queues forming at stores around the world as gamers vied to be among the first to unbox their new console. Currys told the BBC it had sold 30,000 units - which it attributed to the \"incredible excitement\" associated with the launch. Despite the initial excitement, questions remain over whether the Switch 2 will match the success of its predecessor - the third-best selling console in history - in part because of its high game prices. A physical copy of its most high-profile game, Mario Kart World, comes in at £74.99 - £15 more expensive than a typical Switch title. The original Nintendo Switch has shifted more than 150 million units since its 2017 release. A successor has been in the works for years - so perhaps unsurprisingly Tushar Sandarka, the President of the University of York's Mario Kart society, is among those excited about the launch, and the new version of Mario coming with it. \"It's coming out with Mario Kart World - which is the first since 2014 - it's a big deal for us,\" the 19-year-old said. \"Securing a pre-order was such a tough decision because it's so expensive. \"Even if it's a bit higher than I would have wanted to pay for it, it's going to serve me well for the next 7 or 8 years.\" But not everyone the BBC spoke to said they would be picking up the console on launch. Mae and Lottie, both students in York, said they would stick to the original Switch because of the cost. \"It's quite spenny,\" Mae said. \"What we've got is fine.\" Lottie agreed, but said she was disappointed not to play on the new Mario Kart game - which she said could cost her as much as \"a day's pay\". \"I'm not spending that on a game,\" she said. For Nintendo, the Switch 2 represents a change in strategy - in the past its new devices have been given an entirely new name. \"This is the first time Nintendo has ever launched a straight sequel,\" GamesRadar+ brand director Sam Loveridge told the BBC. \"It's a clear proposition for consumers - they know exactly what they're getting from this console if they are familiar with the original Switch.\" She said \"everything is pointing to\" pre-orders having sold well. \"When pre-orders first went live, it was an absolute scramble to find any stock, but Nintendo was clearly prepared and since those early weeks, it's been a lot easier to secure yourself a console for launch day,\" she said. I was one of the lucky few to get my hands on the Switch 2 at an event in April. Like its predecessor, it is a \"hybrid\" console - a handheld device which can also be plugged into a TV to play on the big screen. But it has a bigger and brighter screen, along with lots more power and storage. It still has a bit of innovation - you can use the controller like a computer mouse by twisting it on its side, making PC games such as Civilization VII a more enjoyable experience than using joysticks. But many of the showcase Nintendo games on display at that event  - including Metroid Prime 4, Donkey Kong: Bananza, and Super Mario Party Jamboree TV - won't be available at launch. Instead the only new Nintendo game on the new console will be Mario Kart World, barring a small title called Welcome Tour which showcases some of the new hardware. \"It might seem like an odd bet, but with the original Mario Kart 8 being the best-selling Wii U game and Mario Kart 8 Deluxe being the best-selling Nintendo Switch game, there's a very established audience there,\" Ms Loveridge said. The gaming giant is also releasing on day one upgraded versions of the Switch's Legend of Zelda games, Breath of the Wild and Tears of the Kingdom, which take advantage of the console's greater power. Beyond that, gamers will have to look to third-party games for alternatives on launch. The range of games includes Rune Factory: Guardians of Azuma, Cyberpunk 2077, and Bravely Default. \"This more powerful console offers plenty of opportunities for third-party games publishers bringing Nintendo into more direct competition with Sony and Microsoft,\" said Katie Holt, senior games industry research analyst at Ampere Analysis . And fans can expect more from third-party games as the console develops too - with Nintendo senior director Takuhiro Dohta telling me he expected games to get even better. \"When there are software titles set for the launch of the hardware, the developers still don't fully know the capabilities and hardware well enough,\" he said. \"As developers continue to develop, they start to understand how it works and what it's capable of, so I think we can expect improvements not only in graphics but in gameplay too.\" Sign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here."
    },
    {
      "headline": "US vetoes UN call for unconditional Gaza ceasefire",
      "summary": "The US ambassador to the UN said the resolution failed to call on Hamas to disarm and leave the Gaza Strip.",
      "link": "https://www.bbc.com/news/articles/c4g60p1xgdlo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/72ac/live/b25f19a0-4188-11f0-a437-1d82cad3236c.jpg.webp",
      "date": "11 hrs ago",
      "category": "",
      "full_text": "The US has vetoed the UN Security Council's draft resolution calling for an \"unconditional and permanent\" ceasefire in Gaza. The other 14 members voted in favour of the document, which also demanded the release of all hostages and the lifting of humanitarian aid restrictions. The US Ambassador to the UN, Dorothy Shea, said the resolution would \"undermine diplomatic efforts\" to reach a ceasefire, adding that the UN has not labelled Hamas as a terrorist organisation. Hamas is described as such by the US, UK and the EU. \"We would not support any measure that fails to condemn Hamas and does not call for Hamas to disarm and leave Gaza,\" she said. It comes amid growing concern over the distribution of aid in Gaza, with more than two million people at risk of starvation, according to the UN, after a total Israeli ban on shipments of food and other aid that lasted 11 weeks. Aid distribution has recently been taken over by The Gaza Humanitarian Foundation (GHF), an Israel and US-backed group which aims to replace UN agencies and other organisations in the region. Over the past few days,there have been a series of deadly incidentson the route to an aid distribution site in Gaza run by GHF. The UK's ambassador to the UN Barbara Woodward explained that she voted in favour of the draft resolution because Britain wants the \"intolerable situation in Gaza needs to end\" and that the country sees a ceasefire as the best way to \"achieve a long-term political solution\". She added that Israel needs to \"end its restrictions\" on aid now and \"let the UN and humanitarians do their job to save lives, reduce suffering and maintain dignity\". Israel launched a military campaign in Gaza in response to Hamas' attacks on 7 October 2023, in which about 1,200 people were killed, and 251 others were taken hostage. At least 54, 000 people have been killed in Gaza since then, including 4,201 since Israel resumed its offensive on 18 March, according to the territory's health ministry."
    },
    {
      "headline": "Rare oil portrait of Mahatma Gandhi to be auctioned in London",
      "summary": "The auction house Bonhams says this is \"thought to be the only oil portrait that Gandhi actually sat for\".",
      "link": "https://www.bbc.com/news/articles/cp3nl6gq7vlo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/86af/live/26a1ff20-4108-11f0-b919-4b461b216c83.jpg.webp",
      "date": "4 hrs ago",
      "category": "London",
      "full_text": "A rare oil portrait of Indian independence leader Mahatma Gandhi - painted in 1931 in the UK - will be auctioned in London next month. Gandhi led a non-violent resistance movement against British rule in India and his teachings have inspired millions. Most Indians revere him as the \"father of the nation\". Over the years, several paintings, drawings and sketches of him have circulated around the world. The auction house Bonhams says the painting, made by British artist Clare Leighton, is \"thought to be the only oil portrait that Gandhi actually sat for\". The portrait was made when Gandhi went to London in 1931 for the second Round Table conference, held to discuss constitutional reforms for India and address its demands for self-governance. It will be auctioned in the second week of July at Bonhams. \"This is a painting of unique historic and cultural significance. It would be great if it could be seen and appreciated more widely, whether in India or elsewhere,\" Caspar Leighton, a great nephew of the artist, told the BBC. According to Bonhams, Clare Leighton \"was one of the very few artists admitted to his office and was given the opportunity to sit with on multiple occasions to sketch and paint his likeness\". The works remained in the artist's collection until her death in 1989 in the US, after which it was passed down through her family. She was introduced to Gandhi through her partner and British political journalist, Henry Noel Brailsford, who was a strong supporter of India's independence movement. In November 1931, Leighton showcased her portraits of Gandhi at an exhibition at the Albany Galleries in London. Though Gandhi did not attend the opening event, several representatives from the Indian delegation of the second Round Table were present. Among them was Sarojini Naidu, also an eminent Indian independence leader, who was one of the key advisors to Gandhi at the meeting. The exhibition included a charcoal sketch of Gandhi, asleep in his office, along with the oil portrait that is now set to be auctioned. About the painting of Gandhi, British Journalist Winifred Holtby wrote: \"The little man squats bare-headed, in his blanket, one finger raised, as it often is to emphasise a point, his mouthparted for a word that is almost a smile\". The following month, Gandhi's personal secretary Mahadev Desai wrote to Leighton, saying, \"many of my friends who saw it [the oil portrait] in the Albany Gallery said to me that it was a good likeness\". There doesn't seem to be any public record of the oil portrait being displayed elsewhere until 1978, when the Boston Public Library organised an exhibition of Leighton's works. However, according to the artist's family, the portrait was thought to have been on display in the 1970s in the US, where it was allegedly damaged in a knife attack. A label attached to the backing board of the portrait says it was restored by the Lyman Allyn Museum Conservation Laboratory in Connecticut in 1974. The details of the alleged attack are not clear - according to Bonhams, it was carried out by a right-wing Hindu activist. Hindu hardliners in India accuse Gandhi of having betrayed Hindus by being too pro-Muslim, and blame him for the division of India and the bloodshed that marked Partition, which saw India and Pakistan created after independence in 1947. He was shot dead on 30 January 1948 at a prayer meeting by Nathuram Godse, an activist with nationalist right-wing groups."
    },
    {
      "headline": "New trailer for Wicked sequel takes fans back to Oz",
      "summary": "Cynthia Erivo and Ariana Grande will return for the second half of The Wizard of Oz spin-off.",
      "link": "https://www.bbc.com/news/articles/cx2e187e1njo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/4147/live/4c8eadd0-4155-11f0-b6e6-4ddb91039da1.jpg.webp",
      "date": "8 hrs ago",
      "category": "Culture",
      "full_text": "The first full-length trailer for Wicked's forthcoming sequel has been released, offering fans a glimpse of how the Wizard of Oz spin-off will conclude. Wicked: For Good will see Cynthia Erivo return as Elphaba, the Wicked Witch of the West, alongside Ariana Grande as Glinda the Good Witch of the North. The sequel picks up where the first film left off and covers the years after Elphaba and Glinda's decision to part ways. Elphaba is now an enemy of the state of Oz, while Glinda has become a public figure controlled by the Wizard. The new trailer shows Glinda's bedroom window cracking. She goes outside to her balcony to search for Elphaba, who then appears next to her from the shadows. It also teases the arrival of Dorothy - seen walking down the yellow brick road with her friends - suggesting the character might have a bigger role in the films than in the musical. But the actress who plays her has not yet been revealed. At another point in the trailer, Elphaba is seen writing the phrase \"Our wizard lies\" in the clouds above Oz using her broom stick. Other highlights include Elphaba receiving a handwritten note from Glinda reading: \"I hope you get what your heart desires.\" The trailer ends with Elphaba saying she's \"off to see the Wizard\" before flying on a broom into the distance with her winged monkeys. Director Jon M Chutold Vanity Fair:\"Our heart was broken when Glinda can't make the choice that we want her to so badly at the end of movie one, and it feels empowering for Elphaba to fly away from society. \"In movie two, we get to see the consequences of those choices. The temperature is up.\" The films have been adapted from the hugely successful Broadway and West End musical, which itself was based on Gregory Maguire's 1995 novel. However, the stage musical was split into two films for its big-screen adaptation, with the second due to be released on 21 November. The two movies were shot simultaneously at Elstree Studios in Hertfordshire between December 2022 and January 2024, with production interrupted mid-way through by the Hollywood actors' strike. Wicked wasthe highest-grossing movie of 2024 in the UK,and scored 10 Oscar nominations - winning two for best costume and production design. At two hours 40 minutes, the first film alone was almost as long as the entire length of the stage show. Erivo and Grande's chemistry and real-life friendship prompted several viral interview moments during the first film's promotional run last year, and the pair jointly opened the Academy Awards in March with a Wicked medley. But one challenge facing the sequel is that most of the best known songs from the musical, such as Defying Gravity, Popular and The Wizard And I, featured in the first film. The forthcoming follow-up will feature two brand new songs,with Chu explaining:\"They're great additions to this movie. They were necessary in this movie to help tell the story.\" Two other Wicked staples - For Good and No Good Deed - will also appear in part two. The sequel will see Grande and Erivo joined once again by co-stars Michelle Yeoh, Jonathan Bailey and Jeff Goldblum as the Wizard. Grande's Glinda is seen in the trailer wearing a wedding dress, suggesting she may be about to marry Bailey's Fiyero, who - echoing the lyrics to the title track For Good - promises he has \"changed\". Meanwhile, Goldblum's wizard is seen declaring to Dorothy, the tin man, scarecrow and lion: \"Get me the broom of the Wicked Witch of the West.\" One of the teaser's most emotional moments comes when Elphaba is seen telling Glinda: \"You're the only friend I've ever had.\" \"And I've had so many friends,\" laughs a characteristically self-assured Glinda. \"But only one that mattered.\""
    },
    {
      "headline": "Battle of Ballon d'Or favourites - Yamal v Dembele in Nations League",
      "summary": "Ousmane Dembele and Lamine Yamal, the two favourites for the Ballon d'Or, go head to head in Thursday's Nations League semi-final.",
      "link": "https://www.bbc.com/sport/football/articles/clygx8qvl99o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/69d9/live/aa486950-3fb8-11f0-938e-7bd46ec5bc3d.jpg.webp",
      "date": "1 hr ago",
      "category": "Football",
      "full_text": "Lamine Yamal and Ousmane Dembele met in last season's Champions League, with PSG winning their quarter-final tie on aggregate Ousmane Dembele and Lamine Yamal, the two favourites for the Ballon d'Or, go head to head in Thursday's Nations League semi-final. Dembele's France and Yamal's Spainmeet in Stuttgart(20:00 BST) for a place in Sunday's final against Portugal - after the conclusion of remarkable domestic seasons for both. As well as impressing for their clubs, both netted in their country's respective Nations League quarter-final victories. Yamal played down any suggestion this match would have an impact in the Ballon d'Or decision - with the winner announced on 22 September in Paris. \"If you were voting for the Ballon d'Or, would you choose the best player of the year, or the one who wins the match on Thursday?\" the 17-year-old told El Partidazo de COPE. \"Whether we win or not, I would vote for the best player of the year. \"I'm not thinking about the trophy or whether I'm going to win. You'll do badly if you think you have to win it. What I do is play and try to win.\" BBC Sport compares their stats and looks at the seasons that two of the most exciting forwards in world football have just completed. How is the Ballon d'Or winner decided? Ronaldo winner sends Portugal into Nations League final Paris St-Germain forward Dembele is well clear of Barcelona winger Yamal for goals (33 v 18) but the Spaniard beats his French rival for assists (21 v 13). Across all competitions, Yamal, despite being 11 years younger, played significantly more than Dembele this season - 4,548 to 3,286 minutes - and in a tougher league in terms of the general level of competition. Yamal has taken more shots overall (but fewer per 90 minutes) while Dembele's conversion rate is much higher. And Yamal ranks much higher for dribbles than Dembele, with a higher success rate on them too. The Spaniard has won possession more times, tackled more and won more duels than the Frenchman. In terms of trophies, both won their domestic double, plus their Community Shield equivalents - and Dembele lifted the Champions League. This video can not be played Dembele \"best player in the world\" Dembele delivering the season he has had would have been unthinkable even seven months ago, and winning the Ballon d'Or would completeone of football's greatest revivals. This season has already resulted in the 28-year-old being named the Champions League's player of the season and the Ligue 1 Golden Boot winner. His career looked destined to be one of of unfulfilled potential, and he has admitted himself for years he lacked professionalism. He once cost Barcelona a fee of £96.8m, potentially rising to £135.5m. But before this season he had only managed double figures for goals in a league campaign once, his first in senior football for Rennes (12 goals in 2015-16). Maybe he was best known in England for missing the chance to put Barca 4-0 up in their 2019 Champions League semi-final, withthe Reds going on to win 4-3 on aggregate. Even approaching the halfway point of the season, he was only having a fairly average one by his standards - with five goals before playing Lyon on 15 December. But everything changed that day as Luis Enrique moved him from his more accustomed right-wing berth to play him at centre forward - and he netted in a 3-1 win. That was part of a run of 18 goals in 10 games. After that he chipped in goals at a regular rate. Even with a return of one goal in his final 10 games of the season, he ended on 33 - with 21 in the league making him Ligue 1's top scorer. Dembele has also performed for his country, netting in Nations League wins over Belgium and Croatia - doubling his tally of competitive goals in a France shirt. He also managed 13 assists for PSG, including two inthe record-breaking 5-0 Champions League final winover Inter Milan. \"I would give the Ballon d'Or to Mr Ousmane Dembele,\" PSG boss Luis Enrique said in Munich. \"The way he defended, just that alone could be worth the Ballon d'Or. That's how you lead a team: goals, trophies, leadership, defence, his pressing.\" Unlike Yamal, Dembele still has the Fifa Club World Cup to play in this summer to cement his claims. Discipline, injuries & family - how Dembele turned career around This video can not be played Lamine Yamal - The Boy King Yamal is achieving things few 17-year-olds have ever done before. Before his 18th birthday - which he will celebrate on 13 July - he has alreadywon the European Championship with Spain, La Liga, the Copa del Rey, plus a Spanish Super Cup while in the colours of Barca. He has actually won two La Liga titles, as he played once as a 15-year-old in 2022-23. But in the space of two years his influence has grown significantly as Yamal, who has already passed 100 appearances for Barcelona, scored 18 goals and made 25 assists in 55 games this season. He was named in the Champions League team of the year after some remarkable displays - including inthe thrilling semi-final defeat by Inter Milan. \"Lamine is the kind of talent that comes along every 50 years, and to see him up close really impressed me,\" said opposition manager Simone Inzaghi. \"He caused us huge problems because we were supposed to double up on him and it wasn't enough.\" It is not just the quantity of Yamal's goals but the quality and big-game nature of them. He netted three goals in four Clasicos against Real Madrid this season, plus a fantastic strike in that epic tie against Inter. And he struck in the Nations League quarter-final against the Netherlands. The CIES Football Observatory recentlyvalued him at 400m euros (£340m). Yamal recently signeda new six-year deal with Barca, and BBC pundit Stephen Warnock called him \"a future Ballon d'Or winner\". Brazil legend Ronaldo is the youngest winner of the award at the age of 21 - so Yamal has three attempts to break that record. 'A talent that comes along every 50 years' - 'genius' Yamal steals show Stunning stats and 'Ronaldo behaviour' - is Yamal cut out to rival Messi? Listen to the latest Football Daily podcast Get football news sent straight to your phone"
    },
    {
      "headline": "Where Swiatek v Sabalenka showdown will be decided",
      "summary": "The French Open gears up for Iga Swiatek - the reigning champion - against world number one Aryna Sabalenka in the women's semi-finals.",
      "link": "https://www.bbc.com/sport/tennis/articles/cvgv0q76kw6o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/81ff/live/fbbab160-4154-11f0-b3bc-357ab6fd9b3c.jpg.webp",
      "date": "1 hr ago",
      "category": "Tennis",
      "full_text": "Iga Swiatek (left) and Aryna Sabalenka have won six of the past 10 Grand Slam titles between them When the French Open draw was made a fortnight ago, it was the potential women's match that everyone had their eye on. Iga Swiatek - the reigning champion known as the 'Queen of Clay' - against world number one Aryna Sabalenka in the semi-finals. The pair have dominated the WTA Tour over the past three years, leading to an era-defining rivalry that resumes when they meet in the last four at Roland Garros on Thursday. \"It is the blockbuster of the entire tournament on the women's side,\" said former world number nine Andrea Petkovic, who will be analysing the match for BBC Radio 5 Live. Poland's Swiatek, seeded fifth, is bidding for a fourth straight title while Belarusian rival Sabalenka is seeking to snatch the crown for the first time. They have never played each other at the clay-court Grand Slam and it will be the first time they have met competitively since the Cincinnati Open last August. Swiatek, 24, leads their head-to-head record, with eight wins from 12 matches, including five of six meetings on clay. But with questions still lingering over the four-time champion's game, can 27-year-old Sabalenka end her rival's formidable record? Boisson beats Andreeva to continue Paris fairytale Gauff battles past Keys to reach semi-finals Coming into Roland Garros, it was clear to see Swiatek's reign was under threat. The former world number one has dropped to her lowest ranking since 2022, having not reached a tour-level final since claiming last year's French Open. It was the first time she arrived in Paris without winning a title in the clay-court swing since her maiden major triumph in 2020. After a humbling defeat by Danielle Collins in the Italian Open third round, Swiatek insisted her previous French Open record would count for nothing. But she has improved match by match, and the manner with which she fought back from a set down against Elena Rybakina in the last 16 felt like a renaissance moment. \"Before the tournament started I put Iga as third favourite - after Aryna and Coco Gauff,\" said Petkovic. \"But I changed my opinion after I saw her match against Rybakina. I saw the old mental strength of Iga in the most important moments.\" While it feels like Swiatek is still short of her very best level, the frustration she showed earlier in the clay-court swing has rarely been evident. She has regained more trust in her damaging top-spin forehand, taking it more regularly from the centre of the court. \"Against the best movers in the world, you won't hit as many winners on the backhand, no matter how good it is - so you have to go with your forehand,\" said Petkovic. \"Her forehand is the biggest weapon on the clay courts because it has more spin, more margin and can really jump out of the strike zone of Sabalenka.\" Stepping back in her returning position - like she did against Rybakina - may also be a key tactic against another big server. \"Swiatek always returns from the same position every single time, no matter who is serving. That works well against players who don't serve well,\" Petkovic added. \"But against the Rybakinas - and the Sabalenkas - this is a dangerous thing. \"If you don't see the ball early enough you will be under pressure right away.\" Three-time Grand Slam champion Sabalenka replaced Swiatek at the top of the rankings last year and has opened a commanding lead over her rivals this season. With 39 wins from 45 matches, her powerful style transcends surfaces and is backed up by an unparalleled consistency. Sabalenka, who has won three WTA titles this year, is the first player to reach the quarter-finals at 10 consecutive Grand Slams since American great Serena Williams between 2014 and 2017. To reach her first French Open final, she will have to find a way to end Swiatek's 26-match winning streak on the Paris clay. \"The most important thing for Aryna - against anybody in the world - is whether she can control the first two to three shots. That's where she makes the difference,\" said Petkovic. \"It doesn't mean she has to win the point in the first two or three shots, but she has to be able to gain control. \"If she is able to do that, I think it will be very hard for Iga to win.\" Sabalenka, whose also reached the 2023 semi-finals, is becoming more than just a ball crusher as she looks to evolve her game. She is playing with increasing variety and has used the drop-shot effectively in Paris, although the speed of Swiatek may be able to neutralise that option. \"I'm going to play with my power, because this is something where I feel the most comfortable,\" said Sabalenka. \"But when you put the other player on the back foot, it's really important to mix it up little bit just so they guess every time.\" To paraphrase an old saying, Swiatek and Sabalenka appear to have decided it is better to keep your rivals even closer than your friends. The pair practised together in the off-season and shared a court again at Roland Garros before the tournament started. Swiatek played down the significance of the session, which took place as she looked to rediscover her game. \"It's great always to practice with Aryna. She gives a great rhythm and the practice will have quality,\" said Swiatek, who has dropped just one set in the tournament so far. \"But, honestly, it was two weeks ago. It was the first points that I played after Rome. I think a lot has changed since then.\" Swiatek and Sabalenka share a joke at the WTA Finals in Saudi Arabia last year Swiatek believes the rivalry is \"pushing\" both players to greater heights, while Sabalenka says they have also bonded more away from the court. On the face of it, the pair have little in common. Swiatek is the bookish introvert, Sabalenka is the Tiger-monikered extrovert. Doing a TikTok video together at last year's WTA Finals has helped forge what Sabalenka described as a \"better relationship\". But, on Thursday, it will be strictly business. \"I love these challenges. I am always excited to face someone strong who can challenge me,\" said Sabalenka. \"I go out there and I fight, and I'm ready to leave everything I have to get the win.\" Live scores, results and order of play Get tennis news sent straight to your phone"
    },
    {
      "headline": "Battle of Ballon d'Or favourites - Yamal v Dembele in Nations League",
      "summary": "Ousmane Dembele and Lamine Yamal, the two favourites for the Ballon d'Or, go head to head in Thursday's Nations League semi-final.",
      "link": "https://www.bbc.com/sport/football/articles/clygx8qvl99o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/69d9/live/aa486950-3fb8-11f0-938e-7bd46ec5bc3d.jpg.webp",
      "date": "1 hr ago",
      "category": "Football",
      "full_text": "Lamine Yamal and Ousmane Dembele met in last season's Champions League, with PSG winning their quarter-final tie on aggregate Ousmane Dembele and Lamine Yamal, the two favourites for the Ballon d'Or, go head to head in Thursday's Nations League semi-final. Dembele's France and Yamal's Spainmeet in Stuttgart(20:00 BST) for a place in Sunday's final against Portugal - after the conclusion of remarkable domestic seasons for both. As well as impressing for their clubs, both netted in their country's respective Nations League quarter-final victories. Yamal played down any suggestion this match would have an impact in the Ballon d'Or decision - with the winner announced on 22 September in Paris. \"If you were voting for the Ballon d'Or, would you choose the best player of the year, or the one who wins the match on Thursday?\" the 17-year-old told El Partidazo de COPE. \"Whether we win or not, I would vote for the best player of the year. \"I'm not thinking about the trophy or whether I'm going to win. You'll do badly if you think you have to win it. What I do is play and try to win.\" BBC Sport compares their stats and looks at the seasons that two of the most exciting forwards in world football have just completed. How is the Ballon d'Or winner decided? Ronaldo winner sends Portugal into Nations League final Paris St-Germain forward Dembele is well clear of Barcelona winger Yamal for goals (33 v 18) but the Spaniard beats his French rival for assists (21 v 13). Across all competitions, Yamal, despite being 11 years younger, played significantly more than Dembele this season - 4,548 to 3,286 minutes - and in a tougher league in terms of the general level of competition. Yamal has taken more shots overall (but fewer per 90 minutes) while Dembele's conversion rate is much higher. And Yamal ranks much higher for dribbles than Dembele, with a higher success rate on them too. The Spaniard has won possession more times, tackled more and won more duels than the Frenchman. In terms of trophies, both won their domestic double, plus their Community Shield equivalents - and Dembele lifted the Champions League. This video can not be played Dembele \"best player in the world\" Dembele delivering the season he has had would have been unthinkable even seven months ago, and winning the Ballon d'Or would completeone of football's greatest revivals. This season has already resulted in the 28-year-old being named the Champions League's player of the season and the Ligue 1 Golden Boot winner. His career looked destined to be one of of unfulfilled potential, and he has admitted himself for years he lacked professionalism. He once cost Barcelona a fee of £96.8m, potentially rising to £135.5m. But before this season he had only managed double figures for goals in a league campaign once, his first in senior football for Rennes (12 goals in 2015-16). Maybe he was best known in England for missing the chance to put Barca 4-0 up in their 2019 Champions League semi-final, withthe Reds going on to win 4-3 on aggregate. Even approaching the halfway point of the season, he was only having a fairly average one by his standards - with five goals before playing Lyon on 15 December. But everything changed that day as Luis Enrique moved him from his more accustomed right-wing berth to play him at centre forward - and he netted in a 3-1 win. That was part of a run of 18 goals in 10 games. After that he chipped in goals at a regular rate. Even with a return of one goal in his final 10 games of the season, he ended on 33 - with 21 in the league making him Ligue 1's top scorer. Dembele has also performed for his country, netting in Nations League wins over Belgium and Croatia - doubling his tally of competitive goals in a France shirt. He also managed 13 assists for PSG, including two inthe record-breaking 5-0 Champions League final winover Inter Milan. \"I would give the Ballon d'Or to Mr Ousmane Dembele,\" PSG boss Luis Enrique said in Munich. \"The way he defended, just that alone could be worth the Ballon d'Or. That's how you lead a team: goals, trophies, leadership, defence, his pressing.\" Unlike Yamal, Dembele still has the Fifa Club World Cup to play in this summer to cement his claims. Discipline, injuries & family - how Dembele turned career around This video can not be played Lamine Yamal - The Boy King Yamal is achieving things few 17-year-olds have ever done before. Before his 18th birthday - which he will celebrate on 13 July - he has alreadywon the European Championship with Spain, La Liga, the Copa del Rey, plus a Spanish Super Cup while in the colours of Barca. He has actually won two La Liga titles, as he played once as a 15-year-old in 2022-23. But in the space of two years his influence has grown significantly as Yamal, who has already passed 100 appearances for Barcelona, scored 18 goals and made 25 assists in 55 games this season. He was named in the Champions League team of the year after some remarkable displays - including inthe thrilling semi-final defeat by Inter Milan. \"Lamine is the kind of talent that comes along every 50 years, and to see him up close really impressed me,\" said opposition manager Simone Inzaghi. \"He caused us huge problems because we were supposed to double up on him and it wasn't enough.\" It is not just the quantity of Yamal's goals but the quality and big-game nature of them. He netted three goals in four Clasicos against Real Madrid this season, plus a fantastic strike in that epic tie against Inter. And he struck in the Nations League quarter-final against the Netherlands. The CIES Football Observatory recentlyvalued him at 400m euros (£340m). Yamal recently signeda new six-year deal with Barca, and BBC pundit Stephen Warnock called him \"a future Ballon d'Or winner\". Brazil legend Ronaldo is the youngest winner of the award at the age of 21 - so Yamal has three attempts to break that record. 'A talent that comes along every 50 years' - 'genius' Yamal steals show Stunning stats and 'Ronaldo behaviour' - is Yamal cut out to rival Messi? Listen to the latest Football Daily podcast Get football news sent straight to your phone"
    },
    {
      "headline": "'I know the demands' - Martin confirmed as Rangers' head coach",
      "summary": "Russell Martin is Rangers' new head coach, with the former Southampton boss signing a three-year contract saying \"I know what this club demands\" at the start of a fresh era at Ibrox.",
      "link": "https://www.bbc.com/sport/football/articles/cd0lrv9xnxvo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/d497/live/fc2bf940-41e2-11f0-835b-310c7b938e84.jpg.webp",
      "date": "2 hrs ago",
      "category": "Rangers",
      "full_text": "BBC Scottish Football Podcast 05//6/2025 Russell Martin insists he knows \"what this club demands\" after signing a three-year contract to become Rangers' new head coach at the start of a fresh era at Ibrox. The former Southampton and Swansea City boss emerged as the leading candidate from a recruitment process that reportedly also included former Real Madrid assistant Davide Ancelotti and former Rangers manager Steven Gerrard. A US-based consortium, led by Andrew Cavenagh and including the investment arm of the San Francisco 49ers,completed a takeoverof the club last week. And one of their first major appointments is 39-year-old former Scotland defender Martin, who spent time at Ibrox on loan as a player. \"From my time here, I had a taste of how special this club is, the expectation, the passion and the history,\" he said. \"As I return, I'm determined to bring success back. Who is new Rangers boss Martin? What can Rangers fans expect from Martin? \"I'm here to set standards, work hard and do my very best to earn the respect of the Rangers fans. \"There's a lot to be done, but the goal is clear: win matches, win trophies and give Rangers fans a team that they can be proud of. \"We want to play with bravery, to take the ball, to be aggressive, and to stand up in the big moments.\" Martin's role is as head coach rather than manager - in keeping with Rangers' new set up with former sporting director Kevin Thelwell now in post alongside his former Everton colleague, Dan Purdy, as technical director. He will be joined at Rangers by assistant Matt Gill and performance coach Rhys Owen. No further additions to the coaching staff have yet been confirmed. Martin is expected to speak to the media later on Thursday. Rangers chief executive Patrick Stewart, who led the head coach search along with Thelwell, said Martin was the \"standout candidate\". The Ibrox club spoke to former Real Madrid assistant manager Davide Ancelotti and former Feyenoord manager Brian Priske, while former manager Gerrard and ex-Ajax head coach Francesco Farioli were among those also linked with the post. \"Our criteria were clear: we wanted a coach who will excel in terms of how we want to play, improve our culture, develop our squad, and ultimately win matches,\" Stewart said. \"This appointment is about building a winning team and a strong culture. He is no stranger to our club, we expect success and Russell knows that. We are excited for his leadership.\" Thelwell suggested Martin's time in the Premier League \"has sharpened his approach, both tactically and personally\". Giving an insight into what a Rangers team under Martin will be like, he added: \"His teams play dominant football, they control the ball, dictate the tempo and impose themselves physically. They press aggressively and work relentlessly off the ball. \"These are all characteristics that we believe are required to be successful at home, away and abroad.\" Martin began his managerial career with League One club MK Dons in 2019, finishing 19th in his first - Covid-curtailed - season and 13th in the following one. He won 30 and lost 31 of his 80 matches, giving him a win record of 37.5%. That was enough to persuade Swansea City to entice him to the Championship club in summer 2021. His 99 games in charge yielded 36 wins and the same number of losses - a win ratio of 36.4%. The Welsh club finished 15th in his first season and 10th in the second. In June 2023, Martin switched to league rivals Southampton, where he led his side to a 25-game unbeaten run that culminated in a play-off victory over Leeds United and promotion to the top flight. However, he was sacked in December after only one league win in 16 matches and his side sitting bottom of the league - giving an overall record of 33 wins and 26 losses, a win rate of 45.2%. More on Rangers' Martin appointment & your views Get Rangers news notifications in the BBC Sport app This video can not be played Match of the Day 2: Southampton sack Russell Martin Anyone who saw Martin play can attest to his steely competitiveness. A gentle Sussex accent and impressive articulacy belie a turbulent upbringing, with his late father's violence and gambling leading to upheaval. Martin has spoken candidly of a complex relationship with his Scottish dad, who vacillated between doting and controlling and pushed him and his brothers hard as their first football coach. \"My whole world revolved around proving him wrong and making him proud,\" he told The Times in November 2023. He cleaned toilets before school and worked night shifts in a supermarket prior to his move into the professional ranks at the relatively late age of 18. He also had to battle ulcerative colitis during his career, changing to a vegan diet to combat inflammation after experiments with acupuncture and Chinese herbal remedies. Martin has never been afraid to go his own way. Could it be the right way for Rangers? Read more here Will Martin be a success as Rangers manager? Let us know what you think"
    },
    {
      "headline": "How Chelsea won the race to sign £30m Delap",
      "summary": "Several Premier League clubs made offers to sign Ipswich striker Liam Delap - so why has he opted for Chelsea?",
      "link": "https://www.bbc.com/sport/football/articles/cx2qe069zl1o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/251a/live/a2e8cee0-3d36-11f0-83bc-05219e34eab3.jpg.webp",
      "date": "13 hrs ago",
      "category": "Premier League",
      "full_text": "Liam Delap spent one season at Ipswich after leaving Manchester City Champions League football; the chance to play alongside Cole Palmer; the youngest squad in the Premier League. They were three of the reasons that helped Chelsea win the race to sign Liam Delap. Manchester United, Everton, Nottingham Forest and Newcastle all showed strong interest in the England Under-21 striker after a £30m release clause was activated following Ipswich's relegation from the Premier League. Manchester City had a buy-back option afterselling Delap for £20m last summer,but opted not to use it. Earlier this month, Delap wasgiven permission by Ipswichto speak to several interested clubs. Over the past week it became evident the choice was between Manchester United and Chelsea, but theBlues' final-day victory over Nottingham Forest- which confirmed Champions League qualification - proved a deciding factor. Interested parties were told a week ago that the 22-year-old had made his decision, and he was spotted at Stansted Airport that evening before a medical. He is now likely to join up with his new club for the inaugural summer Club World Cup - instead of playing for England at the European Under-21 Championship. Delap has been a key target for Chelsea all season and it is understood co-owner Behdad Eghbali met David Manasseh, the player's key agent, in Dubai. Eghbali even expressed his fondness for the player to Chelsea fans in Wroclaw before theConference League final. Head coach Enzo Maresca also pitched directly to Delap - as did at least one other manager - in face-to-face talks once Ipswich granted permission. Chelsea sign Ipswich striker Delap in £30m deal Delap will link up with former England Under-21 team-mates Palmer (top left) and Noni Madueke (bottom right) Delap has been impressed with Chelsea's style of play and feels the club will be a good fit. He was also urged to make the move by several former City academy graduates he will join at Stamford Bridge - such as Jadon Sancho, Romeo Lavia, Tosin Adarabioyo and Palmer. Maresca worked with Delap in City's elite development squad, while Chelsea's key recruiter Joe Shields is also known to have a good relationship with the player and his family, and academy director Glenn van der Kraan is one of several other connections between the two Premier League clubs. Ipswich boss Kieran McKenna also retains good relations with the Chelsea hierarchy after being interviewed for their manager's job last summer. And he will hope that helps in a potential move for striker Marc Guiu, who interests Ipswich as a loan replacement for Delap. The 19-year-old Spaniard scored six goals in 14 appearances for Chelsea this season but has missed most of 2025 with a muscle injury. He returned as a late substitute during the Conference League final in Wroclaw. As ever with these situations, Manchester United can draw a positive out of a negative. They felt earlier last week it was coming towards the end game in their pursuit of Delap, and it was between them and Chelsea. Now they know they have lost out. The positive is, with the decision made, they can move on. That is in stark contrast to 2022, when then manager Erik ten Hag delayed for months in a fruitless attempt to sign Frenkie de Jong and United ended up panicking at the end of the transfer window and spent £150m on Casemiro and Antony. But that does not answer the pertinent question: who now? Delap fitted their template of an improving, hungry young player, with scope to reach a high standard - at a set fee. Rasmus Hojlund - who is four days younger than Delap - fitted the same criteria, apart from the last one. And it has not worked out. Nothing I have seen on their post-season trip to Asia makes me feel United have the answer to their goalscoring issues within the club. In fact, it is quite the opposite. The 'safe' but expensive options are Brentford's Bryan Mbeumo and Crystal Palace's Jean-Philippe Mateta. But Mateta is 27 and Mbeumo will be at the Africa Cup of Nations for a month with Cameroon. After that, it is a risk. Former United striker Danny Welbeck scored 10 goals in the Premier League at the age of 34. Is there any merit in bringing him back and taking some of the pressure off Hojlund - or has Ruben Amorim concluded the 22-year-old Denmark international will never be good enough? If so, it is back to Europe to sign another promising forward with no guarantee it will work. Newcastle, Nottingham Forest and Everton also showed interest in Delap. It is understood the pitch by Everton and Moyes made a positive impression on Delap, but the club always understood they were underdogs. Before the penultimate fixture of the season against Ipswich at Goodison Park, Moyes said: \"We would certainly be interested if he was interested in us.\" After the game, Everton fans did their best to persuade Delap to join them at the new Hill Dickinson Stadium - despite a hostile reception following run-ins with Jake O'Brien and Jarrad Branthwaite. Supporters urged him to move to Merseyside as he visited 37 Goodison Road - a house across from the stadium which has a wall featuring footballers' signatures. Ultimately, though, the lure of Champions League football means he plumped for Chelsea. Find all the latest football transfers on our dedicated page"
    },
    {
      "headline": "Where Swiatek v Sabalenka showdown will be decided",
      "summary": "The French Open gears up for Iga Swiatek - the reigning champion - against world number one Aryna Sabalenka in the women's semi-finals.",
      "link": "https://www.bbc.com/sport/tennis/articles/cvgv0q76kw6o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/81ff/live/fbbab160-4154-11f0-b3bc-357ab6fd9b3c.jpg.webp",
      "date": "1 hr ago",
      "category": "Tennis",
      "full_text": "Iga Swiatek (left) and Aryna Sabalenka have won six of the past 10 Grand Slam titles between them When the French Open draw was made a fortnight ago, it was the potential women's match that everyone had their eye on. Iga Swiatek - the reigning champion known as the 'Queen of Clay' - against world number one Aryna Sabalenka in the semi-finals. The pair have dominated the WTA Tour over the past three years, leading to an era-defining rivalry that resumes when they meet in the last four at Roland Garros on Thursday. \"It is the blockbuster of the entire tournament on the women's side,\" said former world number nine Andrea Petkovic, who will be analysing the match for BBC Radio 5 Live. Poland's Swiatek, seeded fifth, is bidding for a fourth straight title while Belarusian rival Sabalenka is seeking to snatch the crown for the first time. They have never played each other at the clay-court Grand Slam and it will be the first time they have met competitively since the Cincinnati Open last August. Swiatek, 24, leads their head-to-head record, with eight wins from 12 matches, including five of six meetings on clay. But with questions still lingering over the four-time champion's game, can 27-year-old Sabalenka end her rival's formidable record? Boisson beats Andreeva to continue Paris fairytale Gauff battles past Keys to reach semi-finals Coming into Roland Garros, it was clear to see Swiatek's reign was under threat. The former world number one has dropped to her lowest ranking since 2022, having not reached a tour-level final since claiming last year's French Open. It was the first time she arrived in Paris without winning a title in the clay-court swing since her maiden major triumph in 2020. After a humbling defeat by Danielle Collins in the Italian Open third round, Swiatek insisted her previous French Open record would count for nothing. But she has improved match by match, and the manner with which she fought back from a set down against Elena Rybakina in the last 16 felt like a renaissance moment. \"Before the tournament started I put Iga as third favourite - after Aryna and Coco Gauff,\" said Petkovic. \"But I changed my opinion after I saw her match against Rybakina. I saw the old mental strength of Iga in the most important moments.\" While it feels like Swiatek is still short of her very best level, the frustration she showed earlier in the clay-court swing has rarely been evident. She has regained more trust in her damaging top-spin forehand, taking it more regularly from the centre of the court. \"Against the best movers in the world, you won't hit as many winners on the backhand, no matter how good it is - so you have to go with your forehand,\" said Petkovic. \"Her forehand is the biggest weapon on the clay courts because it has more spin, more margin and can really jump out of the strike zone of Sabalenka.\" Stepping back in her returning position - like she did against Rybakina - may also be a key tactic against another big server. \"Swiatek always returns from the same position every single time, no matter who is serving. That works well against players who don't serve well,\" Petkovic added. \"But against the Rybakinas - and the Sabalenkas - this is a dangerous thing. \"If you don't see the ball early enough you will be under pressure right away.\" Three-time Grand Slam champion Sabalenka replaced Swiatek at the top of the rankings last year and has opened a commanding lead over her rivals this season. With 39 wins from 45 matches, her powerful style transcends surfaces and is backed up by an unparalleled consistency. Sabalenka, who has won three WTA titles this year, is the first player to reach the quarter-finals at 10 consecutive Grand Slams since American great Serena Williams between 2014 and 2017. To reach her first French Open final, she will have to find a way to end Swiatek's 26-match winning streak on the Paris clay. \"The most important thing for Aryna - against anybody in the world - is whether she can control the first two to three shots. That's where she makes the difference,\" said Petkovic. \"It doesn't mean she has to win the point in the first two or three shots, but she has to be able to gain control. \"If she is able to do that, I think it will be very hard for Iga to win.\" Sabalenka, whose also reached the 2023 semi-finals, is becoming more than just a ball crusher as she looks to evolve her game. She is playing with increasing variety and has used the drop-shot effectively in Paris, although the speed of Swiatek may be able to neutralise that option. \"I'm going to play with my power, because this is something where I feel the most comfortable,\" said Sabalenka. \"But when you put the other player on the back foot, it's really important to mix it up little bit just so they guess every time.\" To paraphrase an old saying, Swiatek and Sabalenka appear to have decided it is better to keep your rivals even closer than your friends. The pair practised together in the off-season and shared a court again at Roland Garros before the tournament started. Swiatek played down the significance of the session, which took place as she looked to rediscover her game. \"It's great always to practice with Aryna. She gives a great rhythm and the practice will have quality,\" said Swiatek, who has dropped just one set in the tournament so far. \"But, honestly, it was two weeks ago. It was the first points that I played after Rome. I think a lot has changed since then.\" Swiatek and Sabalenka share a joke at the WTA Finals in Saudi Arabia last year Swiatek believes the rivalry is \"pushing\" both players to greater heights, while Sabalenka says they have also bonded more away from the court. On the face of it, the pair have little in common. Swiatek is the bookish introvert, Sabalenka is the Tiger-monikered extrovert. Doing a TikTok video together at last year's WTA Finals has helped forge what Sabalenka described as a \"better relationship\". But, on Thursday, it will be strictly business. \"I love these challenges. I am always excited to face someone strong who can challenge me,\" said Sabalenka. \"I go out there and I fight, and I'm ready to leave everything I have to get the win.\" Live scores, results and order of play Get tennis news sent straight to your phone"
    },
    {
      "headline": "India set to count its population after a six-year delay",
      "summary": "The exercise, which was supposed to be held in 2021, has been delayed several times.",
      "link": "https://www.bbc.com/news/articles/cm26pz5zlmlo",
      "image_url": null,
      "date": "2 hrs ago",
      "category": "Asia",
      "full_text": "After a six-year delay, India is finally set to count its population in a two-phase census that will conclude in 2027, the government has announced. India's decennial census is one of the world's largest administrative exercises andprovides critical datafor planning welfare schemes, allocating federal funds, drawing electoral boundaries and making key policy decisions. It was originally due in 2021, but has been delayed several times since. The last census was conducted in2011. Prime Minister Narendra Modi's government had initially cited the Covid-19 pandemic as the main reason but critics have questioned what has taken so long to resume the exercise. On Wednesday, India's home ministry said in a statement that the much-awaited census will be conducted in two phases, with 1 March 2027 as the reference date. For the snow-bound Himalayan regions, which includes the states of Uttarakhand, and Himachal Pradesh, and the region of Ladakh and Jammu and Kashmir, the reference date will be 1 October 2026. It did not, however, specify when the survey would actually begin. For the first time, the government will also collect the caste details - a politically and socially sensitive issue in India - of all its citizens, the statement added. The last time caste was officially counted as part of a national census was in 1931, during British colonial rule. India's census is conducted under the Census Act, 1948, which provides a legal framework for conducting the exercise, but does not specify a fixed schedule for when the census must be conducted or when its results must be published. In 2020, India was set to begin the first phase of the census - in which housing data is collected - when the pandemic hit, following which the government postponed the exercise. In the years since, the government further delayed the exercise several times without any explanation, even as life returned to normal. Experts have  spoken of the consequences this could have on the world's most populous country - such as people being excluded from welfare schemes, and the incorrect allocation of resources. \"The census is not simply a count of the number of people in a country. It provides invaluable data needed to make decisions at a micro level,\" Professor KP Kannan, a development economist,had told the BBC in 2023. Follow BBC News India onInstagram,YouTube,TwitterandFacebook."
    },
    {
      "headline": "New Zealand PM 'shock' as staff member accused of secretly recording women",
      "summary": "PM Christopher Luxon says he has \"zero tolerance\" for women being made to feel unsafe after allegations emerged.",
      "link": "https://www.bbc.com/news/articles/c5yxrp0070ko",
      "image_url": null,
      "date": "3 hrs ago",
      "category": "World",
      "full_text": "A member of New Zealand Prime Minister Christopher Luxon's staff has resigned after being accused of secretly taking photos and videos of women, and recording audio of sex workers. Michael Forbes, Luxon's deputy chief press secretary, offered his \"sincerest apologies to the women I have harmed\". The allegations came to light after a sex worker said she noticed that Forbes' phone had been recording audio while he was in the shower, local news website Stuff reported earlier this week. His phone was later found to contain more photos and videos of women as well as audio recordings of his sexual encounters. There wereimages of women at the gym and in the supermarket, Stuff NZ reported, as well as four videos of women in their homes, with the footage apparently taken from a window. Luxon said Forbes' case came as an \"absolute shock\" and that he had \"zero tolerance for any behaviour that makes women or anyone feel unsafe\". \"My sympathy is with the women who raised these allegations and who were made to feel unsafe due to the actions of this person,\" he said on Thursday, a day after Forbes resigned. Luxon, along with other political leaders, have signalled an openness to changing privacy laws to better protect targets of voyeurism. Police said they received a complaint from a Wellington brothel last July about photos found on a client's phone, but ultimately decided the case did not meet the threshold for prosecution. According to the Stuff report, Forbes' encounter with the sex worker in Wellington happened in July 2024. Forbes reportedly gave the sex worker his phone password after being confronted with the secret audio recording. The woman, together with other sex workers, then found multiple audio recordings of similar sessions, as well as photos and video in the device. At that time, Forbes was the press secretary to social development minister Louise Upston. He became the acting deputy press secretary to Luxon in February. Upston and Luxon said they had not known about the complaint against Forbes, who said in a statement he was \"was in a downward spiral due to unresolved trauma and stress\" at the time of the incident. He said he has since sought professional help, but acknowledged what he had \"failed to do then was make a genuine attempt to apologise\". Luxon on Thursday called for a review of \"inter-agency processes\" after police chief Richard Chambers said the authorities had known about an investigation into Forbes last July but did not flag it to ministers. \"We have to take this incident and understand what has happened here and how it happened, and what more can we do about it,\" Luxon said."
    },
    {
      "headline": "Cologne defuses WW2 bombs after 20,000 evacuated",
      "summary": "The German city cordoned off a huge area, calling it the largest evacuation since the end of World War Two.",
      "link": "https://www.bbc.com/news/articles/cj6r04e870do",
      "image_url": null,
      "date": "10 hrs ago",
      "category": "Europe",
      "full_text": "Authorities in the German city of Cologne have defused three unexploded World War Two bombs after the evacuation of more than 20,000 people. Bomb squad technicians deactivated the American bombs on Wednesday after evacuating an area of around 10,000 sq m (107,639 sq ft) following their discovery in a shipyard in Deutz on Monday. Homes, shops, hotels and schools were told to evacuate, as well as a large hospital and a major train station in what the city called \"the largest operation since WW2\". Cologne was subjected to particularly heavy bombing during WW2 and unexploded ordnance can still pose a danger. Germany's bomb disposal service was only able to begin the operation after all residents in the densely populated area were evacuated. \"If you refuse, we will escort you from your home - if necessary by force - along with the police,\" the authorities said. Residents were told if they refused to leave their homes after the evacuation began they could face expensive fines. Some intensive care patients were helped out in ambulances from the Eduardus Hospital. Finding bombs from WW2 is not unusual in German cities such as Cologne and Berlin, but these bombs were particularly large. The evacuation in the Old Town and Deutz neighbourhoods began with officials going door to door to tell people they must leave their homes. Many of the city's usually bustling streets were eerily deserted as shops, restaurants and businesses were told to stop operating during the day. Cultural institutions including the Philharmonic Hall and many museums were also affected, as well as government buildings, 58 hotels, and nine schools. Transport was severely disrupted, with all roads closed in the area, many trains cancelled and the Messe/Deutz train station was closed from 08:00 local time (07:00BST). The authorities had set up two drop-in centres for people who did not have anywhere to go during the evacuation period. Residents were told to \"stay calm\", bring their ID and any essential medications, and to take care of their pets. For some people, the evacuation was more than a little inconvenient. Fifteen couples were scheduled to get married at Cologne's historic town hall but the ceremonies were relocated to a location in another part of the city, local media reported. This story has been updated to remove an incorrect description of the size of the bombs."
    },
    {
      "headline": "Burundi's ruling party seeks to tighten grip on power",
      "summary": "Voters are heading to the polls following a campaign period marked by reports of political repression.",
      "link": "https://www.bbc.com/news/articles/cdxvk1wdxx0o",
      "image_url": null,
      "date": "6 hrs ago",
      "category": "Africa",
      "full_text": "Voters in Burundi are heading to the polls amid a backdrop of surging inflation, fuel shortages and complaints of political repression. Seats in the National Assembly and local councils are up for grabs but Évariste Ndayishimiye is safe in his role as president as he is serving a seven-year term that ends in 2027. The elections will test the popularity of the governing CNDD-FDD party, a former rebel group which has been in power for the past 20 years. The East African nation was already one of the world's poorest countries, but residents there have been put under further pressure by a recent spike in the price of goods such as food. Opposition parties have complained that their supporters have been harassed and intimidated by members of the CNDD-FDD's youth league, the Imbonerakure. Gabriel Banzawitonde, leader of the APDR party, said: ''People are so intimidated that they tell you they cannot wear any party colours other than the ruling ones'. But he said they were not giving in and \"once in the voting booth, they promise to vote for you\". Several political analysts approached by the BBC declined to talk about the elections for fear of repercussions. One expert, who did not want to be named, said: \"To avoid unnecessary trouble, you keep quiet.\" ''We pointed out from the start that everything was being tailor-made [to fit the ruling party],\" they said, suggesting that a CNDD-FDD win was a done deal. Recently, some party officials have even been suggesting that a one-party system may be beneficial for Burundi. Chronic shortages of foreign currency, which is needed for imports such as medicine and fuel, have led to a decline in Burundi's economic activity. Analysts say that Burundi now runs on less than one month's-worth of foreign currency reserves for imports, while the regional standard is to have at least four months. Queues of cars stretching from service stations for around 100m (330ft) have become a common sight. They often last for days or weeks as motorists wait for fuel, which is being rationed by the authorities. According to the World Bank, the annual domestic income of an average Burundian in 2023 was $193 (£142), the lowest within the East African Community trade bloc. Faustin Ndikumana, an economist and anti-corruption activist, believes Burundi's situation will not improve any time soon. ''Good governance has to be established. We're not there yet,'' he told the BBC. But the governing party and its leader hold an opposing view. President Ndayishimiye has said residents of Bujumbura, Burundi's largest city, \"looked bad in 2005\" but now \"had money to buy shoes, new clothes and to build a house''. And the CNDD-FDD often responds to criticism by reminding Burundians that the party fought for the Hutu ethnic group - who make up the majority of the population - to access power, after four decades of what they considered as oppression by the minority Tutsis. Go toBBCAfrica.comfor more news from the African continent. Follow us on Twitter@BBCAfrica, on Facebook atBBC Africaor on Instagram atbbcafrica"
    },
    {
      "headline": "Ronaldo ends Germany duck - where next in his 1,000 goals pursuit?",
      "summary": "When Cristiano Ronaldo scored the winner in Portugal's Nations League semi-final against Germany, he completed a rare career first.",
      "link": "https://www.bbc.com/sport/football/articles/cewdp10www5o",
      "image_url": null,
      "date": "11 hrs ago",
      "category": "Portugal",
      "full_text": "Cristiano Ronaldo is the joint-second top scorer in the 2024-25 Nations League with seven goals There aren't many things Cristiano Ronaldo hasn't done but beating Germany was one of them - until now. When Ronaldo popped up with the winner in theNations League semi-final in Munich,it extended his record goalscoring total - and ended a long wait. It was the 40-year-old's 137th international goal in 220 caps, and his 937th strike in all football. All three of those totals are men's records. But until now Ronaldo had never experienced a worse record at international level against any other team. He played Germany five times, losing all five - with Portugal last beating them at Euro 2000. But that is now five from six. That means England take the record of the country Ronaldo has played the most times without beating - three (all draws). Although the biggest caveat in the world is needed here. Portugal won two of the three 'draws' on penalties - the Euro 2004 and 2006 World Cup quarter-finals. After Germany, the nation Ronaldo has suffered defeat against most is France - with four losses. But his Portugal side most famously beat France in the Euro 2016 final, and there have been three draws (although that includes a penalty shootout defeat). Ronaldo's goalscoring record against Germany was also poor with just one goal in those five meetings, a total of 450 minutes. That is now two in 540 minutes (so one every 270 minutes). Funnily enough it was against German clubs where he excelled the most in the Champions League, with 28 goals in 26 games. Since turning 30, Ronaldo has scored 85 goals for Portugal. By way of comparison only five other players have ever scored more than 85 goals. So that means in the second half of his international career he has scored more than legends like Ferenc Puskas, Pele, Diego Maradona and Gerd Muller - or current players like Neymar and Harry Kane - have in their entire international careers. \"It's difficult to put into words. He takes each day as an opportunity to get better,\" said Portugal boss Roberto Martinez. \"As a human, when you have success, you wake up and you have less hunger. But not Cristiano.\" While his international teammate, Bernardo Silva, added: \"It's his ambition to keep going. \"It's never easy - to still be hungry to go every day. \"He's been doing this for more than 20 years. It's tough, but he's here with us and we're happy he scored again.\" After Sunday's Nations League final against either France or Spain - who meet on Thursday in Stuttgart (20:00 BST) it is not entirely clear where Ronaldo's club future lies. Ronaldo has been playing for Saudi club Al-Nassr for the past two and a half years but his contract expires this summer. After their final game of the season, he wrote on social media: \"This chapter is over. The story? Still being written. Grateful to all.\" That led many to presume Ronaldo was leaving Al-Nassr. Fifa president Gianni Infantino had said \"there are discussions\" over Ronaldo playing at the Club World Cup this summer. Al-Nassr had failed to qualify - but he would be able to join another team in it, even if just on a short-term deal. Brazilian side Botafogo were the most strongly linked. But now multiple media outlets report that Ronaldo is likely to sign a new contract with Al-Nassr, tying him to the club until he is 42. Ronaldo needs 63 more goals to become the first player to reach 1,000 ever. Brazil legends Pele and Romario both claimed to have scored more than 1,000 goals but they included many unofficial matches, including friendlies - so neither are recognised figures. Ronaldo scored 35 goals for Al-Nassr last season - so would reach the landmark in less than two years if he keeps up that goalscoring rate. Listen to the latest Football Daily podcast Get football news sent straight to your phone"
    },
    {
      "headline": "Delap done - which other strikers will be wanted this summer?",
      "summary": "With the transfer window open, BBC Sport takes a look at which strikers across Europe could be moving in the next few months.",
      "link": "https://www.bbc.com/sport/football/articles/cp92mendm0mo",
      "image_url": null,
      "date": "3 hrs ago",
      "category": "Football",
      "full_text": "Will Jean-Philippe Mateta (left), Ollie Watkins (centre) and Yoane Wissa stay at Crystal Palace, Aston Villa and Brentford respectively? The battle for Liam Delap is over - after the 22-year-old striker moved to Chelsea from Ipswich for £30m. Conference League winners Chelsea beat the likes of Manchester United, Newcastle and Everton to Delap's signature to become the first Premier League club to sign a high-profile striker this summer. But with the clubs that missed out on Delap - plus Arsenal and Liverpool - among those keen for extra firepower, the race to add those all-important extra goals continues. The first part of the summer transfer window closes on 10 June and reopens on 16 June - with sides having until 1 September to bolster their squads. So which other strikers will the major sides be looking at? We have focused on 10 forwards who will be in demand over the next few months. Hugo Ekitike scored a fine long-range strike for Eintracht Frankfurt in the first leg of their Europa League quarter-final against Tottenham 2024-25 stats (all competitions).Appearances:48Goals:22Assists:12Minutes per goal:165.4 French striker Hugo Ekitike, 22, has enjoyed the best goalscoring season of his career, registering 22 goals and 12 assists for Eintracht Frankfurt to help his side finish third in the Bundesliga and earn a Champions League place. He has represented his country at under-21 level and the 6ft 3in (1.91m) frontman has been linked with Chelsea and Liverpool in recent weeks. Frankfurt have already lost one forward to the Premier League this season, with Omar Marmoush joining Manchester City - will his former team-mate join him in England? Serhou Guirassy scored a hat-trick against Barcelona in the second leg of their Champions League quarter-final, but it was not enough as Borussia Dortmund lost 5-3 on aggregate 2024-25 stats (all competitions).Appearances:45Goals:34Assists:6Minutes per goal:111.9 Only England captain Harry Kane scored more Bundesliga goals in 2024-25 than Borussia Dortmund centre-forward Serhou Guirassy's total of 21. He also got 13 goals in the Champions League (joint top with Barcelona's Raphinha) and that form has put the 29-year-old Guinea international on the radar of the top Premier League clubs. Guirassy moved to Dortmund for only £15.4m last summer and has a reported release clause of 70m euros (£60.1m). As well as being in fine scoring form for Sporting, Viktor Gyokeres has been prolific for Sweden, scoring four times in a 6-0 win over Azerbaijan in November 2024-25 stats (all competitions).Appearances:52Goals:54Assists:12Minutes per goal:77.8 Former Coventry City striker Viktor Gyokeres has been in fine form for Portuguese side Sporting this season, scoring an incredible 54 goals in 52 matches. The 26-year-old has been linked with a move to Manchester United, which would see him reunited with former Sporting boss Ruben Amorim, but his goalscoring record is attracting clubs from across Europe. His contract reportedly has a release clause of 100m euros (£83.1m). Jean-Philippe Mateta helped France win a silver medal at the 2024 Olympics, with the side managed by Arsenal legend Thierry Henry 2024-25 stats (all competitions).Appearances:46Goals:17Assists:4Minutes per goal:194.1 Crystal Palace's Jean-Philippe Mateta enjoyed a fine season and began 2025 with eight goals in his first nine games of the year. He ended the campaign on 14 Premier League goals, joint 10th in the charts, and started Palace's 1-0 FA Cup final victory over Manchester City at Wembley as the Eagles won their first major trophy. That victory took his side into next season's Europa League, but will that be enough to convince Mateta to stay at Selhurst Park? Bryan Mbeumo finished as the joint fourth highest Premier League scorer with 20 goals 2024-25 stats (all competitions).Appearances:42Goals:20Assists:9Minutes per goal:178 While not a recognised central striker, Brentford's Mbeumo has been no stranger to playing that role for the Bees. As equally adept on the right, or playing more centrally, Mbeumo would provide an option in two positions for any potential suitor. Manchester United are known to be interested in the 25-year-old Cameroon international, with the likes of Arsenal and Newcastle also linked. With just a year left on his contract, Brentford boss Thomas Frank has admitted the club are open to offers for their talisman, despite wanting to keep him at the club. Victor Osimhen scored 26 goals in 32 games to help Napoli win the Serie A title two seasons ago 2024-25 stats (all competitions).Appearances:41Goals:37Assists:7Minutes per goal:85.8 In 2022-23, Nigeria striker Victor Osimhen helped Napoli win their first Italian title since 1990, but he missed their triumph this season as he had a prolific spell on loan at Turkish side Galatasaray. The 26-year-old has been in prolific form, and among his goals in 2024-25 was a double in his side's 3-2 Europa League win over Tottenham in November. Arsenal, Manchester United and Chelsea are among those that have been heavily linked with the player. Mateo Retegui scored four times for Atalanta in their 5-0 win at Verona in February 2024-25 stats (all competitions).Appearances:49Goals:28.Assists:9Minutes per goal:112.6 Italy international striker Mateo Retegui ended the campaign as the top scorer in Serie A with 25 goals for Atalanta in 2024-25, six more than any other player. The 26-year-old has played in the Champions League for his side this season, and his goals have helped them qualify for next season's competition. Will that be enough for him to stay with Atalanta? A host of Premier League clubs will be watching with interest, ready to pounce if he decides to leave Italy. Benjamin Sesko has been linked with a number of English clubs over the past two seasons 2024-25 stats (all competitions).Appearances:45Goals:21Assists:6Minutes per goal:155.2 Slovenia striker Benjamin Sesko has long been linked with a move to the Premier League as he continues to rapidly build his reputation at RB Leipzig. The 22-year-old is 6ft 5in (1.96m) and will not come cheap because he signed a new \"long-term deal\" with the German side last summer. At the weekend, Sky in Germany were reporting that Arsenal had begun talks with RB Leipzig in an attempt to sign Sesko, who has a release clause worth more than 80m euros (£67.4m). Dusan Vlahovic joined Juventus from Fiorentina in 2022 2024-25 stats (all competitions).Appearances:41Goals:15Assists:5Minutes per goal:171.1 Serbia striker Dusan Vlahovic, whose contract runs until June 2026, is another big target man who has been linked with a move to the Premier League for a long time. The 25-year-old is 6ft 3in (1.91m) and enjoyed another fine season in Italy with Juventus, who had signed him in January 2022 - when Arsenal missed out on the forward. Vlahovic also scored when Juventus beat Manchester City 2-0 in their Champions League tie in December. Ollie Watkins has played 18 times for England, scoring five goals, including the last-minute winner in the Three Lions' 2-1 victory over the Netherlands in the semi-finals of Euro 2024 2024-25 stats (all competitions).Appearances:54Goals:17Assists:14Minutes per goal:210.5 Arsenal made a late bid for England striker Ollie Watkins in the final few days of the winter transfer window, with Aston Villa refusing the reported £40m offer. However, Villa's 2-0 loss to Manchester United on the final day of the Premier League season meant Unai Emery's side missed out on a lucrative Champions League place because their goal difference was worse than Newcastle's. That means Villa will be in the Europa League in 2025-26, so will the Gunners try again for Watkins and have more success with a summer bid? Yoane Wissa joined Brentford from French side Lorient in 2021 for about £7.2m 2024-25 stats (all competitions).Appearances:39Goals:20Assists:4Minutes per goal:153.9 Only five players in the Premier League scored more goals in 2024-25 than Brentford striker Yoane Wissa, who hit the net 19 times. Nottingham Forest and Tottenham were interested in the DR Congo international striker in the January transfer window and Brentford, who missed out on European football for next season, will face a battle to keep Wissa and team-mate Mbeumo. Listen to the latest Football Daily podcast Get football news sent straight to your phone"
    }
  ]
}