{
  "source": "BBC Business",
  "fetch_date": "2025-06-05T18:01:09.080883",
  "article_count": 14,
  "articles": [
    {
      "headline": "US-Boeing deal over crashes 'repugnant' - lawyer for victims' families",
      "summary": "The plane maker has agreed to pay $1.1bn to avoid prosecution over two fatal crashes that killed 346 people.",
      "link": "https://www.bbc.com/news/articles/c5y57p8xnp5o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/cded/live/35dd8e80-41af-11f0-adf4-c3f935b7a9cf.jpg.webp",
      "date": "8 hrs ago",
      "category": "Business",
      "full_text": "A lawyer for 16 families of the victims of a fatal Boeing 737 Max crash, has told the BBC that a deal between the aviation giant and the US Justice Department (DOJ) is \"morally repugnant\". The firm said it agreed to pay $1.1bn (£811.5m) to avoid prosecution over two crashes that killed 346 people, ina filing on Wednesday. Sanjiv Singh, counsel for family members of some of the victims of a 2018 crash in Indonesia, says the deal allows the firm to \"sidestep true criminal accountability\". Boeing has previously said: \"We are deeply sorry for their losses, and remain committed to honouring their loved ones' memories by pressing forward with the broad and deep changes to our company\". The deal includes the company paying $444.5m to families of crash victims. It will also put $455m towards improving its compliance, safety and quality programmes. Under the deal, Boeing also agreed to pay a criminal penalty of $487.2m, although half of that was already paid in 2021. \"Boeing is committed to complying with its obligations under this resolution, which include a substantial additional fine and commitments to further institutional improvements and investments,\" said a company spokesperson. If the deal is approved by a federal judge the plane maker will avoid a criminal fraud trial. \"The [DOJ] agreed that it will not further criminally prosecute the company\", said Boeing in a Securities and Exchange Commission (SEC) filing. The BBC has contacted the DOJ to request further comment on the agreement. Two 737 Max aircraft crashedin separate but almost identical accidents that killed 346 people. In October 2018, all 189 people on a Lion Air flight died after the aircraft crashed into the Java Sea 13 minutes after take-off from Jakarta, Indonesia. In March 2019, an Ethiopian Airlines flight crashed six minutes after take-off from the Ethiopian capital of Addis Ababa. All 157 people on-board were killed. Both crashes were linked to faulty flight control systems. In 2021, Boeingagreed to settle US fraud chargesand admitted deception over hiding information from safety officials about the design of its 737 Max planes. Relatives of the victims will have the chance to appeal this latest deal when it is considered by a federal judge. Mr Singh says the latest agreement has provoked \"visceral outrage\" from his clients and believes the current payout is insufficient. \"If you look at that $1.1bn, it's actually like Boeing paying $10 to escape criminal liability. It's as if they got a misdemeanour ticket or a parking ticket.\""
    },
    {
      "headline": "How airline fees have turned baggage into billions",
      "summary": "The amount carriers now charge for luggage is raising the ire of politicians and consumer groups.",
      "link": "https://www.bbc.com/news/articles/c0qg3ylx2g9o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/99df/live/7c390cc0-3fa6-11f0-9662-93b759fb8bcd.jpg.webp",
      "date": "14 hrs ago",
      "category": "Business",
      "full_text": "With Air Canada and Southwest the latest airlines to charge passengers for check-in luggage, the ballooning cost of such ancillary or \"junk fees\" is provoking anger among politicians and consumer groups. At the same time, sales of suitcases small enough for passengers to take on the plane as hand luggage are booming. Standing outside Toronto's downtown airport, Lauren Alexander has flown over from Boston for the weekend. She describes such additional charges as \"ridiculous\". \"It feels like a trick,\" says the 24-year-old. \"You buy the ticket, you think it's going to be less expensive, then you have to pay $200 (£148) extra [to bring a suitcase].\" To avoid the fee, Ms Alexander instead travelled with a small backpack as hand luggage. Sage Riley, who is 27, agrees, telling the BBC, \"It can be pricey.\" There was a time when checked bags, seat selection and your meals all came as standard on commercial flights. But that all changed with the rise of the budget airlines, says Jay Sorensen of US aviation consultancy IdeaWorks. It was in 2006 when UK low-cost carrier FlyBe became what is believed to be the world's first airline to start charging passengersto check in bags.It charged £2 for a pre-booked item of luggage, and £4 if the customer hadn't paid in advance. Other budget carriers then quickly followed suit, with the so-called flag carriers or established airlines then also doing so, at least on shorter flights. In 2008 American Airlines became the first US airline to charge a fee, $15, for the first checked bag on its domestic routes. Mr Sorenson says such traditional airlines felt they had no choice when they \"began to realise that the low-cost carriers were providing very significant competition\". He adds: \"They felt they had to do something to meet that.\" Fast forward to today, and US airlines alone made $7.27bn from check-in baggage fees last year,according to federal figures.That is up from $7bn in 2023, and $5.76bn in 2019. Little wonder then that more of us are trying to just take carry-on. Kirsty Glenn, managing director of UK luggage firm Antler, confirms that there is an ongoing surge in demand for small suitcases that meet airline dimension limits for carry-on luggage. \"We have seen huge spikes in searches online and on our website,\" she says. Describing a new small-dimension case her company launched in April, Ms Glenn adds: \"Testament to the trend of only travelling with hand luggage, it's sold like crazy.\" At the same time, social media content about travel packing \"hacks\" and luggage that meets airlines' carry-on size measurements, have soared according to travel journalist Chelsea Dickenson. She makes this content for TikTok. \"Social media has really propelled this idea of needing a bag that fits the baggage allowance requirements, says Ms Dickenson. \"It's become a core part of the content that I create and post on social media.\" Ms Dickenson, whose social media following has ballooned to close to a million followers, adds that her luggage videos have become a \"core part of the content\" she creates. \"It blows my mind,\" she says. \"I could spend weeks and weeks researching a big trip, and the resulting videos will not come close to doing as well as me going and buying a cheap suitcase, taking it to the airport, testing it in one of those baggage sizes and reporting back.\" The overall global cost of all airline extra fees, from luggage to seat selection, buying wifi access, lounge access, upgrades, and food and drink, isexpected to reach $145bn this year,14% of the sector's total revenues. That's according to the International Air Transport Association, which represents the industry. This compares with $137bn last year. These numbers have caught the attention of some politicians in Washington, and last December airline bosses were grilled before a senate committee. It was a Democrat senator who used the term\"junk fees\". He wants the federal government to review such costs and potentially fine airlines. We asked the US Department of Transportation for a comment, but did not get a response. But if having to pay for check-in wasn't enough, a growing number of airlines are now charging for hand luggage. For example, Irish budget airline Ryanair will only allow you to carry a small bag that fits under the seat in front of you for free. If you want to take a bigger bag or suitcase to go in the overhead locker that will cost you from £6. Other European airlines that now have similar charges for hand luggage are Easyjet, Norwegian Airlines, Transavia, Volotea, Vueling, and Wizzair. This has annoyed pan-European consumer group Becu (The European Consumer Organisation), which last month filed a complaint with the European Commission. Becu cites a 2014 EU Court of Justice ruling, which said \"carriage of hand baggage cannot be made subject to a price supplement, provided that it meets reasonable requirements in terms of its weight and dimensions, and complies with applicable security requirements\". However, what determines \"reasonable requirements\" continues to be a grey area in need of an official ruling. There can, however, be a different way of doing things, as shown by Indian airline IndiGo. Its boss Pieter Eibers says that it does not charge for check-in luggage. \"The entire philosophy here is different,\" he says. \"We don't want long lines, and endless debates at gates about the weight of luggage. We don't have any of that. We turn our planes around in 35 minutes.\""
    },
    {
      "headline": "How airline fees have turned baggage into billions",
      "summary": "The amount carriers now charge for luggage is raising the ire of politicians and consumer groups.",
      "link": "https://www.bbc.com/news/articles/c0qg3ylx2g9o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/99df/live/7c390cc0-3fa6-11f0-9662-93b759fb8bcd.jpg.webp",
      "date": "14 hrs ago",
      "category": "Business",
      "full_text": "With Air Canada and Southwest the latest airlines to charge passengers for check-in luggage, the ballooning cost of such ancillary or \"junk fees\" is provoking anger among politicians and consumer groups. At the same time, sales of suitcases small enough for passengers to take on the plane as hand luggage are booming. Standing outside Toronto's downtown airport, Lauren Alexander has flown over from Boston for the weekend. She describes such additional charges as \"ridiculous\". \"It feels like a trick,\" says the 24-year-old. \"You buy the ticket, you think it's going to be less expensive, then you have to pay $200 (£148) extra [to bring a suitcase].\" To avoid the fee, Ms Alexander instead travelled with a small backpack as hand luggage. Sage Riley, who is 27, agrees, telling the BBC, \"It can be pricey.\" There was a time when checked bags, seat selection and your meals all came as standard on commercial flights. But that all changed with the rise of the budget airlines, says Jay Sorensen of US aviation consultancy IdeaWorks. It was in 2006 when UK low-cost carrier FlyBe became what is believed to be the world's first airline to start charging passengersto check in bags.It charged £2 for a pre-booked item of luggage, and £4 if the customer hadn't paid in advance. Other budget carriers then quickly followed suit, with the so-called flag carriers or established airlines then also doing so, at least on shorter flights. In 2008 American Airlines became the first US airline to charge a fee, $15, for the first checked bag on its domestic routes. Mr Sorenson says such traditional airlines felt they had no choice when they \"began to realise that the low-cost carriers were providing very significant competition\". He adds: \"They felt they had to do something to meet that.\" Fast forward to today, and US airlines alone made $7.27bn from check-in baggage fees last year,according to federal figures.That is up from $7bn in 2023, and $5.76bn in 2019. Little wonder then that more of us are trying to just take carry-on. Kirsty Glenn, managing director of UK luggage firm Antler, confirms that there is an ongoing surge in demand for small suitcases that meet airline dimension limits for carry-on luggage. \"We have seen huge spikes in searches online and on our website,\" she says. Describing a new small-dimension case her company launched in April, Ms Glenn adds: \"Testament to the trend of only travelling with hand luggage, it's sold like crazy.\" At the same time, social media content about travel packing \"hacks\" and luggage that meets airlines' carry-on size measurements, have soared according to travel journalist Chelsea Dickenson. She makes this content for TikTok. \"Social media has really propelled this idea of needing a bag that fits the baggage allowance requirements, says Ms Dickenson. \"It's become a core part of the content that I create and post on social media.\" Ms Dickenson, whose social media following has ballooned to close to a million followers, adds that her luggage videos have become a \"core part of the content\" she creates. \"It blows my mind,\" she says. \"I could spend weeks and weeks researching a big trip, and the resulting videos will not come close to doing as well as me going and buying a cheap suitcase, taking it to the airport, testing it in one of those baggage sizes and reporting back.\" The overall global cost of all airline extra fees, from luggage to seat selection, buying wifi access, lounge access, upgrades, and food and drink, isexpected to reach $145bn this year,14% of the sector's total revenues. That's according to the International Air Transport Association, which represents the industry. This compares with $137bn last year. These numbers have caught the attention of some politicians in Washington, and last December airline bosses were grilled before a senate committee. It was a Democrat senator who used the term\"junk fees\". He wants the federal government to review such costs and potentially fine airlines. We asked the US Department of Transportation for a comment, but did not get a response. But if having to pay for check-in wasn't enough, a growing number of airlines are now charging for hand luggage. For example, Irish budget airline Ryanair will only allow you to carry a small bag that fits under the seat in front of you for free. If you want to take a bigger bag or suitcase to go in the overhead locker that will cost you from £6. Other European airlines that now have similar charges for hand luggage are Easyjet, Norwegian Airlines, Transavia, Volotea, Vueling, and Wizzair. This has annoyed pan-European consumer group Becu (The European Consumer Organisation), which last month filed a complaint with the European Commission. Becu cites a 2014 EU Court of Justice ruling, which said \"carriage of hand baggage cannot be made subject to a price supplement, provided that it meets reasonable requirements in terms of its weight and dimensions, and complies with applicable security requirements\". However, what determines \"reasonable requirements\" continues to be a grey area in need of an official ruling. There can, however, be a different way of doing things, as shown by Indian airline IndiGo. Its boss Pieter Eibers says that it does not charge for check-in luggage. \"The entire philosophy here is different,\" he says. \"We don't want long lines, and endless debates at gates about the weight of luggage. We don't have any of that. We turn our planes around in 35 minutes.\""
    },
    {
      "headline": "Musk urges Americans to tell lawmakers to 'kill the bill'",
      "summary": "Billionaire says the bill, which faces a key test in the Senate, undercuts efforts to slash federal spending.",
      "link": "https://www.bbc.com/news/articles/c0j76djzgpvo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/86c7/live/71f19820-40a7-11f0-a90d-6b992e1c44a7.jpg.webp",
      "date": "13 hrs ago",
      "category": "US & Canada",
      "full_text": "Elon Musk hit out at President Donald Trump's signature tax and spending bill again on Wednesday, calling on Americans to tell their representatives in Washington to \"kill the bill\". The budget, which includes huge tax breaks and more defence spending, was passed by the House of Representatives last month and is now being considered by senators. The tech billionaire posted on X earlier this week that the bill would add to the US budget deficit and saddle Americans with \"crushing\" debt. On Tuesday, he described it as a \"disgusting abomination\", in a widening rift between the two. The bill has the backing of President Donald Trump and would be the legislative linchpin of his second-term agenda if it passes Congress. \"Shame on those who voted for it,\" said Musk on Tuesday, hinting that he may try to unseat the politicians responsible at next year's midterm elections. Musk left the administration abruptly last week after 129 days working to cut costs with his team, known as Doge. The comments mark his first public disagreement with Trump since leaving government, after having previously called the plan \"disappointing\". Soon after Musk's tweet on Wednesday, the White House sent out a \"myth buster\" statement, calling any assertion that the bill would lead to higher deficits a \"hoax\". \"By every honest metric, President Donald J. Trump's One Big Beautiful Bill dramatically improves the fiscal trajectory of the United States and unleashes an era of unprecedented economic growth,\" the statement reads. It made no mention of Musk or his tweets. The BBC has contacted the White House for comment. The South African-born tech billionaire's time in the Trump administration came to an end on 31 May, although Trump said that \"he will, always, be with us, helping all the way\". In its current form, the bill - which Trump refers to as the \"big beautiful bill\" - has been estimated to increase the budget deficit - the difference between what the government spends and the revenue it receives - by about $600bn (£444bn) in the next fiscal year. In a series of posts on X on Tuesday, Musk said that the \"outrageous, pork-filled\" spending bill will \"massively increase the already gigantic budget deficit to $2.5 trillion (!!!) and burden America [sic] citizens with crushingly unsustainable debt\". In American politics \"pork\" refers to spending on projects in lawmakers' constituencies. Musk has previously vowed to fund campaign challenges against any Republican that votes against Trump's agenda. But on Tuesday he fired a warning to those who backed the bill. \"In November next year, we fire all politicians who betrayed the American people,\" he wrote. Asked about Musk's comments soon after the first post, White House press secretary Karoline Leavitt said \"the President already knows where Elon Musk stood on this bill\". \"This is one, big, beautiful bill,\" she added. \"And he's sticking to it.\" The legislation also pledges to extend soon-to-expire tax cuts passed during the first Trump administration in 2017, as well as an influx of funds for defence spending and to fund the administration's mass deportations of undocumented immigrants. To the dismay of fiscal conservatives, it would lift the limit on the amount of money the government can borrow, known as the debt ceiling, to $4tn. The comments from Musk reflect wider tensions among Republicans over the plan, which faced stiff opposition from different wings of the party as it worked its way through the House. The Senate has now taken it up, and divisions are already emerging in that chamber, which is also narrowly controlled by Republicans. Kentucky Senator Rand Paul has said over the last few days he will not support the bill if it raises the debt ceiling. \"The GOP [the Republican Party] will own the debt once they vote for this,\" he told CBS News, the BBC's US partner, over the weekend. Trump responded to Paul with a series of social media posts, accusing him of having \"very little understanding of the bill\" and saying that the \"people of Kentucky can't stand him\". \"His ideas are actually crazy,\" Trump wrote. Republican lawmakers pushed back on Musk's comments, with Senate majority leader John Thune saying the party plans to \"proceed full speed ahead\" despite \"a difference of opinion\". Thune and other senators met Trump for a \"positive discussion\" on Wednesday, he told reporters at the White House. He downplayed Musk's posts, saying it would do little to scupper the work of lawmakers. \"We are moving forward,\" he said, also adding that \"the wheels are in motion,\" and that \"failure is not an option\". Mike Johnson - the Republican Speaker who has ushered the legislation through the House - told reporters on Capitol Hill that \"my friend Elon is terribly wrong\". \"It's a very important first start. Elon is missing it,\" Johnson said. Johnson said he had a 20-minute phone call with the tycoon about the bill on Monday, adding that its phasing out of electric vehicle tax credits could \"have an effect\" on Tesla, Musk's firm. \"I lament that,\" Johnson said, expressing surprise that Musk criticised the bill despite their call. \"I just deeply regret he's made this mistake.” Among the issues that upset Musk involved air traffic control at the Federal Aviation Administration (FAA), according toAxios. Musk was hoping it would be run on his Starlink satellite system, but he was denied because of issues relating to the technology and the appearance of a conflict of interest, the political outlet reported. Some Democrats welcomed Musk’s comments despite their previous criticism of him and the work of Doge. \"Even Elon Musk, who's been part of the whole process, and is one of Trump's buddies, said the bill is bad,\" Senate Minority Leader Chuck Schumer said. \"We can imagine how bad this bill is.\" Trump and Republicans in Congress have set a deadline of 4 July to get the measure passed and signed into law. Musk supported Trump in last year's November election with donations of more than $250m. To make peace with spending hawks, Trump is also asking Congress to pass a plan that would reduce current spending by $9.4bn, a figure derived from Doge's work. It would mainly slash funding for foreign aid, the United States Agency for International Development (USAID) and for broadcasters NPR and PBS. Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weeklyUS Politics Unspunnewsletter. Readers in the UK cansign up here. Those outside the UK cansign up here."
    },
    {
      "headline": "Stores open at midnight as fans rush to buy Nintendo Switch 2",
      "summary": "One retailer says it's the \"biggest gaming pre-order ever\" - but there questions over whether high prices will dent sales.",
      "link": "https://www.bbc.com/news/articles/ckgxwe774zwo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/a593/live/74e09280-41eb-11f0-ae42-c9936551965a.jpg.webp",
      "date": "1 hr ago",
      "category": "Technology",
      "full_text": "The Nintendo Switch 2 has been released worldwide, with stores opening at midnight so fans could get their hands on the long-awaited console the moment it became available. Some shops have the devices available to buy off the shelf - but in most cases customers have been picking up consoles they had ordered in advance, with UK retailer Currys calling it its \"biggest gaming pre-order ever.\" Despite the excitement there have been some setbacks, with one supplier, Game,cancelling some pre-orders. In the US, Nintendo briefly pulled Switch 2 pre-orders in Aprilover concerns around tariffsbefore starting again a few weeks later. But that doesn't appear to have put fans off- with queues forming at stores around the world as gamers vied to be among the first to unbox their new console. Currys told the BBC it had sold 30,000 units - which it attributed to the \"incredible excitement\" associated with the launch. Despite the initial excitement, questions remain over whether the Switch 2 will match the success of its predecessor - the third-best selling console in history - in part because of its high game prices. A physical copy of its most high-profile game, Mario Kart World, comes in at £74.99 - £15 more expensive than a typical Switch title. The original Nintendo Switch has shifted more than 150 million units since its 2017 release. A successor has been in the works for years - so perhaps unsurprisingly Tushar Sandarka, the President of the University of York's Mario Kart society, is among those excited about the launch, and the new version of Mario coming with it. \"It's coming out with Mario Kart World - which is the first since 2014 - it's a big deal for us,\" the 19-year-old said. \"Securing a pre-order was such a tough decision because it's so expensive. \"Even if it's a bit higher than I would have wanted to pay for it, it's going to serve me well for the next 7 or 8 years.\" But not everyone the BBC spoke to said they would be picking up the console on launch. Mae and Lottie, both students in York, said they would stick to the original Switch because of the cost. \"It's quite spenny,\" Mae said. \"What we've got is fine.\" Lottie agreed, but said she was disappointed not to play on the new Mario Kart game - which she said could cost her as much as \"a day's pay\". \"I'm not spending that on a game,\" she said. For Nintendo, the Switch 2 represents a change in strategy - in the past its new devices have been given an entirely new name. \"This is the first time Nintendo has ever launched a straight sequel,\" GamesRadar+ brand director Sam Loveridge told the BBC. \"It's a clear proposition for consumers - they know exactly what they're getting from this console if they are familiar with the original Switch.\" She said \"everything is pointing to\" pre-orders having sold well. \"When pre-orders first went live, it was an absolute scramble to find any stock, but Nintendo was clearly prepared and since those early weeks, it's been a lot easier to secure yourself a console for launch day,\" she said. I was one of the lucky few to get my hands on the Switch 2 at an event in April. Like its predecessor, it is a \"hybrid\" console - a handheld device which can also be plugged into a TV to play on the big screen. But it has a bigger and brighter screen, along with lots more power and storage. It still has a bit of innovation - you can use the controller like a computer mouse by twisting it on its side, making PC games such as Civilization VII a more enjoyable experience than using joysticks. But many of the showcase Nintendo games on display at that event  - including Metroid Prime 4, Donkey Kong: Bananza, and Super Mario Party Jamboree TV - won't be available at launch. Instead the only new Nintendo game on the new console will be Mario Kart World, barring a small title called Welcome Tour which showcases some of the new hardware. \"It might seem like an odd bet, but with the original Mario Kart 8 being the best-selling Wii U game and Mario Kart 8 Deluxe being the best-selling Nintendo Switch game, there's a very established audience there,\" Ms Loveridge said. The gaming giant is also releasing on day one upgraded versions of the Switch's Legend of Zelda games, Breath of the Wild and Tears of the Kingdom, which take advantage of the console's greater power. Beyond that, gamers will have to look to third-party games for alternatives on launch. The range of games includes Rune Factory: Guardians of Azuma, Cyberpunk 2077, and Bravely Default. \"This more powerful console offers plenty of opportunities for third-party games publishers bringing Nintendo into more direct competition with Sony and Microsoft,\" said Katie Holt, senior games industry research analyst at Ampere Analysis . And fans can expect more from third-party games as the console develops too - with Nintendo senior director Takuhiro Dohta telling me he expected games to get even better. \"When there are software titles set for the launch of the hardware, the developers still don't fully know the capabilities and hardware well enough,\" he said. \"As developers continue to develop, they start to understand how it works and what it's capable of, so I think we can expect improvements not only in graphics but in gameplay too.\" Sign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here."
    },
    {
      "headline": "Musk turns on Republicans - and gives Trump's big bill a harder path",
      "summary": "The billionaire's criticism could embolden Republicans who are considering voting against the tax and spending bill.",
      "link": "https://www.bbc.com/news/articles/cvg5zpn9vkwo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/903f/live/6645acb0-4204-11f0-bace-e1270fc31f5e.jpg.webp",
      "date": "17 hrs ago",
      "category": "US & Canada",
      "full_text": "For 130 days, tech billionaire Elon Musk was a \"special government employee\" working inside the Trump administration to slash what he said were wasteful government programmes and bloated departments. Now, after his exit last week, he is back on the outside. And it is the Trump administration – and the massive spending legislation the president is currently pushing – that is drawing the ire of this new, seemingly unshackled Musk. In a series of social media posts on Tuesday, he took aim at Trump's signature tax and spending bill that is being considered by the Senate after House Republicans passed it last month. After saying he couldn't \"stand it anymore\", Musk called the bill a \"disgusting abomination\". \"Shame on those who voted for it,\" he said. \"You know you did wrong.\" And on Wednesday afternoon he went a step further, calling on voters to contact their representatives in Congress to voice their opposition. \"Bankrupting America is not OK!\" he wrote on X. \"KILL the BILL.\" Musk's diatribe against the Trump-backed bill, which includes huge tax breaks and more investment in defence, comes after he spent months pushing for cuts to government spending. In his posts, he said the legislation would add to the US budget deficit and saddle Americans with debt. He also warned Republicans who supported, or are planning to support, the bill that \"we [will] fire all the politicians who betrayed the American people\" in next year's midterm elections. And it is that line that could be the most concerning for Republicans. In the House, all but three Republican members backed the bill, which passed by a single vote over unified Democratic opposition. If Musk turns on the majority of Republicans - after spending hundreds of millions to support their campaigns last year - it could cause headaches for incumbents worried about facing challenges in party primaries and represent a devastating blow to Republican hopes of retaining control of Congress for the second half of Trump's second term. Although Musk had offered more measured criticism in an interview last week, this week  marks a stark change from the chummy meeting he had with Trump in the Oval Office on Thursday, where he stood, smiling, as Trump expounded on the importance of what he said will be his defining legislative achievement. The president has yet to respond to Musk, but he is sure to be asked about the comments. So far, however, the White House has been handling the situation delicately. According to US media reports, the White House is attempting to explain Musk's vocal opposition as a response to the bill's cuts to green energy subsidies, including tax credits for electric vehicles like Musk's Tesla cars. Axios, meanwhile, reportedthat another source of tension is Trump's decision to pull the nomination of Jared Isaacman – a Musk ally – to be head of the US space agency Nasa. In the halls of Congress on Wednesday, established Trump allies were treading a similarly careful path. \"The bill can be made better, but it's not an abomination,\" Senator Lindsey Graham, a leading figure within the Republican Party and loyal backer of Trump, told the BBC. \"Let's pass this bill,\" he said. \"We can make additional cuts to spending as necessary, but I want to put some points on the board. Get the tax cuts, make them permanent, get money, do the border. But [Musk] is right, we should cut more.\" Speaker Mike Johnson, meanwhile, reportedly spent time pushing back on Musk's criticism of the bill in a closed-door meeting with Republicans. He also tried to reassure members over the billionaire's threats to oust supporters of the bill,according to Politico. On Tuesday, White House Press Secretary Karoline Leavitt said that Trump \"already knows\" Musk's view on the legislation. \"This is one big, beautiful bill, and he's sticking to it,\" she added. Trump may be standing by the legislation, but his task of convincing Senate Republicans to sign off on it will only be more difficult in the face of Musk's opposition. His criticism could encourage Republican budget hardliners in the Senate who were already expressing concern about how Trump's bill will spike the federal deficit by trillions of dollars over the next decade. Several, including Rand Paul of Kentucky, Mike Lee of Utah and Ron Johnson of Wisconsin, have said they cannot vote for the House legislation unless it undergoes significant changes. Musk has been amplifying a steady stream of posts by Paul and Lee on X, including one article headlined \"It's Rand Paul and Elon Musk vs Donald Trump\". If those hardliners have their way and get new spending cuts to popular social programmes, however, centrist Republicans like Senators Lisa Murkowski of Alaska and Susan Collins of Maine are likely to revolt. That matters because, assuming unified Democratic opposition in the US Senate, Republicans can only afford to lose three of the 53 Republicans if they want Trump's bill to pass. Murkowski would not be drawn on the potential impact of Musk's comments on Wednesday, but she told the BBC he is \"an influencer out there, and his words have impact\". Liberated from the constraints of his quasi-governmental job, Musk has tossed a powder keg into all these delicate deliberations to bring the disparate Republican factions into some kind of agreement – and it is not the first time. His criticism sank a government spending bill last year, creating problems it took months for Republicans to solve. Trump has said he wants the legislation on his desk to sign by the Fourth of July congressional recess. That could prove to be a tall task, but it is one that has a pressing deadline behind it. His \"big, beautiful bill\" contains a $4tn increase in the US debt-limit borrowing authority. Treasury department officials say that if that limit is not increased by sometime in August, the nation would face the unprecedented prospect of defaulting on its national debt. Musk's noisy opposition has rested, in part, on his warning that the growing US debt is becoming unsustainable. But if his criticism derails the current efforts to pass the bill in Congress, he could speed up that day of financial reckoning. With additional reporting from Brandon Drenon on Capitol Hill Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weeklyUS Politics Unspunnewsletter. Readers in the UK cansign up here. Those outside the UK cansign up here."
    },
    {
      "headline": "UK chancellor announces £15bn for transport projects",
      "summary": "Money will be spent on tram, train and bus projects in England across the Midlands, North and West Country.",
      "link": "https://www.bbc.com/news/articles/c331ln47e7ko",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/0213/live/ac5b2820-4136-11f0-a580-255b6ce1429e.jpg.webp",
      "date": "22 hrs ago",
      "category": "Politics",
      "full_text": "Billions of pounds of investment in transport infrastructure in England have been announced by Chancellor Rachel Reeves. The money will be spent on tram, train and bus projects in mayoral authorities across the Midlands, the North and the West Country. The move comes before the government's spending review next week, which will determine how much money each Whitehall department gets over the next three to four years. Reeves has been under pressure from Labour MPs to spend money following criticism of relentless economic gloom, particularly concerning disability and benefit cuts. Trams form the backbone of the investment plans, with Greater Manchester getting £2.5bn to extend its network to Stockport and add stops in Bury, Manchester and Oldham, and the West Midlands getting £2.4bn to extend services from Birmingham city centre to the new sports quarter. There will also be £2.1bn to start building the West Yorkshire Mass Transit programme by 2028, and build new bus stations in Bradford and Wakefield. Six more metro mayors will receive transport investments: The transport investment marks Reeves' first open move away from the stringent rules in the Treasury'sGreen Book, which is used by officials to calculate the value for money of major projects. The book has been criticised for favouring London and the south-east. In a speech in Greater Manchester, the chancellor said that sticking to book's rules has meant \"growth created in too few places, felt by too few people and wide gaps between regions, and between our cities and towns\". Changing the rules will also mean more money for areas of the North and Midlands, including the so-called \"Red Wall\", where Labour MPs face an electoral challenge from Reform UK. Reeves is not the first chancellor to review the Treasury's investment rules; former Prime Minister Rishi Sunak also reviewed the book as part of the Conservatives' Levelling up agenda. Sunak had also announced some of these same projects, including the development of a mass transit network in West Yorkshire, in his Network North plan, intended to compensate for the decision to scrap the HS2 line north of Birmingham. Labour reviewed these projects when they came to power in July, arguing they had not been fully funded. Conservative shadow Treasury minister Gareth Davies accused Labour of copying and pasting announcements made by the Conservative government\". Conservative mayor of Tees Valley Ben Houchen said Labour's decision meant projects in his area had been delayed by a year which was \"frustrating\" but added that he was \"absolutely delighted\" the funding had now been given the go ahead. North East Mayor Kim McGuinness said the £1.8bn funding for her area was a \"game changer\", while Liverpool City Region Mayor Steve Rotheram said the investment was a \"massive vote of confidence in our region\". Liberal Democrat Treasury spokeswoman Daisy Cooper warned the chancellor must now deliver, because \"these communities have heard these same promises before, only to be left with phantom transport networks\". She added: \"Extra investment in public transport must also focus on cutting fares for hard-pressed families being clobbered by a cost of living crisis.\" Zoe Billingham, head of the IPPR North think tank, welcomed the investment but said that while money had been provided to lay the tracks there was \"still a question about the ongoing running costs\" and the extent to which the new transport networks would pay for themselves. Following the speech Reeves was asked if there would be funding for a new rail link between Manchester and Liverpool. She replied that there would be \"more to come next week\" when she delivers her Spending Review. Reeves' £15.6bn regional transport announcements are part of a five-year funding allocation from 2027/28 to 2031/32, which a Treasury spokesman confirmed would double the current £1.14bn spending allocation for 2024-25 to £2.9bn by 2029-30. Sign up for our Politics Essential newsletterto read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday."
    },
    {
      "headline": "Trump's 50% tariffs on metals come into effect",
      "summary": "Trump doubles down on his tariffs, while sparing the UK from the latest duties.",
      "link": "https://www.bbc.com/news/articles/cj3j7z73yv2o",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/c593/live/25815770-4109-11f0-b919-4b461b216c83.jpg.webp",
      "date": "15 hrs ago",
      "category": "Business",
      "full_text": "US President Donald Trump has signed an order doubling tariffs on steel and aluminium imports from 25% to 50%. The move hikes import taxes on the metals, which are used in everything from cars to canned food, for the second time since March. Trump has said the measures, which came into effect on Wednesday, are intended to secure the future of the American steel industry. Critics say the protections could wreak havoc on steel producers outside the US, spark retaliation from trade partners, and come at a punishing cost for American users of the metals. Hours before he hiked the duties, many firms directly affected could hardly believe the plan was moving forward, hoping it would turn out to be temporary or some kind of negotiating ploy. Even as Trump signed the orders,the UK was granted a carve-out from the measures, leaving duties on its steel and aluminium at 25%, a move Trump said reflected its ongoing trade discussions with the US. \"Always the question with Mr Trump is, is this a tactic or is this a long-term plan?\" said Rick Huether, chief executive of Independent Can Co, a Maryland-based business, which brings in steel from Europe and turns it into decorative cookie tins, popcorn boxes, and other products. Trump's moves earlier this year had prompted him to put investments on hold and raise prices. He said he feared his customers would turn to alternatives such as plastic or paper boxes due to all of the uncertainty. \"There's a lot of chaos,\" he said. The US is the biggest importer of steel in the world, after the European Union, getting most of the metal from Canada, Brazil, Mexico and South Korea,according to the US government. During his first term, Trump imposed tariffs of 25% on steel and 10% on aluminium, citing a law that gives him authority to protect industries considered vital to national security. But many imports ultimately escaped the duties after the US struck trade deals with allies and granted exemptions to certain imports at the request of firms. Trump ended those carve-outs in March, saying he was unhappy with the way the protections had been weakened. At Friday's rally at the US Steel factory, he said he wanted to make tariffs so high that US businesses would have no alternative but to buy from American suppliers. \"Nobody's going to get around that,\" he said of the 50% rate. \"That means that nobody's going to be able to steal your industry. It's at 25% - they can get over that fence. At 50%, they can no longer get over the fence.\" Steel and aluminium manufacturers in Canada, a major supplier of the metals to the US, have said the doubled tariffs will devastate their industry. Lisa Hepfner, a member of parliament from the city of Hamilton, a major steel hub, said the tariffs mean \"thousands of jobs lost\", and \"the end of the industry\". She called for Canada to amp up its retaliation. But Canada's Prime Minister Mark Carney told reporters on Wednesday he would \"take some time\" before responding, citing ongoing \"intensive discussions\" with the Trump administration on trade. As of May, imports and the rate of raw steel production in the US had changed little since last year before Trump raised tariffs, according to the American Iron and Steel Institute. But steel imports fell 17% in April, compared to March. And businesses selling the metals into the US said they expected Trump's latest announcement to lead to an even more dramatic drop. Trump's moves in March had already prompted Canada and the European Union to prepare to hit back with tariffs of their own American products. On Tuesday, Olof Gill, spokesperson for economic security and trade for the European Commission told the BBC the two sides were engaged in intense talks to try to make progress toward an agreement. \"We're negotiating hard to try and make good deals,\" he said. \"We really hope that the Americans will roll back on this latest tariff threat, as they have done on others, but that remains to be seen.\" In the UK, Trump's announcement put new pressure on the government to pin down the trade deal in the works with the US, which had been expected to provide some protection from the March metals tariffs. Trade Secretary Jonathan Reynolds met with US Trade Representative Jamieson Greer in Paris on Tuesday. His office said it was \"pleased\" that the trade talks had protected UK steel from the latest duties. \"We will continue to work with the US to implement our agreement, which will see the 25% US tariffs on steel removed,\" he said. Gareth Stace, director general of UK Steel, which represents steelmakers, told the BBC that his members had already seen orders cancelled and delayed as a result of the 25% tariffs put in place in March. He warned that a 50% tariff would be \"catastrophic\" for UK exports to the US, about 7% of overall exports. \"The introduction of 50% tariffs immediately puts the shutters up,\" he said. \"Most of our orders, if not all of them, will now be cancelled.\" Economists said the US economy is also facing headwinds, as prices rise as a result of the new measures. A2020 analysisestimated that Trump's first term tariffs created roughly 1,000 jobs in the steel industry, but cost the economy 75,000 jobs in other sectors, such as manufacturing and construction. Erica York, vice president of federal tax policy at the Tax Foundation, said that she expected to see even more extreme job losses this time. \"Some of the strongest evidence is against tariffs on intermediate inputs like steel and aluminium, finding they are much more harmful because they increase the cost of production in the United States,\" she said. \"It's just very foolish to double down on this type of tariff in particular.\" Chad Bartusek is director of supply chain management at Drill Rod & Tool Steels, a small, family-owned manufacturing business in Illinois, which brings in about 800,000 pounds of Austrian-made steel each year, at specifications he says are not produced in the US. Mr Bartusek said he was currently waiting on three containers worth of steel rod, which would have entered the US without duties at the start of the year. As of last week, he had expected to pay tariff costs about $72,000. Instead, he is looking at a tariff bill of almost $145,000. \"I woke up Saturday morning, looked at the news and my jaw dropped,\" he said of Trump's announcement. Mr Bartusek said business had been steady until a few weeks ago. But his firm raised prices earlier this year by 8% to 14% to help cover the new cost of the tariffs. Now customers have been ordering more cautiously and he has had to cut back hours for workers. \"It's one punch after the other,\" he said. \"Hopefully, this settles down quickly.\""
    },
    {
      "headline": "UK temporarily spared from Trump's 50% steel tariffs",
      "summary": "The executive order raises import taxes for US firms buying from other countries - but the levy remains at 25% for the UK.",
      "link": "https://www.bbc.com/news/articles/cg713y73plro",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/1b6f/live/b5898600-40c1-11f0-b300-659a4281ef64.jpg.webp",
      "date": "22 hrs ago",
      "category": "Business",
      "full_text": "The UK has been temporarily spared from US President Donald Trump's executive order doubling steel and aluminium tariffs from 25% to 50%. The order raises import taxes for US-based firms buying the metals from other countries from Wednesday - but the levy remains at 25% for the UK. However, the UK could end up facing the higher rate if itsdeal signed with the Trump administration last month,which would see steel and aluminium tariffs axed, does not come into force. Imports of UK steel into America are currently subject to tariffs, but the UK government said it wanted to implement the agreement to remove them \"as soon as possible\". A spokesperson said the government was \"committed to protecting British business and jobs\", but the Conservatives said the order was a \"fresh tariff blow\" and accused Labour of leaving \"businesses in limbo\". Trump said in the order that the UK needed \"different treatment\" because of the US-UK Economic Prosperity Deal (EPD) signed on 8 May 2025. However, Trump later added that the US might increase the tariff on the UK \"on or after July 9 2025\" if it \"determines that the United Kingdom has not complied with relevant aspects of the EPD\". The UK's carve-out in the executive order comes after Business Secretary Jonathan Reynolds met with US Trade Representative Jamieson Greer in Paris on Tuesday. Last month, the US and UK agreed a deal to reduce or remove tariffs on some goods, which included cutting tariffs on UK steel and aluminium to zero and reducing import taxes on cars to 10%. The agreement is yet to come into force. The US is the biggest importer of steel in the world, after the European Union, getting most of the metal from Canada, Brazil, Mexico and South Korea, according to the US government. When it comes to the UK, America is the destination for about 7% of the country's steel exports worth more than £400m, meaning tariffs have a big impact on the industry. The UK is also home to suppliers of specialist steel products, which ship most of their goods to customers across the Atlantic. Gareth Stace, the chief executive of UK Steel, said it had been \"a rollercoaster ride of uncertainty in the last months, weeks and days\", but that the industry could \"breathe a temporary sight of relief\" that the UK faced tariffs of 25%, rather than 50%. He said \"what we really want to get to is those tariffs removed\" as agreed by the US and UK in May. \"We hope that deal can be made soon enough,\" he added. If that deal gets over the line, the UK steel industry would benefit from US importers having to pay no tariffs compared with products from the EU and other countries, he said. However, an indirect impact is that steel redirected from the US to the UK and other markets could \"displace domestic producers\", he added. Rowan Crozier, chief executive of metal-stamping firm Brandauer in Birmingham, said in the carve-out would mean UK-based firms would not be seeing the same import tariffs as global competitors, but he warned \"far reaching\" uncertainty was \"the more damaging element\". \"That's one thing that the Trump administration continues to do, is to create confusion, with the hope of getting a deal,\" he told the BBC's Today programme. \"Essentially, our customers are less confident in forward planning, or ordering what they need\". However, he said that as a specialist manufacturing business, his US customers had little choice but to pay the tariffs at present. President Trump has imposed tariffs on many countries since returning to the White House in an attempt to encourage businesses and consumers to buy more American-made goods. Tariffs are taxes paid by businesses importing goods from foreign countries. Trump hopes his policy will boost US manufacturing and jobs but many economists have warned it could lead to higher prices for consumers. Alan Auerbach, University of California director of tax policy and public finance, said more US steel production was \"not going to happen overnight\". \"In the short run, buyers are simply going to have to pay more for the steel that they're buying from foreign sources,\" he said. There may be more US production eventually, but uncertainty over what tariffs will look like in the future \"undercuts the aim of getting more US production\", Mr Auerbach added, because firms need that certainty to make investment decisions. Shadow business secretary Andrew Griffith said: \"Labour's botched negotiations have left businesses in limbo and this country simply cannot afford their continuing failure.\" Although UK steel producers may get zero tariffs, to get the trade carve-out the UK cut tariffs on some US beef products, and ethanol. The UK ethanol market in turn is a big customer of wheat farmers. UK efforts to protect those industries could be viewed as backsliding, BBC News business editor Simon Jack said."
    },
    {
      "headline": "Oreo maker sues Aldi in US over 'copycat' packaging",
      "summary": "The discount supermarket is being sued in a US court, accused of imitating the American biscuit brand.",
      "link": "https://www.bbc.com/news/articles/c5yx70k7v9wo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/b702/live/90ddf520-40bc-11f0-bace-e1270fc31f5e.jpg.webp",
      "date": "2 days ago",
      "category": "Business",
      "full_text": "The corporation behind Oreo has filed a lawsuit in the US against the budget supermarket Aldi, accusing it of \"blatantly\" copying the packaging of its famous snacks. Court documents showed that Mondelēz International said Aldi uses similar packaging likely to \"deceive\" consumers and \"ride the coattails\" of the company's \"attraction, fame and prestige\". The snack giant also is behind Wheat Thins, Nutter Butter, Chips Ahoy!, and Ritz - all products the company accuses Aldi of copying with its \"discount\" versions. Aldi US didn't respond to the BBC's request for comment, but its British counterpart stressed that it is not involved in the lawsuit. A spokesperson for Aldi UK told the BBC, that they are \"under the same ownership but operate as completely separate businesses\". Mondelēz, which submitted the lawsuit in May, said it had reached out to Aldi several times about the \"confusingly similar packaging\". Although Aldi did discontinue or alter the packaging of some products, the supermarket has continued making \"unacceptable copies\", the lawsuit stated. The company claimed that if Aldi is allowed to continued with its product lines, it will \"irreparably harm\" the Mondelēz brand. The lawsuit included side-by-side pictures comparing the appearances of Mondelēz' product with Aldi's. In the lawsuit, Aldi is accused of trademark infringement, unfair competition and unjust enrichment. Mondelēz said it is seeking damages. Mondelēz described Aldi's business model as hinging on \"low-priced private label products that resemble the look and feel of well-known brands\". Aldi, which has its headquarters in Germany, is known as a discount supermarket offering affordable alternatives to well-known brands. There are over 2,500 Aldi shops in the US. This is not the first time Aldi has been embroiled in a trademark battle. Earlier this year, it lost a battle with Cider producers Thatchers, which accused the supermarket of copying its drink in \"taste and appearance\"."
    },
    {
      "headline": "Debt and trade issues weaken UK growth, OECD says",
      "summary": "The policy group lowers its UK economy forecast due to trade barriers and Britain's \"very thin\" financial buffer.",
      "link": "https://www.bbc.com/news/articles/cq69j753egeo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/1e02/live/a8305db0-4087-11f0-a90d-79ba88a72a56.jpg.webp",
      "date": "2 days ago",
      "category": "Business",
      "full_text": "UK economic growth will suffer because of US tariff barriers and high interest payments on government debt, an influential global policy group has said. The Organization for Economic Co-operation and Development (OECD) cut its expectations for UK growth this year to 1.3% from the 1.4% it had predicted in March. The think tank has cut forecasts globally due to trade tensions, but said the UK faced particular issues due to its \"very thin\" buffer in public finances, calling on Chancellor Rachel Reeves to boost tax take and cut spending. In response to the OECD's comments, Reeves said she was \"determined to go further and faster to put more money in people's pockets through our plan for change\". Next week, Reeves will set out her Spending Review where she faces tough choices on allocating departmental budgets. The government has already committed billions of pounds to defence, while the NHS is also expected to be a focus amid Labour's pledge to reduce waiting lists. In March, Reeves was forced to announce £14bn in measures, including £4.8bn in welfare cuts, to restore headroom against her self-imposed fiscal rules. While the OECD highlighted better-than-expected UK economic growth, which strengthened to 0.7% between January and March, it cautioned that \"momentum is weakening\" due to \"deteriorating\" business sentiment. It forecast the UK economy would expand by 1% in 2026, compared to the 1.2% it pencilled in a few months ago. \"The state of the public finances is a significant downside risk to the outlook if the fiscal rules are to be met,\" the OECD said. It suggested that Reeves should adopt a \"balanced approach\" of \"targeted spending cuts\" and tax increases to improve the UK's public finances. \"Strengthening the public finances remains a priority... including through the upcoming Spending Review,\" the OECD said. It suggested closing tax loopholes and re-evaluating council tax bands based on updated property values. Under the current system, council tax in England is calculated based on the price the property would have sold for in April 1991. For Wales, it is evaluated on property prices in April 2003. Meanwhile, worldwide growth is now expected to slow to a \"modest\" 2.9%, down from a previous forecast of 3.1%, the OECD said. It blamed a \"significant\" rise in trade barriers and warned that \"weakened economic prospects will be felt around the world, with almost no exception\". The OECD's comments come as Bank of England governor Andrew Bailey told a Treasury Select Committee on Wednesday that the global system of trade agreements had been \"blown up to a considerable degree\" by global trade tensions. Since US President Donald Trump returned to the White House, a long list of countries have been targeted by tariffs, but Trump's unpredictable approach to implementing the measures has created widespread uncertainty. \"We are forecasting basically a downgrade for almost everybody,\" Alvaro Pereira, the OECD's chief economist told the BBC. \"We'll have a lot less growth and job creation than we had forecasted in the past.\" The group also slashed the outlook for the US economy this year from 2.2% to 1.6% and predicted growth would slow again in 2026. It warned that the US was at risk from rising inflation, something that Trump repeatedly promised would fall during his presidential campaign. Prior to the release of the OECD report on Tuesday, Trump wrote on social media: \"Because of Tariffs, our Economy is BOOMING!\" However, the most recent official data showed the US economy shrank at an annual rate of 0.2% in the first three months of this year, the first contraction since 2022."
    },
    {
      "headline": "Pornhub pulls out of France over age verification law",
      "summary": "It's the latest setback for the world's most popular porn site, which is also under investigation by the EU.",
      "link": "https://www.bbc.com/news/articles/c5yelvlnzveo",
      "image_url": "https://ichef.bbci.co.uk/news/1536/cpsprodpb/4a1f/live/e17ee560-4095-11f0-a6a0-1f4a70be2f85.jpg.webp",
      "date": "2 days ago",
      "category": "Technology",
      "full_text": "Aylo, the company which runs a number of pornographic websites, including Pornhub, is to stop operating in France from Wednesday. It is in reaction to a French law requiring porn sites to take extra steps to verify their users' ages. An Aylo spokesperson said the law was a privacy risk and assessing people's ages should be done at a device level. Pornhub is the most visited porn site in the world - with France its second biggest market, after the US. Aylo - and other providers of sexually explicit material - find themselves under increasing regulatory pressure worldwide. The EUrecently announced an investigationinto whether Pornhub and other sites were doing enough to protect children. Aylo has alsopulled out of a number of US states, again over the issue of checking the ages of its users. All sites offering sexually explicit material in the UK will soon also have to offer more robust \"age assurance.\" Aylo, formerly Mindgeek, also runs sites such as Youporn and RedTube, which will also become unavailable to French customers. It is owned by Canadian private equity firm Ethical Capital Partners. Their vice president for compliance, Solomon Friedman, called the French law \"dangerous,\" \"potentially privacy-infringing\" and \"ineffective\". \"Google, Apple and Microsoft all have the capability built into their operating system to verify the age of the user at the operating system or device level,\" he said on a video call reported by Agence France-Presse. Another executive, Alex Kekesi, said the company was pro-age verification, but there were concerns over the privacy of users. In some cases, users may have to enter credit cards or government ID details in order to prove their age. French minister for gender equality, Aurore Bergé, wrote \"au revoir\" in response to the news that Pornhub was pulling out of France. In apost on X [in French], she wrote: \"There will be less violent, degrading and humiliating content accessible to minors in France.\" The UK has its own age verification law, with platforms required to have\"robust\" age checks by July, according to media regulator Ofcom. These may include facial detection software which estimates a user's age. In April - in response to messaging platform Discordtesting face scanning software- experts predicted it would be \"the start of a bigger shift\" in age checks in the UK, in which facial recognition tech played a bigger role. BBC News has asked Aylo whether it will block its sites in the UK too when the laws come in. In May, Ofcom announced it wasinvestigating two pornography websiteswhich had failed to detail how they were preventing children from accessing their platforms. Sign up for our Tech Decoded newsletterto follow the world's top tech stories and trends.Outside the UK? Sign up here."
    },
    {
      "headline": "Tanzania announces shutdown of X because of pornography",
      "summary": "The content is contrary to the nation's \"laws, culture, customs, and traditions\", the information minister says.",
      "link": "https://www.bbc.com/news/articles/cx2e1y02w21o",
      "image_url": null,
      "date": "18 hrs ago",
      "category": "Africa",
      "full_text": "Tanzania has decided to block access to social media platform X because it allows pornographic content to be shared, the information minister has said. The content was contrary to the East African state's \"laws, culture, customs, and traditions,\" Jerry Silaa told a local TV station. Tanzanians have reported that access to X has been restricted in the last two weeks after political tensions rose and the police account was hacked, but there has not yet been a total shutdown of the platform. A  Tanzanian rights group posted on X that Silaa's comments reflected a \"troubling pattern of digital repression\" ahead of October's presidential and parliamentary elections. Tanzania's President Samia Suluhu Hassan's government has been accused of becoming increasingly repressive as it campaigns to remain in office. In its post, the Legal and Human Rights Centre (LHRC) said that X, then known as Twitter, faced a similar shutdown in the run-up to the 2020 election, and the \"recurrence\" of restrictions raised \"serious concerns about the openness of digital space\" in Tanzania. The popular social audio app Clubhouse and messaging service Telegram are also inaccessible without the use of Virtual Private Networks (VPN), the rights group added. It said it was troubling that while the minister confirmed the government's role in blocking X, government officials and public institutions continued to use the platform. \"This inconsistency confuses the public and undermines the credibility of the government's position,\" LHRC added. In his interview, Silaa linked the ban to X's announcement last year that it would no longer block \"consensually produced and distributed\" adult content. The minister was quoted as sayingthat X has \"permitted explicit sexual material, including same-sex pornographic content\" in breach of Tanzania's online \"ethics guidelines. \"Even on YouTube, you might notice that some content is inaccessible. That's part of our broader effort to protect consumers and ensure that all online platforms operating in our country comply with our laws,\" Silaa said. On 20 May, internet watchdog Netblocks reported that X was unavailable in Tanzania following reports that the official police account had been hacked, showing pornographic material and falsely claiming that the president had died. Pornographic content also appeared on the hacked YouTube account of the tax authority, AFP news agency reported. It is unclear who carried out the hacking, but it coincided with a government crackdown on Kenyan and Ugandan human rights campaigners who had gone to Tanzania to show solidarity with main opposition leader Tundu Lissu. He has been detained on a charge of treason after he said he would spearhead a campaign to boycott the elections if the laws were not changed to allow for a free and fair poll. Kenya's former Justice Minister Martha Karua was among those deported after arriving at the international airport in Tanzania's main city Dar es Salaam, ahead of a court appearance by Lissu. He denies the treason charge, saying the case is political. Kenyan activist Boniface Mwangi and Uganda's Agather Atuhaire were allowed to enter, but were then detained for several days. After returning home, Atuhaire told the BBC that she had been blindfolded, \"violently\" stripped and sexually assaulted. On Monday, Mwangi said he too had been sexually abused in detention and was told by his torturers to say \"asante\" (thank you in the Swahili language) to their president. Dar es Salaam's police chief denied the allegations, saying they were \"opinions\" and \"hearsay\". Regional rights groups have called for an investigation, and Amnesty International said Tanzanian authorities should hold to account those responsible for the \"inhuman\" treatment. President Samia has said that her government will not tolerate activists from other East African states \"meddling\" in Tanzania's affairs and causing \"chaos\". She inherited the presidency following the death in 2021 of then-President John Magufuli, and was widely praised for allowing greater political freedom. But her critics say she is showing the same authoritarian tendencies as Magufuli as she prepares to contest her first election as the ruling party's presidential candidate. The government says Tanzania is a stable democracy, and the poll will be free and fair. Go toBBCAfrica.comfor more news from the African continent. Follow us on Twitter@BBCAfrica, on Facebook atBBC Africaor on Instagram atbbcafrica"
    },
    {
      "headline": "Analysis: Tariff relief for UK but new clock ticking on US deal",
      "summary": "If the UK's deal with the US is not finalised by 9 July, the UK's tariff on steel will go back up to 50%.",
      "link": "https://www.bbc.com/news/articles/cwy6xz76z32o",
      "image_url": null,
      "date": "1 day ago",
      "category": "Business",
      "full_text": "It is hard to argue the UK exemption from the doubling of US tariffs on imported steel from 25 to 50% is not good news. It was not a given that the UK would get this carve-out despite having done a deal on 8 May to reduce tariffs on the metals to zero. That agreement is not yet in force, however, and speaking to steel industry leaders and government officials right up until Tuesday night's announcement, their working assumption was that the UK would be in the same boat as everyone else - facing tariffs of 50% until that deal was finalised. There was a palpable sense of relief from UK trade officials when the exemption was included in President Donald Trump's latest executive order. Up until that point, the UK government didn't actually know whether it would receive special treatment. It found out the same time everyone else did, and managed to avoid what would have been a somewhat diplomatically embarrassing episode after hailing the tariff pact as \"historic\". Having said that there is now a new clock ticking. Tuesday's announcement contained a provision that if the deal is not finalised by 9 July, the UK's steel tariff rate would be hiked to 50%. So now you have an uncertain period when businesses on both sides of the Atlantic don't know if the tariff will be zero or 50% in five weeks' time - which anecdotally is having a corrosive effect on business. There is no reason to assume the deal won't come into force. The government said that Business Secretary Jonathan Reynolds and US Trade Representative Jamieson Greer agreed that both would work faster so customers in US and UK benefit from the agreement. However, there is a second-order effect - that international steel earmarked for the US could now be diverted to the UK and create a glut of the metal and undercut domestic steelmakers. The industry has been quick to voice such concerns and wants the government to implement barriers of its own to prevent that. The UK exemption and ultimate deal is not a free lunch. The UK government agreed to cut tariffs cut on some US beef products and ethanol - a renewable fuel made from crops. It has created a crisis in the UK ethanol market, which in turn is a big customer of wheat farmers. It is possible that UK efforts to protect these industries could be viewed by the US as backsliding on the deal they struck with the UK. It's a reminder that these deals have complex and sometimes underestimated knock on effects."
    }
  ]
}