{

    "notice-1": [
        "NOTICE OF PUBLIC SALE OF PERSONAL PROPERTY Pursuant to the California Self-Service Storage Facility Act, (B & P Code 21700 et. Seq.) and the judgement entered on January 16, 2024 in the action entitled \"Rhoads Property Holdings, LLC, dba CSI Mini Storage vs. Sara M. Hauge\", et al, Case No. 22CV021257 (Copy Attached), the undersigned will sell at Public Auction on Thursday, February 15, 2024 at 1:00 pm the personal property stored by Sara M. Hauge in Storage Unit Numbers: 104, 51A, 63B and 69F, which are located at: Rhoads Property Holdings, LLC, dba CSI Mini Storage 51 W. Hornet Ave., Alameda, CA. 94501 Ph: (510) 748-1851 The auction will be conducted by Nor Cal Storage, Auctions, Inc. Bond No. 7900468597 Ph. (916) 604-9695 ATS# 6804679 Jan. 25, Feb. 1, 2024"
        ],
    "notice-2": [
         "Notice of Public Onsite Auction NOTICE IS HEREBY GIVEN that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to sections 21700 - 21716 of the CA Business and Professions Code, CA Commercial Code Section 2328, Section 1812.600 - 1812.609 and Section 1988 of CA Civil Code, 353 of the Penal Code. The undersigned will sell at public sale by competitive bidding on Tuesday the 20th day of February, 2024 at 10:30 A.M., on storagetreasures.com: household goods, tools, electronics, and personal effects, have been stored and which are located at Trojan Storage of Salinas, 110 Kern Street, Salinas, California 93905, County of Monterey, the following: Customer Name, Unit #: Rosalia Castro Garcia, 22; Elba Xitalic Michel Gomez, 46; Danuelle Mcdonald, 97; Chantel Le Treece Chambers, 102; Gema Ramirez, 121; Angelena Broussard-Barnes, 227; Louis Perez, 230; Dominga Pichardo, 302. Purchases must be paid for at the time of purchase in cash only. All purchased items sold as is, where is and must be removed at the time of sale. Sale subject to cancellation in the event of settlement between owner and obligated party. Andasol Management, Inc. Bond #: 791831C (888) 264-5438 CN103417 02-20-2024 Jan 31, Feb 9, 2024"
        ],
    "notice-3": [
        "Public Online Sale Redtop Storage 1322 Nord Ave., Chico, CA 95926. Notice is hereby given that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to Sections 21700-21716 of the Business & Professions Code, Section 2328 of the UCC, Section 535 of the Penal Code and provisions of the Civil Code. The undersigned will sell by online auction at: www.storagetreasures.com, beginning 10:00 am, February 5th, 2024 and ending 10:00 am, February 8th, 2024. The premises where said property is stored are located at Redtop Storage 1322 Nord Ave, Chico, (CA) county of (Butte), State of California, for the following parties: Stacie Peters - misc goods Stacie Peters - misc goods Jackie Murray - misc goods All purchased items must be paid for in CASH within 48 hours of the close of auction, all items are sold as is, where is, and must be removed within 48 hours after close of online auction. A $100 refundable deposit is required for each unit. Sale is subject to cancellation in the event of settlement between owner and obligated party. Agent reserves the right to halt sale of any unit. Redtop Storage (530) 892-9153 Storage Treasures California Bond #63747122 Published 01/25, 02/01/2024"
        ],
    "notice-4": [
        "Notice of lien sale: Saturday 02/09/2024 at 1:00pm at Bidwell Self Storage, 65 Heritage Lane, Chico, 530.893.2109. Pursuant to California Business Code 21700, in lieu of rents due, the following units contain clothes, furniture, boxes, household goods, etc. The unit numbers and names are: 009CC, 5x6, Angelina Ledesma, clothes, boxes and household items 028CC, 10x12, John Silveira, clothes, boxes and household items 117CC, 5x5, Connor Rierra, clothes, boxes and household items 244SS, 10x12, John Silveira, clothes, boxes and household items 257SS, 5x7, Bradley Webber, clothes, boxes and household items 270SS, 5x5, Travis Nelson, clothes, boxes and household items 278SS, 6x10, Henry Harmon, clothes, and boxes 279SS, 6x12, Michelle Stanton, clothes, boxes and household items 468AC, 5x5, Christopher Williams, clothes and boxes 475CC, 10x12, Gianni Bruzon, clothes, boxes and household items Published 01/25, 02/01/2024"
        ],
    "notice-5": [
        "NOTICE OF LIEN SALE AT PUBLIC AUCTIONNotice is hereby given that personal property in the following units will be sold at public auction, on the 14th day of February, 2024 at or after 8:30am pursuant to the California Self-Storage Facility Act. The sale will be conducted at: U-Haul Moving & Storage of Inglewood, 964 S. La Brea Ave. Inglewood California 90301. The items to be sold are generally described as follows: clothing, furniture, and/or other household items stored by the following persons:Christian Frazier0904Triva Carter2340Tenay Travis1342Eugena Cooley2095Brandi Ridgle1007Long Beach Press-TelegramPublished: 1/31, 2/7/24"
        ],

    "notice-57": [
        "NOTICE OF SALE OF ABANDONED PROPERTYNotice Is Hereby Given That Pursuant To Sections 21700-21716 Of The Business And Professions Code, Section 2328 Of The UCC, Section 535 Of The Penal Code And Provisions Of The Civil Code, Frontage Self Storage, 528 Division St. , Nipomo, CA, 93444 Will Sell By Competitive Bidding The Following Units. Auction to Be Conducted through Online Auction Services of WWW.LOCKERFOX.COM, with bids opening on or after Thursday February 01, 2024 at 12:00 pm and closing on or after Thursday February 08, 2024 at 12:00 pmThe Personal Goods Stored Therein by the Following May Include, but are not limited to: MISC. HOUSEHOLD GOODS, PERSONAL ITEMS, FURNITURE, CLOTHING AND/OR BUSINESS ITEMS/FIXTURES.Purchases Must Be Made with DEBIT or CREDIT CARD, CERTIFIED CHECK or MONEY ORDER ONLY and Paid at the time of Sale. All Goods are Sold as is and must be Removed within 72 Hours of the time of Purchase. Frontage Self Storage , Reserves the Right to Retract Bids. Sale is Subject to Adjournment. Sale is subject to cancellation in the event of settlement bid at: www.lockerfox.com.Amanda SmithPub dates: Jan 24, 31, 2024Legal 296889"
    ],
    "notice-58": [
        "NOTICE OF LIEN SALE StorQuest - Santa Maria / Betteravia Notice is hereby given, StorQuest Self Storage - 1400 W. Betteravia Road, Santa Maria, CA 93455, will sell at public sale by competitive bidding the personal property of: Timothy Basset and Rosales Auto Inc.. Property to be sold: Furniture, Appliances, Totes, Boxes, Personal Items, Electronics, Auto Parts, Kitchen Items. Auctioneer company: www.storagetreasures.com. The Sale will conclude at 4:00 PM on 02/08/24. Goods must be paid for in CASH and removed at the time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. Publish on 01/24/24 and 01/31/24. Pub dates: Jan 24, 31, 2024 Legal 297019"
    ],
    "notice-59": [
        "Lien Sale﻿Notice is hereby given that the undersigned intends to sell the personal property described below to enforce a lien imposed on said property pursuant to sections 21700-21716 of the Business & Professions Code, section 2328 of the UCC, Section 535 of the Penal Code and provisions of the Civil Code.The undersigned will sell at a public sale by competitive bidding on the 9th day of February at 1:00 pm, on the premises where said property has been stored and which is located at Green Box Rentals, Inc., 6988 Avenue 304, Visalia, County of Tulare, State of California, the following:Agee, David - Storage unit 18-1631Miscellaneous items.Purchases must be paid for at the time of purchase in cash only. All purchased items sold as is, where is and must be removed at the time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party.Dated January 10, 2024Todd Nottingham 559 733-5345Sun-Gaz 1/24, 1/31/24094-05"
    ],
    "notice-60": [
        "NOTICE OF PUBLIC SALE OF LIENED PROPERTYNotice is hereby given that a Lien Sale will be held at Mini U Storage, 1177 Camelback Street, Newport Beach, CA 92660, on 2/15/2024 at 10:30am to satisfy the lien on the property stored at the address above in the units listed. Tenants notated the inventories listed at the time of rental. Landlord makes no representation or warranty that the units contain said inventories.Englebert Vis, B2588, Misc HouseholdJessica Belair, A1105, Misc HouseholdBrooke Radcliffe, B2709, Misc Household, Personal EffectsJeffery Pollock, B2551, Misc Household, Personal EffectsAll units must be paid for at the time of sale. Cash only will be accepted. No one under the age of 18 is allowed to attend the sale. Each person attending must sign in and agree to follow all Rules and Regulations of the sale. The landlord reserves the right to bid at the sale. All purchased goods are sold \"as is\" and must be removed within 48 hours following the sale. Shelving is property of landlord; do not remove unless authorized. Buyers must provide a current, original or a photocopy of their original resale permit at time of sale in lieu of sales tax. This sale is subject to cancellation in the event of settlement between landlord and obligated party."
    ],
    "notice-61": [
        "Notice is hereby given that Bakman Water Company (BWC) has requested authority from the California Public Utilities Commission (CPUC) by Advice Letter (AL) 106-W to establish a surcharge for the Rolling Hills service area to repay a loan from the Drinking Water State Revolving Fund to cover the actual cost for the proposed project. The proposed project consists of the installation of customer water meters, water main replacements and realignment for a section of the distribution system, refurbishment of an existing well, and the addition of cathodic protection to the water storage tank. AL No. 106-W was filed in compliance with applicable rules of General Order 96-B. This filing will not interfere with the operation of BWC's other public utility operations. A copy of the AL is available for inspection at 5105 East Belmont Avenue, Fresno, California 93727. Anyone may respond to or protest this Advice Letter."
    ],

    "notice-141": [
        "Notice is hereby given, StorQuest Self Storage 42625 Jackson St, Indio CA 92203 will sell at public sale by competitive bidding the personal property of: Hayde Nieto, Oscar Antonio Valenzuela, Lydia Ruiz, Amanda Del Toro, Luis Brandon Garcia, Luis David Hernendez, John Eldon Jr Kindt, Josephine Nava, Rodrigo Jr Pena Misc. household goods, furniture, tools, clothes, boxes, & personal contents. Auctioneer Company: www.storagetreasures.com. The Sale will conclude at 12:00 PM on FEBRUARY 14, 2024. Goods must be paid in CASH and removed at time of sale. Sale is subject to cancellation in the event of settlement between owner and obligated party. TPR24-1045 01/30, 2/6, 2024 ___________________________________________"
    ],
    "notice-142": [
        "Notice of Self Storage SalePlease take notice SecureSpace Self Storage Los Angeles Firestone located at 2268 Firestone Blvd Los Angeles AC 90002 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 4:00PM. Yoba Bethel; Roselani Lozano; Manuel Beltran Perez; Aelea Hill; James Cartwright; Desiree McGhee; Alejandra Depaz; Cordell Clayborn; Jovon Ross; Shaneika Adrienne Hall; Lachelle Arnold; Susana Rodriguez; Marie Garcia; Andrea Hill; John Hackman; Jonnathon Quintero; Shaminicia Butler; Sergio Gonzalez; Megan Kelley; Johnny Evans; Lilia Carino Guzman; Yolanda Garcia Olivares; Jesus Hernandez Gomez. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-143": [
        "NOTICE OF LIEN SALE NOTICE OF SALE OF PERSONAL PROPERTY Extra Self-Storage Paradise Pursuant to the California self-storage facility act: (B&P code 21770 et.sec.) The undersigned will sell contents of: Name: Frank Horio Name: David Schick Name: Trevor Thatcher Name: Trevor Thatcher TO THE HIGHEST BIDDER ON: February 6, 2024 ENDING AT 3:00 PM SALE TO BE HELD ONLINE AT: www.StorageTreasures.com Purchases must be paid at the time with Cash only. Sale subject to cancellation. Company reserves the right to refuse any online bids. 01/31/2024"
    ],
    "notice-144": [
        "Pursuant to Chapter 10, commencing with Section 21700 of the Business Professionals Code, NOTICE IS HEREBY GIVEN that Lighthouse Storage will sell at public sale by competitive bidding on February 13, 2024 at 10:30 A.M. on the premises where the said property has been stored and which are located at Lighthouse Storage 14400 Beach Blvd. Westminster, 92683 , State Of California, County of Orange, the following: Emmanuel Jaramillo, Glenn Jones, Gengo Grip & Lighting LLC/Christopher Charles Rauch, Teresa MyHuong Vu, Bich Van Thi Nguyen. Vacuum Cleaner, Chest, Shoes, Bags, Tools, Boxes, Totes, Luggage, Ice Chests, Skateboard, mattress, box spring, garden tools, power tools, hand tools, pallet mover, crates, type writer, air compressor, paintings, clothes, dresser, television, Computer, monitor, speakers, holiday décor, drum set, lights, Etc. Must be paid in cash only. There is a $100 minimum cleaning deposit on all units. All purchased items are sold as is, where is and must be removed at time of sale. Sale subject to cancellation up to the time of the sale and company reserves right to refund any bid. American Auctioneers B/N #FS8632014. Phone number: 8008387653."
    ],
    "notice-145": [
        "Notice of Self Storage SalePlease take notice Budget Self Storage - Lancaster located at 42722 N 10th Street W Lancaster, CA 93534 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Durlene Olevia Westfall; Lakisha Gordon; Michael Christopher Hensley; Cahulon Lee; Javier Hernandez; Ari Efani Bedford-Williams; Valerie Klemick; Abigail Harris; Eric Turner; Derrick Athanasius Jr Velasquez; Manuel Gerardo Cardenas; Lair Damon Nolan Jr. This sale may be withdrawn at any time without notice. Certain terms and conditions apply."
    ],
    "notice-146": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Orange located at 1460 N. Main St., Orange, CA 92867 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Azel Gustavo Gonzalez; Brenda Sanchez; Christopher David Allen; Christopher Lee Conry; David Harvey Everston; Edward Charles Fahrenholz; John Glenn Padilla (2 units); Kimberly Candelaria Marie Singh; Krysti Jo Branstetter; Krystle D K S S BelmontePhillips; Rodney Jr. Goldsberry; Ronald Jr. Bennett. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],
    "notice-147": [
        "Notice of Self Storage Sale Please take notice US Storage Centers Costa Mesa located at 1600 Superior Avenue Costa Mesa, CA 92627 intends to hold a public sale to the highest bidder of the property stored by the following tenants at the storage facility. The sale will occur as an online auction via www.storagetreasures.com on 2/15/2024 at 12:00PM. Clark Anthony Wimer/The Honest Energy Company; Samantha Marcela Fonseca; Omar Villegas; Guadalupe Rojas Vazquez. This sale may be withdrawn at any time without notice. Certain terms and conditions apply. The Orange County Register Published: 1/30/24"
    ],

    "notice-292": [
        "NOTICE OF PUBLIC SALE OF PERSONAL PROPERTY Pursuant to the California Self-Service Storage Facility Act, (B & P Code 21700 et. Seq.) and the judgement entered on January 16, 2024 in the action entitled \"Rhoads Property Holdings, LLC, dba CSI Mini Storage vs. Sara M. Hauge\", et al, Case No. 22CV021257 (Copy Attached), the undersigned will sell at Public Auction on Thursday, February 15, 2024 at 1:00 pm the personal property stored by Sara M. Hauge in Storage Unit Numbers: 104, 51A, 63B and 69F, which are located at: Rhoads Property Holdings, LLC, dba CSI Mini Storage 51 W. Hornet Ave., Alameda, CA. 94501 Ph: (510) 748-1851 The auction will be conducted by Nor Cal Storage, Auctions, Inc. Bond No. 7900468597 Ph. (916) 604-9695 ATS# 6804679 Jan. 25, Feb. 1, 2024"
    ],
    "notice-293": [
        "NOTICE OF PUBLIC SALE Self-storage Cube contents of the following customers containing household and other goods will be sold for cash by CubeSmart Management, LLC 40410 California Oaks Rd, Murrieta, CA 92562 to satisfy a lien on February 14th, 2024, at approx. 1:30pm at www.storagetreasures.com: Brittany Bowens, Chantel Schock, Paul Henderson, Paul Henderson, GRACE SMITH, Dennel Sarsoza, Michelle Tusler, Leslie Coe"
    ],
    "notice-294": [
        "NOTICE OF PUBLIC SALE: Self-storage Cube contents of the following customers containing household and other goods will be sold for cash by CubeSmart Management, LLC 1680 W Redlands Blvd Redlands, CA 92373 to satisfy a lien on February 15, 2024 at approx. 10:00 AM at www.storagetreasures.com: Esmeralda Howard, Rafael Roy Padilla, Ifeanyi Ugochuku, Darren S Whitty, Eduardo Angeles, Mya Roberts Redlands Daily FactsPublished: 1/26/24"
    ],
    "notice-295": [
        "Notice of Lien Sale C&M Self Storage, 297 Brush ST, Ukiah, CA 95482, will cause to be sold to the general public online, personal property, beginning 01/29/2024 and will end on 02/07/2024. Online auction hosted by www.storagetreasures.com Tenant name: Jon Chambers"
    ],
    "notice-296": [
        "Notice of Public Auction As defined by the California Self Storage Facilities Act, Business and Professions Code sections 21700 - 21716. American Self Storage LLC. Auction Start Date 02/04/2024. Auction End Date 02/14/2024 at 8:00 AM. Auction will be conducted entirely online at http://www.storagetreasures.com Auctioneer: Storage-Treasures LLC. Phone: (480) 397-6503 Property being sold: All units: Miscellaneous household goods G-28 Robert Miguel H-18 Connie Morrison I-29 Robert Miles Published: 01/21, 01/28/2024"
    ],
    "notice-297": [
        "LIEN SALENotice is hereby given that a public lien sale of the following describes personal property will be held online at www.storageauctions.comAuction Date: Monday February 05, 2024 at 9:00 amLocation: Old Barn Self Storage, 175 Spring Hill Drive, Grass Valley, CA, 95945The contents of the rental storage units all containing household goods and belonging to the following persons will be sold:Phil KrausseVanessa PlaugherBrooke MayfieldKendra ThibodeauWilliam FraserThis notice is given in accordance with the provisions of Section 21700 et seq of the Business & Professions Code of the State of CaliforniaPublished: January 20, 27, 2024"
    ],
    "notice-298": [
        "Keep-It Self Storage(formerly AirPark Mini Storage)Notice of Lein SaleUNIT # 758DUPONT, ANTHONYUNIT # 762SOUZA, PAULUNIT # 803ROMANO CHICLIFFUNIT # K2B64ALVARADO, VINCEUNIT # K2D60PANKEY, CHELSEAUNIT # K2D59REED, PHILIPUNIT # K2C65, K2D65 & K2D76MILLS, JAYUNIT # K2D29WHITEDONEY, TIFFANYUNIT # 511LALLY, KEIRAUNIT # 858ABRAMS, HOLLYUNIT # 410WRIGHT, GARFIELDUNIT # K2B52LEE, ELLAAuctions will be held MONDAY February 12th at 9AMon StorageTreasures.comKeep-It Self Storage12906 Loma Rica DriveGrass Valley, CA 954959:00 AM to 5:00 PM, MON-FRI(530) 272-3391Published: January 27, February 3, 2024"
    ]
}